{"Jobs": {"All Other Remote Jobs": [{"Region": "Anywhere in the World", "Title": "Yoko Co: Production Manager", "Category": "All Other Remote", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0018/9650/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> McLean, VA\n    <br /><strong>URL:</strong> <a href=\"https://www.yokoco.com/\">https://www.yokoco.com/</a>\n</p>\n\n<div>We’re seeking a Production Manager with excellent organizational skills and a desire to make a positive impact on the world. You’ll lead the team members to the right projects at the right time, helping estimate, forecast, and balance workload as efficiently and effectively as possible. <br><br>\n</div><div>You’ll act as a bridge between the analytical and the human side of getting work done – helping to put people in the position and headspace to be successful for our clients – and contributing to optimizing and designing new resourcing strategies.  <br><br>\n</div><div>\n<strong><br>Why work at Yoko Co?<br></strong><br>\n</div><ul>\n<li>\n<strong>Do good, better:</strong> We exclusively serve clients who make a positive impact on the world. This is your chance to build things that help create a better place for all of us.</li>\n<li>\n<strong>4-day work week and lots of holidays.</strong> Mondays are flex days, meaning you’re free to take them off if you’re caught up on your work. Plus, we’re closed for nearly a full week at Thanksgiving (November), and two weeks at the end of the year, plus a bunch of other days, too. Work-life balance FTW!</li>\n<li>\n<strong>High performance, no jerks.</strong> You’ll collaborate with good people who believe in doing great work.</li>\n<li>\n<strong>Best Place to Work (and that’s not just our opinion).</strong> We’ve been named a Best Place to Work by Inc. and Washington Business Journal.</li>\n</ul><div>We value team members who are motivated by our mission and driven to make a positive impact. If you have a passion for excellence, a growth mindset, and a commitment to collaboration, we’d love to hear from you.<br><br>\n</div><div>\n<strong><br>In this role, you’ll:<br></strong><br>\n</div><ul>\n<li>\n<strong>Forecast:</strong> Lead the scheduling and resource planning of projects across the entire team, to ensure we have sufficient resources to execute on promised deliverables and timelines. </li>\n<li>\n<strong>Estimate:</strong> Collaborate with various team members and clients to gather and define project requirements, so we can provide accurate time and resource estimates, and ensure project scopes and schedules are in alignment with expectations. </li>\n<li>\n<strong>Assign:</strong> Match team members to projects, based on skill set, availability, successful past collaborations, deadlines, and interest. </li>\n<li>\n<strong>Balance:</strong> Collaborate with Project Managers to actively monitor and adjust current resource allocation and assignments, based on constantly shifting schedules, scope changes, and general priorities. </li>\n<li>\n<strong>Analyze: </strong>Review post-project data, including tracked hours, slippage, internal and external ratings, budget performance, and other data points to better understand our effectiveness. </li>\n<li>\n<strong>Optimize:</strong> Provide insights and recommendations, and present new strategies to further improve execution, workload balance, and company performance. </li>\n</ul><div>\n<strong><br>To succeed in this position, you’ll need: <br></strong><br>\n</div><ul>\n<li>A proven track record of your ability to successfully juggle many simultaneous, and often competing, priorities.</li>\n<li>An analytical, highly-organized approach to your work, with excellent critical thinking and planning abilities. </li>\n<li>Truly top-notch communication and interpersonal skills.</li>\n<li>The ability to empathize with individuals and understand the human component of motivating a high-performance team.</li>\n<li>Hands-on experience working with a variety of project planning, tracking, and resource management software tools, such as Asana, Harvest, AirTable, and others. </li>\n<li>A solution-oriented mentality, and the perspective, context, and awareness to address complex problems in a sustainable way.</li>\n<li>Experience working in an agency or software development environment. </li>\n<li>Availability to work at least 5 hours overlap with 9-5 pm ET.</li>\n<li>A genuine desire to contribute to the growth of our team and the quality of our work.</li>\n</ul><div>\n<strong><br>What you get:<br></strong><br>\n</div><div>You’ll get a flexible schedule, unlimited time off, a competitive salary, a profit share bonus (starting in your second year), the ability to work wherever you want, a personal development budget, and all US federal holidays and multiple weeks off at the end of the year to recharge. We’ll also offset your entire carbon footprint. If you’re in the US, we also offer health insurance, disability and life insurance, and 401(k) matching.<br><br>\n</div><div>\n<strong><br>More about us:<br></strong><br>\n</div><div>We’re a group of people who are passionate about the work we do, the clients we serve, and improving our craft. We also care about each other — we don’t think of one another as coworkers or employees, but as fellow humans. From developers to designers, project managers to strategists, we bring out the best in each other.<br><br>\n</div><div>We’ve been in business for over a decade, our whole team is remote, we’ve been named a Best Place to Work by the Inc. 5000 and the Washington Business Journal. <br><br>\n</div><div>\n<strong><br>To apply:<br></strong><br>\n</div><div>If you’re interested, send an email and your resume to careers@yokoco.com with the subject line “Project Tetris” — and while you’re at it, we’d love to learn a bit more about you, and all the neat stuff you’ve done. <br><br>\n</div><div>We take applicants from all over the world. However, you must be willing to work a schedule that overlaps with normal US business hours. <br><br>\n</div><div>Please note that we will begin responding to applications the week of January 8, 2024. <br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/yoko-co-production-manager\">https://weworkremotely.com/remote-jobs/yoko-co-production-manager</a></p>\n", "Publication Date": "Tue, 12 Dec 2023 22:11:13 +0000", "Link": "https://weworkremotely.com/remote-jobs/yoko-co-production-manager", "Expiry Date": "Thu, 11 Jan 2024 22:11:13 +0000"}, {"Region": "Anywhere in the World", "Title": "Nathan James: Director of Digital Merchandising", "Category": "All Other Remote", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Canada\n    <br /><strong>URL:</strong> <a href=\"https://nathanjames.com/\">https://nathanjames.com/</a>\n</p>\n\n<div>Nathan James is looking for an experienced digital merchandiser to join our team and lead the merchandising division. This role is responsible for improving conversion rates through digital merchandising strategy and execution for both DTC and wholesale (Amazon, HomeDepot.com, etc) Ecommerce channels in order to support continued revenue growth.</div><div> <br><br>\n</div><div>\n<strong>People-first company, design-first home.<br></strong><br>\n</div><div>We are a design-first, home furnishing company making on trend decorating affordable. We stand behind the quality of our product, we have a lifetime warranty and a 100-day hassle-free return policy on all products. <br><br>\n</div><div>Our commitment extends beyond just products; we care about people time, from accessible and frictionless customer service, free &amp; fast delivery, to straightforward assembly. Our 10,000+ five-star reviews are a testament to our promise. <br><br>\n</div><div>Our care of people extends to our team. We understood the importance of being fully distributed (remote) from the beginning. We strive to reduce friction at work while preserving the human experience. Taking this approach helps our teammates avoid compromising who they are or their values in pursuit of a career. <br><br>\n</div><div>\n<strong>About the role<br></strong><br>\n</div><div>As Director of Digital Merchandising you will ensure that we are presenting our products in the most compelling way to our customers while continually improving our onsite shopping experience.<br><br>\n</div><div>In this role you will manage end-to-end our site including content to drive high-quality launches and refreshes. You'll report to and be the right hand to the VP Ecommerce, leading a team of three visual designers and three coordinators, while working along side our software team. You will both set the merchandising vision and manage the execution while evolving the workflows to simplify processes. This role takes sales initiatives and clearly distills them into customer-centric experiences, providing business context to creative teams for execution, ensuring content is revenue-driving and impactful. <br><br>\n</div><div>This role is responsible for:<br><br>\n</div><div>\n<strong>All digital content including customer facing product content, ensuring its accuracy across all relevant platforms and feeds<br></strong><br>\n</div><div>\n<strong>Merchandising calendar to ensure we capitalize on key shopping moments and seasonal campaigns utilizing all customer touch points<br></strong><br>\n</div><div>\n<strong>Managing custom shopify development projects in order to bring to life the best onsite customer experience<br></strong><br>\n</div><div>\n<strong>Product detail pages, search, collection pages and navigations to focus on conversion, findability, maximizing engagement, and frictionless shopping.<br></strong><br>\n</div><div>\n<strong>Application of SEO best practices to enhance the visibility and ranking of digital content on search engines.<br></strong><br>\n</div><div>\n<strong>Supporting VP of Ecommerce with forecasting and ad creative strategy <br></strong><br>\n</div><div><br></div><div><br></div><div><br></div><div>Our current stack: Shopify Plus, Reviews.io, Rebuy, Replo, Google Merchant Center, Google Search Console, Facebook Commerce Manager, Northbeam, Shareasale, Klaviyo, Postscript, Aftership, Google Analytics, Make.com / Integromat, Zapier, Airtable, RetentionX, and Amazon Quicksights <br><br>\n</div><div>\n<strong>About us<br></strong><br>\n</div><div>We appreciate that time is our most valuable resource. That’s why we try to solve for happiness. Although our happiness is mostly defined by our relationship with ourselves, as an organization our goal is to ensure we don’t negatively affect that baseline. Some of the ways we do that are, removing processes  and ideologies that get in the way of doing our best work, designing benefits that support a healthy relationship with our work, and engaging with our<a href=\"https://nathanjames.com/pages/operating-values\"><strong> operating values</strong></a><strong> </strong>to guide us in our work. We use these frameworks and more to build a thoughtful and resilient organization.<br><br>\n</div><div>\n<strong>We also understand working for Nathan James isn’t the only function of your life, and we respect that! We’ve found that a team member who will be happy and fulfilled as a remote team member at Nathan James is someone who generates their social energy  and identity outside of work. That’s why we don’t create mandatory team hangouts or events. We focus on how to improve collaboration, not forcing engagement.<br></strong><br>\n</div><div>We focus on what we’re solving for, so we don’t create barriers or expectations that distract us from our<a href=\"https://nathanjames.com/pages/our-mission\"><strong> mission</strong></a>. We also don’t set unreasonable working hours, deadlines, or goals. We create with calm, “slow is smooth and smooth is fast”.  <br><br>\n</div><div>When you join the Nathan James team, you can expect a thorough, but mindful onboarding process with ramp-up time to learn. You can expect to give and provide direct feedback. You can expect minimal meetings. You can expect to work with dependable, smart and good people. You can expect to be counted on. Most importantly, you can expect to do the best work of your career here.<br><br>\n</div><div>\n<a href=\"https://www.glassdoor.com/Overview/Working-at-Nathan-James-EI_IE2394685.11,23.htm\"><strong>Check out Glassdoor</strong></a>  to hear what the team has to say about working at Nathan James.<br><br>\n</div><div> <br><br>\n</div><div>\n<strong>About you<br></strong><br>\n</div><div>You have directly led a digital merchandising team for an Ecommerce consumer organization with at least $50m in annual revenue. You have  experience both setting and maintaining high merchandising standards. You’re able to combine your creative vision with solid business acumen to implement merchandising initiatives with a focus on financial impact . You're comfortable diving into the data to effectively separate the signals from the noise in order to identify short-term improvements and to inform long-term strategies. <br><br>\n</div><div>You are comfortable getting your hands dirty and thrive in environments where you can make decisions on intuition or partial data instead of having to sell your ideas to a committee. You are an avid Ecommerce shopper, who resonates with our target demographic. You're someone who understands the sales funnel with an eye on both the driver and destination. You enjoy technical challenges, are highly organized, and capable of managing ambiguity and risk. <br><br>\n</div><div>\n<strong>On a granular level we’re looking for:<br></strong><br>\n</div><div>\n<strong>3+ years of merchandising leadership experience<br></strong><br>\n</div><div>\n<strong>7+ years in consumer Ecommerce<br></strong><br>\n</div><div>\n<strong>3+ years experience with GA or similar analytics platform<br></strong><br>\n</div><div>\n<strong>2+ years experience with most of the Nathan James stack<br></strong><br>\n</div><div><br></div><div>Preferred experience (not required)<br><br>\n</div><div>\n<strong>Experience with SQL, R, HTML or CSS<br></strong><br>\n</div><div>\n<strong>Technical aspects such as SEO, responsive design, and usability to enhance the user experience.<br></strong><br>\n</div><div><br></div><div>For this role we do require that your normal workday has at least 4 hours overlap with the Montreal workday (currently UTC-5) without impinging on your personal/family life. <br><br>\n</div><div>\n<strong>This is a remote role, since we are a remote company! You’re free to work where it suits you best. Effective writing, self-discipline, and comfort with open communication is especially critical in a remote environment.<br></strong><br>\n</div><div>\n<br><br>\n</div><div>\n<strong>Benefits &amp; Perks<br></strong><br>\n</div><div>\n<a href=\"https://nathanjames.com/blogs/latest/benefits-perks-nathan-james\">Our benefits</a>  are all aimed at supporting a life well lived both at work and away from work.<br><br>\n</div><div>We offer competitive salaries<br><br>\n</div><div>\n<br><strong>How to apply<br></strong><br>\n</div><div>\n<strong>Please submit an application </strong><a href=\"https://airtable.com/appOf1265eY1pCkWZ/shrHPswve578b87Y7\"><strong>here</strong></a><strong> that speaks directly to this position.<br></strong><br>\n</div><div>\n<strong>There are no right answers or cookie-cutter expectations. A cover letter is not required, but those that clearly demonstrate how Nathan James would be a great fit for you and how you would be a great fit for us, will be given full attention and are highly appreciated. <br></strong><br>\n</div><div>\n<strong>You’ll hear from us about advancement to a short introduction call and then on to a work sample, where you’ll get a chance to see the types of challenges you would be solving in this role. <br></strong><br>\n</div><div>\n<strong>We appreciate your consideration in having Nathan James be part of your career.<br></strong><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/nathan-james-director-of-digital-merchandising\">https://weworkremotely.com/remote-jobs/nathan-james-director-of-digital-merchandising</a></p>\n", "Publication Date": "Tue, 12 Dec 2023 14:26:16 +0000", "Link": "https://weworkremotely.com/remote-jobs/nathan-james-director-of-digital-merchandising", "Expiry Date": "Thu, 11 Jan 2024 14:26:16 +0000"}, {"Region": "Anywhere in the World", "Title": "Native Camp: Online English Teacher", "Category": "All Other Remote", "Type": "Contract", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0077/5564/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Japan\n    <br /><strong>URL:</strong> <a href=\"https://nativecamp.net/tutors/\">https://nativecamp.net/tutors/</a>\n</p>\n\n<div><strong>About us: </strong></div><div><br></div><div>Native Camp is Japan’s No.1 Online English Service counting the highest number of both teachers and students who are learning the English language through our platform. Since 2017, we have started hiring teachers from all around the world, and we have created an environment that makes it easy for them to work and earn while having full flexibility.</div><div><br></div><div>We are continuously expanding, introducing new features and teaching materials, and as a result of these efforts, more than 1.3 million members are using our service. Lessons are provided via a unique language platform developed by our company. We have simplified our application process and made it as quick as possible, so joining our team of teachers has never been easier. Join us today to experience the benefits that we provide.</div><div><br></div><div><strong>ONLINE ENGLISH TEACHER</strong></div><div><em>(Home-Based job position)</em></div><div><br></div><div><strong>What we offer:</strong></div><div><br></div><div>・Complete flexibility (24/7)</div><div>・100% remote</div><div>・Easy-to-follow teaching materials provided</div><div>・No minimum hours per week required</div><div>・Frequent incentives offered</div><div>・No CV or experience required</div><div>・Online support available</div><div> </div><div><strong>Requirements:</strong></div><div><br></div><div>・English Proficiency</div><div>・Laptop or PC with a webcam</div><div>・Headset with a microphone</div><div>・Stable Internet connection and speed</div><div>・Quiet environment and plain background</div><div> </div><div><strong>Application Process:</strong></div><div><br></div><div>・Apply through our website</div><div>・Do the English Proficiency Test</div><div>・Do the System Check and the Demo Lesson</div><div>・Complete your profile</div><div>・Start Teaching</div><div><br></div><div>The whole application process is done online, via desktop. Just follow step by step and the system will guide you through it.</div><div><br></div><div>If you have any questions please contact us via our website (Contact Us page).</div><div>\n<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/native-camp-online-english-teacher-18\">https://weworkremotely.com/remote-jobs/native-camp-online-english-teacher-18</a></p>\n", "Publication Date": "Fri, 08 Dec 2023 08:12:24 +0000", "Link": "https://weworkremotely.com/remote-jobs/native-camp-online-english-teacher-18", "Expiry Date": "Sun, 07 Jan 2024 08:12:24 +0000"}, {"Region": "Anywhere in the World", "Title": "GoTu (formerly TempMee): QA Engineer", "Category": "All Other Remote", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7483/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Miami, FL, United States\n    <br /><strong>URL:</strong> <a href=\"https://tempmee.com\">https://tempmee.com</a>\n</p>\n\n<div>Venture-backed Miami based tech startup seeking an experienced <strong>Remote QA Engineer. </strong>GoTu, formerly known as TempMee, is a deep work platform that connects licensed dental professionals with dental offices in need of temporary &amp; full time help through an on-demand web and mobile platform (think Uber for staffing).</div><div><br></div><div><strong>Responsibilities include:</strong></div><ul>\n<li>Actively cooperate with your Scrum team consisting of Fullstack/Backend Engineers, QA, Product Designer and a Product Manager (sometimes Android/iOS Engineers) in the US</li>\n<li>Be responsible for verifying the compliance of developed software against the defined acceptance criteria while maintaining a high quality bar for our products</li>\n<li>Conduct release regression testing and ensure test cases are kept up to date when requirements change</li>\n<li>Contribute to developing new solutions while sharing your opinion and ideas during Scrum Events, Tech meetings, or simply in Slack channels</li>\n<li>Use the following tech stack: JIRA, Bitbucket, Postman, Proxyman, MySQL, Cypress</li>\n</ul><div><strong>Key Competencies:</strong></div><ul>\n<li>2+ years of relevant experience as a QA Engineer</li>\n<li>Know how to plan, design and execute tests for different test levels (UI, API).</li>\n<li>Have experience collaborating with offshore teams</li>\n<li>Know Headless Browser (API) testing</li>\n<li>Understand agile principles and methodologies</li>\n<li>Familiar with mobile app testing</li>\n<li>Familiar with Xcode and Android Studio</li>\n<li>Have experience in web app test automation (Cypress)</li>\n<li>Have a basic understanding of HTTP infrastructure and SQL</li>\n<li>Know Atlassian Tools (Jira, Github, Confluence)</li>\n<li>Self-starter, have strong troubleshooting skills and the desire to seek the root cause of issues</li>\n<li>Comfortable with giving and receiving feedback, in the interest of mentorship and self-improvement, demonstrating excellent communication and cross-functional collaboration</li>\n<li>You excel at approving and delivering customer-ready products</li>\n<li>Enjoying continuous learning and getting new skills in order to be better at testing</li>\n<li>Fluent in English, both written and verbal</li>\n</ul><div><br></div><div><strong>Additional considerations:</strong></div><ul>\n<li>Working understanding of the Staffing / Recruiting, PE and/or VC landscape</li>\n<li>Bias for action, ability to prioritize competing objectives, attention to detail and unparalleled critical thinking and organizational skills</li>\n<li>Relentless commitment to advocating for diversity, equity, and inclusion and a sincere commitment to our mission</li>\n<li>High growth startup experience a plus</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/gotu-formerly-tempmee-qa-engineer\">https://weworkremotely.com/remote-jobs/gotu-formerly-tempmee-qa-engineer</a></p>\n", "Publication Date": "Mon, 04 Dec 2023 22:00:33 +0000", "Link": "https://weworkremotely.com/remote-jobs/gotu-formerly-tempmee-qa-engineer", "Expiry Date": "Wed, 03 Jan 2024 22:00:33 +0000"}, {"Region": "Anywhere in the World", "Title": "BBE Marketing Inc: Contact Researcher", "Category": "All Other Remote", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0064/7908/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Dallas, Texas\n    <br /><strong>URL:</strong> <a href=\"http://bbemarketing.com/\">http://bbemarketing.com/</a>\n</p>\n\n<div>BBE Marketing is seeking a contact researcher to help us in building our databases, data architecture, and pipelines that power our business. In this role, you will be collaborating with other research engineers to research data, and verify data in our database. In order to be considered for this role, you will need to take the attention to detail test that is sent to you upon applying.<br><br>\n</div><div>\n<strong><br>You will:<br></strong><br>\n</div><ul>\n<li>Research contact information utilizing different tools</li>\n<li>Create and manage guides for different tasks</li>\n<li>Create and optimize processes for different tasks</li>\n<li>Verify and perform quality control on the data in our database</li>\n<li>Collaborate with other team members in meeting goals</li>\n</ul><div>\n<strong><br>You will love this role if:<br></strong><br>\n</div><ul>\n<li>You are competitive</li>\n<li>You have excellent time management skills</li>\n<li>You have a very strong attention to detail</li>\n<li>You have solid organizational skills</li>\n<li>You have strong Communication skills</li>\n<li>You have strong writing abilities</li>\n<li>You have the ability to work effectively within a team.</li>\n<li>You have a strong work ethic</li>\n<li>You take initiative</li>\n<li>You give honest feedback and also take honest feedback</li>\n<li>You take ownership, and come up with ideas to improve our company</li>\n<li>You are thoughtful and clear in your writing.</li>\n<li>You have strong problem solving skills and critical thinking abilities.</li>\n</ul><div>\n<strong><br>About us:<br></strong><br>\n</div><div>\n<br>BBE Marketing provides products and services to help businesses connect with celebrities and influencers. We are a small, fast growing company who is passionate about our mission.<br><br>\n</div><div>\n<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/bbe-marketing-inc-contact-researcher-13\">https://weworkremotely.com/remote-jobs/bbe-marketing-inc-contact-researcher-13</a></p>\n", "Publication Date": "Mon, 04 Dec 2023 14:54:07 +0000", "Link": "https://weworkremotely.com/remote-jobs/bbe-marketing-inc-contact-researcher-13", "Expiry Date": "Wed, 03 Jan 2024 14:54:07 +0000"}, {"Region": "Anywhere in the World", "Title": "IPinfo – IP Data Provider: Contracts Manager - (SaaS/DaaS)", "Category": "All Other Remote", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7465/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Seattle, WA, USA\n    <br /><strong>URL:</strong> <a href=\"https://ipinfo.io\">https://ipinfo.io</a>\n</p>\n\n<div>IPinfo is a fast-growing “data as a service” provider delivering proprietary data products to thousands of developers and global businesses. Our data is used to enrich applications and services with accurate IP data that can de-anonymize web traffic, personalize experiences, and help manage security risks. We’re at an exciting stage of growth and are hiring a talented and experienced<strong> Contracts Manager</strong> to own all contractual aspects of our data products and services supporting our global commercial operations.  </div><div><br></div><div>Reporting to the COO, you will be a crucial member of our Commercial Team, overseeing the commercial contracting process and collaborating with Sales and Leadership Teams to improve processes and enhance contracting efficiency. This position involves direct negotiations, precise drafting, and the finalization of various agreements. Your primary focus will be ensuring seamless alignment of global commercial activities with corporate protocols and guidelines, making this a central role in our commercial operations.</div><div><br></div><div><strong>Key Responsibilities:</strong></div><ul>\n<li>Lead negotiations and oversee the creation of various agreements, including License Agreements, Data Protection Agreements, OEM, Subscription Agreements, Order Schedules, NDAs, and Reseller Agreements with customers and partners.</li>\n<li>Ensure compliance with corporate processes, guidelines, and policies in all contractual terms and provisions.</li>\n<li>Collaborate with cross-functional teams (Sales, Customer Support, Data, Operations, etc.) to safeguard the company’s legal and financial positions in agreements.</li>\n<li>Identify and execute commercial process improvements, manage negotiation documents and templates, and maintain decision histories based on commercial relationships with customers and partners.</li>\n<li>Possess familiarity with data privacy laws, enterprise sales, procurement processes, and deal cycles.</li>\n<li>Update our Commercial Leadership Team on status and progress regularly.</li>\n<li>Work in tandem with our Sales Team by responding promptly to internal and external queries and managing time-sensitive issues amidst multiple priorities.</li>\n<li>Offer support to colleagues, customers, and partners regarding the contracting process and general commercial inquiries.</li>\n<li>Maintain accurate filing, completion, and status reporting of agreements within approved company systems</li>\n<li>Escalate significant legal or financial risks to the appropriate colleague while ensuring contracting compliance and prioritization.</li>\n</ul><div><strong>Skills and Experience</strong></div><ul>\n<li>6-10 years of B2B SaaS/DaaS direct technology contracting experience, particularly working within partnership ecosystems and enterprise organizations. </li>\n<li>Strong attention to detail and exceptional verbal and written communication skills.</li>\n<li>Proven ability to negotiate and draft complex product and service agreements within the B2B SaaS/DaaS realm, incorporating methodology and best practices.</li>\n<li>Demonstrated ability to collaborate with peers in sales, data, and engineering.</li>\n<li>Strong conflict resolution skills and adeptness in problem-solving independently.</li>\n<li>Ability to navigate through ambiguous and complex work environments while maintaining professionalism and responsiveness.</li>\n<li>Commitment to continuous learning and improvement - curious, flexible, believing it can be done better.</li>\n<li>Proficiency in Microsoft Excel, Word, and Salesforce, with prior customer-facing experience. </li>\n</ul><div><strong>What we offer: </strong></div><ul>\n<li>Opportunity to make a measurable impact and operate with autonomy </li>\n<li>100% remote team and work environment</li>\n<li>Flexible working hours</li>\n<li>Competitive salary</li>\n<li>Flexible vacation policy</li>\n<li>Interesting and challenging work<br><br>\n</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/ipinfo-ip-data-provider-contracts-manager-saas-daas\">https://weworkremotely.com/remote-jobs/ipinfo-ip-data-provider-contracts-manager-saas-daas</a></p>\n", "Publication Date": "Sat, 02 Dec 2023 18:20:05 +0000", "Link": "https://weworkremotely.com/remote-jobs/ipinfo-ip-data-provider-contracts-manager-saas-daas", "Expiry Date": "Mon, 01 Jan 2024 18:20:05 +0000"}, {"Region": "Anywhere in the World", "Title": "AmpiFire: Writers Looking For A Steady Reliable Income", "Category": "All Other Remote", "Type": "Contract", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7439/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> London, UK\n    <br /><strong>URL:</strong> <a href=\"https://ampifire.com\">https://ampifire.com</a>\n</p>\n\n<div>\n<strong>You Only Need To Be Good At One Thing To Secure This Well-Paid, Flexible, And Stable Side Income Opportunity…<br></strong><br>\n</div><div>You need to be good at writing. But there are a lot of reasons for you to jump at this opportunity.<br><br>\n</div><div>Let me explain.<br><br>\n</div><div>We help small businesses compete with large corporations for exposure online. Normally the giants have a huge advantage, but we level the playing field.<br><br>\n</div><div>We do this by publishing content about our clients on some of the biggest sites online. <br><br>\n</div><div>We've been incredibly successful at this. More and more companies want to work with us so we need to publish more and more content.<br><br>\n</div><div>And that's why we need your help! You'll be writing our clients' company announcements and describing their products.<br><br>\n</div><div>But what's in it for you? Why would you want to write to us?<br><br>\n</div><div>\n<strong><br> <br></strong><br>\n</div><div>\n<strong><br>4 Main Reasons To Start Writing For Us<br></strong><br>\n</div><div>\n<strong><br>1. Awesome Side Income<br></strong><br>\n</div><div>I don't have to tell you that great side income opportunities don't come around that often. But this is one of them.<br><br>\n</div><div>Most of our writers earn between $800-$2000/month working part-time. Working at a moderate pace, that's over $18/h. And some of our writers are able to make as much as $30/h.<br><br>\n</div><div>\n<strong><br>2. Flexibility You've Been Looking For<br></strong><br>\n</div><div>We don't have any expectations for the amount of work you'll do. It's 100% up to you. This is perfect if you need extra income but you have other things going on besides this job.<br><br>\n</div><div>And you can do the job at any time that's convenient for you. Set your own hours and work at your own pace.<br><br>\n</div><div>\n<strong><br>3. Stability You Can Count On<br></strong><br>\n</div><div>One of the worst things about writing jobs is that you always have to hustle to get new clients. This won't be the case with us. There will always be more work available if you want it.<br><br>\n</div><div>Our writers love that. No wonder they stay with us for years.<br><br>\n</div><div>\n<strong><br>4. Get The Training You Need<br></strong><br>\n</div><div>We do expect your English to be bulletproof. And you'll need some writing chops to get this job. But outside of that, we'll provide all the training that you need.<br><br>\n</div><div>Not only will you earn an excellent income, but you'll also get marketable skills that you'll use throughout your life.<br><br>\n</div><div>\n<strong><br></strong><br>\n</div><div>\n<strong><br>Here's What We Expect From You<br></strong><br>\n</div><ul>\n<li>You are able to write in an easy-to-understand, smooth-flowing style.</li>\n<li>Your writing doesn't have spelling or grammatical errors.</li>\n<li>You always meet the deadlines you commit to.</li>\n<li>You are willing to work with editors and receive constructive feedback on your work, especially in the early stages.</li>\n<li>You are able to adjust your writing style between casual and formal.</li>\n<li>You are ready to be part of a welcoming, supportive team of fellow writers.</li>\n<li>Experience writing press releases or online content is helpful, but it’s not essential</li>\n</ul><div> <br><br>\n</div><div>\n<strong>How To Apply<br></strong><br>\n</div><div>Fill out the application form on this page.<br><br>\n</div><div> <br><br>\n</div><div>\n<strong>What to expect from the Hiring Process:<br></strong><br>\n</div><ul>\n<li>Round 1 - We review your application to see if you meet the initial requirements for this role.</li>\n<li>Round 2 - You will have to complete a quick Grammar check.</li>\n<li>Round 3 - You will have to write a Press Release sample based on one of two topics we listed. </li>\n<li>Round 4 - Our editorial team decides if your writing skills match the requirements for our type of clients.</li>\n</ul><div> <br><br>\n</div><div>\n<strong>IMPORTANT:<br></strong><br>\n</div><div>All further communication regarding the hiring process will be conducted exclusively via email.<br>To ensure that you don't miss any important updates, feedback, or instructions, we kindly request that you check your email regularly, including your spam or junk folders. Thank you for your attention to this matter. We appreciate your cooperation.<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/ampifire-writers-looking-for-a-steady-reliable-income-1\">https://weworkremotely.com/remote-jobs/ampifire-writers-looking-for-a-steady-reliable-income-1</a></p>\n", "Publication Date": "Thu, 30 Nov 2023 20:22:56 +0000", "Link": "https://weworkremotely.com/remote-jobs/ampifire-writers-looking-for-a-steady-reliable-income-1", "Expiry Date": "Sat, 30 Dec 2023 20:22:56 +0000"}, {"Region": "Anywhere in the World", "Title": "LeadSimple, Inc.: Senior Director of Engineering", "Category": "All Other Remote", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Washington State, U.S.A.\n    <br /><strong>URL:</strong> <a href=\"https://www.leadsimple.com/careers\">https://www.leadsimple.com/careers</a>\n</p>\n\n<div>The Senior Director of Engineering brings energy, oversight, alignment, talent and produces results with a championship engineering team committed to  “always be growing”. They will do this by demonstrating high levels of decisiveness, timely follow through, coaching mindset for both themselves and their team and maintaining a high level of technical skill of their own to move LeadSimple into new growth opportunities.  The main mission of the leader is to technically scale our products to achieve net new revenue.<br><br>\n</div><div>\n<strong><br>A day in the life of…<br></strong><br>\n</div><ul>\n<li>Collaborate with other department leaders </li>\n<li>Talent acquisition, retention and training</li>\n<li>Coaching, regular 1:1s</li>\n<li>Represent engineering with third parties</li>\n<li>Overseeing department budget</li>\n<li>Own key departmental metrics</li>\n<li>Enhance the performance of the engineering team</li>\n</ul><div>\n<strong><br>Expectations for your first 90 days:<br></strong><br>\n</div><ol><li>Stable, reliable and secure service for existing customers</li></ol><div>a. Resolve urgent bugs within 2 business days.<br><br>\n</div><div>b. Maintain stable or reduce bug backlogs across all squads.<br><br>\n</div><div>c. Follow a maintenance schedule into our roadmap.<br><br>\n</div><div>d. Follow and implement plans for incident response and escalation.<br><br>\n</div><ol><li>Fast pace of product improvements</li></ol><div>a. Velocity is measured and is increasing across all squads<br><br>\n</div><ol>\n<li>Recruits and develops mentors outstanding talent</li>\n<li>With collaboration from POPs, revise the engineering hiring process, challenges and interviews to ensure high-quality hires and an excellent candidate experience</li>\n<li>Identify gaps in the team and develop a training + hiring plan to address those gaps</li>\n<li>All team members are actively pursuing their career growth plans, paired with at least one mentor who meets with them regularly</li>\n<li>Establish an internal training program for engineers to educate each other</li>\n<li>Engineering team member satisfaction at 80%+</li>\n</ol><div>‍<br><br>\n</div><div>\n<strong><br>Perks:<br></strong><br>\n</div><ul>\n<li>Company Holidays</li>\n<li>Paid Time Off (in addition to the above)</li>\n<li>Monthly Healthcare Allowance</li>\n<li>Yearly Vacation Allowance</li>\n<li>Fun and outcome driven work environment with a smart, hard working team</li>\n<li>Location independence</li>\n<li>Mission driven company and values-based culture</li>\n<li>‍</li>\n</ul><div>🚀 Want to join a team of A players in an exciting, high-growth, entrepreneurial environment?<br><br>\n</div><div>‍<br><br>\n</div><div>We’re a small team solving big problems in the property management industry. Bootstrapped since 2013, we're passionate about helping small businesses simplify growth and streamline operations, providing the leading CRM in our space.<br><br>\n</div><div>‍<br><br>\n</div><div>\n<strong>The long version of our story:</strong> Back when web 2.0 was a thing (<em>get off my lawn!</em>) LeadSimple’s founders started a lead generation business connecting landlords with property management companies. Witnessing the challenges lead buyers had closing deals led into a natural segue to build out an industry-specific CRM which became the de-facto industry standard. Fast forward to 2020 when we released a process/workflow suite to move from the sales side of our clients business into the heart of day-to-day operations. The market was hungry and responded aggressively to the new direction, which led us to double down with growth and additional product expansion.<br><br>\n</div><div>\n<strong><br>Please only apply if you:<br></strong><br>\n</div><ul>\n<li>Past experience at a director level for 4+ years</li>\n<li>Product-minded, capable of giving input into product decisions</li>\n<li>(Ideally) Proven experience scaling up a software engineering team from 0 to 100+ members</li>\n<li>Embrace learning new technology </li>\n<li>Learn fast</li>\n<li>Communicate crisply</li>\n<li>Proactively seek solutions</li>\n<li>Own the outcome</li>\n<li>Embody emotional maturity</li>\n<li>Bring an optimistic “can do” attitude</li>\n<li>Supply your own internet and smartphone</li>\n<li>Have B2B SaaS experience</li>\n<li>Highly values team velocity and productivity</li>\n<li>Authentic connection</li>\n<li>Gets energy from leadership activities: meetings, conversations</li>\n<li>Pragmatic about process, able to scale it down to what makes sense for our context</li>\n<li>Excited about working within the constraints of a financially-conservative company</li>\n<li>Willing to engage in hard conversations</li>\n</ul><div>‍<br><br>\n</div><div>\n<strong><br>Who might be interested? Glad you asked…<br></strong><br>\n</div><ul>\n<li>VPs who are dissatisfied with their org and want a chance to build a new one they like better</li>\n<li>Technical co-founders who previously scaled up, held a VP or CTO job and exited. Now they’re looking for the next challenge.</li>\n<li>Ambitious directors who want a shot at becoming VP but have never been one before</li>\n<li>Engineering managers who want to be a director<br><br>\n</li>\n</ul><div>\n<strong><br>Our Interview Process<br></strong><br>\n</div><ul>\n<li>Fill out the application</li>\n<li>Introduction call with People Operations (15 minutes)</li>\n<li>Call with Recruiting Partner (60 minutes)</li>\n<li>Interview with VP of People Ops (90 minutes)</li>\n<li>Completion of Harrison Assessment &amp; Debrief Call with Executive Coach (90 minutes)</li>\n<li>Interview with COO (90 minutes)</li>\n<li>Interview with CEO (60 minutes)</li>\n<li>Leadership Team panel interview (up to 60 minutes)</li>\n<li>Offer call (15 minutes)</li>\n<li>Written offer</li>\n<li>Start date commences a 90 day onboarding period</li>\n</ul><div>‍<br><br>\n</div><h1>SO…<strong>Are You All In?</strong>\n</h1><div>Not everyone can hang. It take a special person - <br><br>\n</div><div>Someone who’s all IN. We are building a “rocket ship” at LeadSimple,<br><br>\n</div><div>And we need All Stars to help us accomplish our mission.<br><br>\n</div><div>LeadSimple, our team members are connected and driven leaders,<br><br>\n</div><div>Who take personal responsibility for what they create.<br><br>\n</div><div>We hit deadlines, we’re obsessed with both the customer and <br><br>\n</div><div>Team member experience. We own the outcome, <br><br>\n</div><div>We overcome obstacles and we find life lessons everywhere. <br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/leadsimple-inc-senior-director-of-engineering\">https://weworkremotely.com/remote-jobs/leadsimple-inc-senior-director-of-engineering</a></p>\n", "Publication Date": "Wed, 29 Nov 2023 13:21:56 +0000", "Link": "https://weworkremotely.com/remote-jobs/leadsimple-inc-senior-director-of-engineering", "Expiry Date": "Fri, 29 Dec 2023 13:21:56 +0000"}, {"Region": "Anywhere in the World", "Title": "Course Concierge: – Wanted: Norwegian-speaking Executive Assistant for three overloaded international entrepreneurs", "Category": "All Other Remote", "Type": "Contract", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7332/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Los Angeles\n    <br /><strong>URL:</strong> <a href=\"https://courseconcierge.com\">https://courseconcierge.com</a>\n</p>\n\n<div>NOTE:  We've initiated a trial with a candidate for this role, but still encourage applications from those who feel like they would be a great fit.<br><br>Hi there,</div><div><br></div><div>My name’s Edward. I’m looking for someone who can be something of a ‘bionic’ assistant – able to deal both with requests from very high-ranking people, and who is able to manage fine-tune details of a travel itinerary. (Think: a real life Pepper Potts.)</div><div><br></div><div>Someone who is committed to the art of assisting, and who aspires to growth in the direction of evermore responsibility in the role of an executive assistant.</div><div><br></div><div>If you’re:</div><div>- At a crossroads in your life, wondering what to do next;</div><div>- Feeling like you have a lot to give, but aren’t presently sure how to harness it; </div><div>- Excited at the prospect of joining a thriving team;</div><div>- Seeking an opportunity to prove yourself;</div><div><br></div><div>…This could be a dream opportunity for you.</div><div><br></div><div>We want someone who would relish helping ambitious and fast-moving entrepreneurs organise their lives; stay on track; and be a crucial ballast in helping achieve what we’re going on to do.</div><div><br></div><div>My co-founder Till and I co-founded a company called Course Concierge in 2017.  It was an online course publishing house for <em>New York Times</em> best-selling authors, TED speakers, and those with something to say. You can see more about the company here: <a href=\"http://courseconcierge.com\">http://courseconcierge.com</a> </div><div><br></div><div>We’re starting a new venture with one of our clients, who is a prominent Norwegian personality. We’re going places, and you will be working with the three of us co-founders.</div><div><br></div><div>I’m based in London. Till is based in Los Angeles. Our third partner is based in Norway (though frequently travelling). Requirement: our ideal candidate, thus, has perfect written and spoken English and Norwegian.</div><div><br></div><div>A passage that inspires us, in how we like to run companies – from Marc Andreessen (of a16z):</div><div><br></div><div><em>‘We had decided one of the values of the firm is respect for the people we work with. And part of that respect is, we don’t drop balls. We respond quickly and we get back to people in a specific period of time. We use the old J.P. Morgan saying of “first class business in a first class way”.  If you contact us, you’re going to get a response. If we commit to doing something, we’re going to do that thing.’</em></div><div><br></div><div>In helping us at all times adhere to this, your duties will include:</div><div><br></div><div>- Itinerary planning for productions. This includes both travel management, and booking locations to shoot, getting permits (for filming), managing licensing requests and the like. The last trip I took to the US, I changed my itinerary five times mid-trip. This is typical. We need someone okay with this – and who can still help ensure things run to schedule.</div><div><br></div><div>- Management of personal inboxes – screening and responding to emails. Dealing with sponsor requests; being able to decline opportunities in a polite and professional (though occasionally <em>firm</em>) way. Supreme attention to detail and writing etiquette in this. (Some of this being in Norwegian.) We want someone who, even in their own private WhatsApp messages, upholds a near-flawless level of grammar.</div><div><br></div><div>- Occasional gift buying for team members and important people in our lives. And management of personal things for us: medical appointments, and helping plan fun weekend activities.</div><div><br></div><div>- Once having proved yourself, the potential to mastermind and project-manage entire team/company/partner retreats. (Our last was a three-day ski/snowboard holiday in Saint-Gervais, Mont-Blanc.)</div><div><br></div><div>We want someone who is relentlessly resourceful in overcoming obstacles. When everyone is telling you ‘No, this can’t be done’ , you – through a mix of creative thinking, perseverance, and charm – find a way to make it happen. Initiative, and you don’t give up.</div><div><br></div><div>*</div><div>The position will start at 25 hours per week, and pay will be set at a competitive rate. Inside six–12 months, the role will likely be nearer full-time.</div><div><br></div><div>This position is entirely remote. You can work your own hours. (This is not a conventional 9–5.) Though we tend to think, for time zones, the ideal candidate will live in Europe.</div><div><br></div><div>To apply, please write to <a href=\"mailto:execad@courseconcierge.com\">execad@courseconcierge.com</a> with a short cover letter noting why you think you would be a good fit. Please do not send a CV. (We don’t care where anyone went to university – or even that you went at all.) But please <em>do</em> include a single attachment of one travel itinerary you have put together for something. This can be anything at all (personal or professional). We just want a clear example in presentation of how you’ve organised some kind of trip.</div><div><br></div><div>We won’t be able to get back to everyone, but for those who stand out, we will be in touch within two weeks to discuss next steps. There’s no application deadline, but those who apply sooner are at an advantage. </div><div><br></div><div>We will pick two candidates from interviews to begin a paid trial to assess on-the-job performance. One person will then be chosen for the ongoing role.</div><div><br></div><div>The successful candidate will become an integral part of the company. Like any assistant position, they’ll be in a role of deep insight and intimacy, and it’s one we’ll be selecting for carefully.</div><div><br></div><div>Thank you for considering the position. If you’re feeling on the fence about applying: please do. <br><br>Best of luck, and we look forward to hearing from you,</div><div><br></div><div>Edward</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/course-concierge-wanted-norwegian-speaking-executive-assistant-for-three-overloaded-international-entrepreneurs\">https://weworkremotely.com/remote-jobs/course-concierge-wanted-norwegian-speaking-executive-assistant-for-three-overloaded-international-entrepreneurs</a></p>\n", "Publication Date": "Wed, 22 Nov 2023 17:10:08 +0000", "Link": "https://weworkremotely.com/remote-jobs/course-concierge-wanted-norwegian-speaking-executive-assistant-for-three-overloaded-international-entrepreneurs", "Expiry Date": "Fri, 22 Dec 2023 17:10:08 +0000"}, {"Region": "Anywhere in the World", "Title": "The Internet Community Company: UX/UI Designer", "Category": "All Other Remote", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7292/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Estonia\n    <br /><strong>URL:</strong> <a href=\"https://internetcommunity.co\">https://internetcommunity.co</a>\n</p>\n\n<h1>About the Company:</h1><div>The Internet Community Company is at the forefront of building healthier less addictive user experiences. Our current products, Outposts and 9am.today, are reshaping how users interact with personalized digital content. Outposts delivers personalized web3 digests, leveraging wallet activities to curate communities and updates. 9am.today, our web2 saas product, employs similar technology to provide non-crypto specific, tailored daily digests from a variety of social and news sources - designed as a healthy morning ritual.</div><div>We currently have pre-seed funding with runway to continue at current rate for over a year.</div><div><br></div><div><a href=\"https://outposts.io\">https://outposts.io</a></div><div>\n<a href=\"https://9am.today\">https://9am.today</a> </div><h1>Role Overview:</h1><div>We are seeking a talented and motivated UI Designer to join our dynamic team. This role is ideal for someone who is junior to mid-level in their career and has a strong foundation in SaaS design. While crypto experience is advantageous, our primary focus is on finding someone skilled in creating individual UI elements and contributing to the overall user experience of our products. </div><h1>Key Responsibilities:</h1><div>Design and develop UI components for our products, Outposts and 9am.today, using Figma.</div><div>Collaborate with our senior designer to align UI elements with our creative branding and user experience strategies.</div><div>Translate requirements into style guides, design systems, design patterns, and attractive user interfaces.</div><div>Work closely with the development team to ensure accurate implementation of designs.</div><div>Contribute to user experience design with a focus on maximizing usability and enhancing customer satisfaction.</div><div>Stay up-to-date with the latest design trends, techniques, and technologies.</div><div><br></div><h1>Qualifications:</h1><div>Proven experience as a UI Designer or similar role, with a portfolio demonstrating your design skills.</div><div>Strong proficiency in Figma and other design tools.</div><div>Knowledge of SaaS product design and an understanding of web3 and crypto platforms is a plus.</div><div>Excellent visual design skills with sensitivity to user-system interaction.</div><div>Ability to solve problems creatively and effectively.</div><div>Excellent communication skills and ability to work in a team environment.</div><div><br></div><h1>Benefits:</h1><div>We offer unlimited paid time off and encourage a healthy work-life balance</div><h1>Compensation:</h1><div>$2500 USD a month (fulltime)</div><div>Paid via bank transfer or crypto (stablecoin)</div><div><br></div><div>Stock options as one of the first hires in our &lt;10 person startup</div><h1>How to Apply:</h1><div>Please submit your resume, portfolio, and a brief cover letter explaining why you are a good fit for this role to hiring@internetcommunity.co</div><div>\n<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/the-internet-community-company-ux-ui-designer\">https://weworkremotely.com/remote-jobs/the-internet-community-company-ux-ui-designer</a></p>\n", "Publication Date": "Mon, 20 Nov 2023 14:28:49 +0000", "Link": "https://weworkremotely.com/remote-jobs/the-internet-community-company-ux-ui-designer", "Expiry Date": "Wed, 20 Dec 2023 14:28:49 +0000"}, {"Region": "Anywhere in the World", "Title": "Legalcom Group: Data Privacy Experts to Write and Simplify Legalese (CIPP/E, CIPM)", "Category": "All Other Remote", "Type": "Contract", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> US/EU\n    <br /><strong>URL:</strong> <a href=\"https://legalcom.group\">https://legalcom.group</a>\n</p>\n\n<div>We’re looking for reliable, talented data privacy experts with CIPP/E and/or CIPM certifications (or related privacy certifications) who love writing about data privacy.<br><br>You’ll be writing about everything related to data privacy for professionals, small businesses and enterprises.<br><br>\n</div><h1>About The Work</h1><div>We understand the value of quality content. We’re not looking for plain text articles, but well-researched articles to educate our readers: articles with images, illustrations or diagrams, links, quotes from research papers, expert’s quotes etc.<br><br>Our articles are often 1000+ words, generally around 2,000 words. Some articles are beyond 10,000 words.<br><br>We’re not looking to game search engines, but rather educate our customers about data privacy compliance, requirements and latest news. We aim to be a teacher to our customers.<br><br>We are looking for data privacy experts available for a minimum of one day/week. We have as much work as you can handle. We don’t micromanage.<br><br>We are very clear on what we want for every article. We provide topics with a proposed structure including due dates and the minimum required length. We welcome your ideas and suggestions for topics. There is sometimes communication back and forth during the revision session. But for the most part: you write the article, turn it in, we review and ask for edits if necessary and then publish it.<br><br>Freelancers get paid every other week, in US dollars by PayPal / bank transfer.<br><br>Depending on where we’ll publish your work, and for as much as we can, we’ll show your bio byline to give you author credits.<br><br>\n</div><h1>Job Requirements</h1><ul>\n<li>Native English speaker with strong writing skills. We can make an exception on this if you have English Proficiency qualification.</li>\n<li>Exceptional online research skills</li>\n<li>Well-organized and reliable</li>\n<li>CIPP/E and/or CIPM certification or related data privacy certifications</li>\n<li>Some degree of technical proficiency (using Google Docs, taking screenshots)</li>\n</ul><div>\n<br>It’s a major plus if you have any of the following:</div><ul><li>Legal degree or paralegal experience</li></ul><div><br></div><h1>How Do We Work?</h1><div>We work remotely. We don’t need to sync time zones.<br><br>We work over Google Docs and email.<br><br>\n</div><h1>How To Apply?</h1><div>Send an email to office@legalcom.group with:</div><ul>\n<li>A 4-5 sentence introduction explaining why you think you would be a good fit</li>\n<li>3 URLs showcasing your work related to internet laws or technology</li>\n<li>Your freelance writing rates (per word, please)</li>\n</ul><div>\n<strong>Important! </strong>Please format your subject line as follows: “Your Name | Data Privacy Expert | WeWorkRemotely” (example: John Doe | Data Privacy Expert | WeWorkRemotely). <br><br><strong>The subject line format is important, otherwise our editor won’t get your email.</strong><br><br>We look forward to hearing from you!<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/legalcom-group-data-privacy-experts-to-write-and-simplify-legalese-cipp-e-cipm\">https://weworkremotely.com/remote-jobs/legalcom-group-data-privacy-experts-to-write-and-simplify-legalese-cipp-e-cipm</a></p>\n", "Publication Date": "Thu, 16 Nov 2023 18:59:06 +0000", "Link": "https://weworkremotely.com/remote-jobs/legalcom-group-data-privacy-experts-to-write-and-simplify-legalese-cipp-e-cipm", "Expiry Date": "Sat, 16 Dec 2023 18:59:06 +0000"}, {"Region": "Anywhere in the World", "Title": "Legalcom Group: Freelance Writer to Simplify Legalese", "Category": "All Other Remote", "Type": "Contract", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0066/7613/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> US/EU\n    <br /><strong>URL:</strong> <a href=\"https://legalcom.group\">https://legalcom.group</a>\n</p>\n\n<div>We’re looking for reliable, talented freelance writers who love writing about a wide range of topics, including legal topics.<br><br>Most of our work is on legal topics. All topics related to legal are entry-level and not at an academic level.<br><br>You’ll be writing about everything from why a certain legal contract is required for a business to writing a checklist article of best tools to use for an e-commerce store to increase sales. <br><br>\n</div><h1><strong>About The Work</strong></h1><div>We understand the value of quality content. We’re not looking for plain text articles, but well-researched articles to educate our customers: articles with images, links, quotes from research papers, expert’s quotes etc.<br><br>Our articles are often 1000+ words, generally around 2,000 words. Some articles are beyond 10,000 words.<br><br>We’re not looking to game search engines, but rather educate our customers about the legal contracts they’re searching for. We aim to be a teacher to our customers.<br><br>We are looking for writers available for a minimum of one day/week. We have as much work as you can handle. We don’t micromanage.<br><br>We are very clear on what we want for every article. We provide topics with a proposed structure including due dates and the minimum required length. There is sometimes communication back and forth during the revision session. But for the most part: you write the article, turn it in, we review and ask for edits if necessary and then publish it.<br><br>Writers get paid every other week, in US dollars by PayPal or bank transfer.<br><br>Depending on where we’ll publish your work, and for as much as we can, we’ll show your bio byline to give you author credits.</div><h1>Job Requirements</h1><ul>\n<li>Native English speaker with strong writing skills. We can make an exception on this if you have English Proficiency qualification.</li>\n<li>Exceptional online research skills</li>\n<li>Well-organized and reliable</li>\n<li>Some degree of technical proficiency (Google Docs, taking screenshots)</li>\n</ul><div>\n<br>It’s a major plus if you have any of the following:</div><ul><li>Legal degree or paralegal experience </li></ul><div><br></div><h1>How Do We Work?</h1><div>We work remotely. We don’t need to sync time zones.<br><br>We work over Google Docs and email.<br><br>\n</div><h1>How To Apply?</h1><div>Please send an email to office@legalcom.group with:</div><ul>\n<li>A 4-5 sentence introduction explaining why you think you would be a good fit</li>\n<li>3 URLs showcasing your work related to internet laws or technology</li>\n<li>Your freelance writing rates (per word, please!)</li>\n</ul><div>\n<br><strong>Important! </strong>Please format your subject line as follows: Your Name | Freelance Writer | WeWorkRemotely (example: John Doe | Freelance Writer | WeWorkRemotely). <br><br><strong>The subject line format is important, otherwise our editor won’t get your email.<br><br></strong>We look forward to hearing from you!</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/legalcom-group-freelance-writer-to-simplify-legalese-3\">https://weworkremotely.com/remote-jobs/legalcom-group-freelance-writer-to-simplify-legalese-3</a></p>\n", "Publication Date": "Wed, 15 Nov 2023 19:04:59 +0000", "Link": "https://weworkremotely.com/remote-jobs/legalcom-group-freelance-writer-to-simplify-legalese-3", "Expiry Date": "Fri, 15 Dec 2023 19:04:59 +0000"}, {"Region": "Anywhere in the World", "Title": "Contra: Freelance Framer Website Refinement and Animation support", "Category": "All Other Remote", "Type": "Contract", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> San Francisco, CA\n    <br /><strong>URL:</strong> <a href=\"http://bit.ly/3kLhMdk\">http://bit.ly/3kLhMdk</a>\n</p>\n\n<div>\n<br>I need help wrapping up a personal portfolio I've been working on for a while. The overall design is done, but I need help resolving some issues and refining some animations.<br><br>\n</div><ol>\n<li>The mobile does not work at all. I've tried a few things to get it to work and even rebuilt the project card to see if that was the issue, and it still has the same issue, so it is something else in the design or a bug with Framer. </li>\n<li> Scroll animations are not great, and I would like to see if they can be refined to have a more a dynamic look. in both the scroll and how things animate in frame</li>\n<li>The project cards— i want to update the functionality so it clicks through on all the cards and not just the titles. </li>\n<li>Some of the pages need some cleanup in how things are working. Mostly stuff is visible on the scroll that should be hidden. </li>\n</ol><div>\n<br>5. Nav needs some love— just the animation on it is off and I would like to see it cleaned up. <br><br>Please only contact me with your portfolio through Contra </div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/contra-freelance-framer-website-refinement-and-animation-support\">https://weworkremotely.com/remote-jobs/contra-freelance-framer-website-refinement-and-animation-support</a></p>\n", "Publication Date": "Mon, 13 Nov 2023 17:11:44 +0000", "Link": "https://weworkremotely.com/remote-jobs/contra-freelance-framer-website-refinement-and-animation-support", "Expiry Date": "Wed, 13 Dec 2023 17:11:44 +0000"}, {"Region": "Anywhere in the World", "Title": "Tactiq: Senior QA Automation Engineer", "Category": "All Other Remote", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Richmond, VA \n    <br /><strong>URL:</strong> <a href=\"https://www.tactiqtech.com/\">https://www.tactiqtech.com/</a>\n</p>\n\n<div><strong>Senior QA Automation Engineer</strong></div><div><br></div><div><strong>Join us!</strong></div><div>Join <strong>Tactiq</strong>, we're the growing eLogistics leader keeping food on local shelves across the US. Our team is building SaaS solutions to everyday out-of-stock and invoicing problems faced by America's largest retailers. Our developers deliver native mobile apps and web applications backed by cloud agnostic APIs that enable you to buy the food you love from over 30,000 of the stores you trust.</div><div><br></div><div>\n<strong>Time zones:</strong>  </div><div>We are recruiting only within UTC  to UTC-7 because we value close collaboration and working sane hours!</div><div><br></div><div><strong>Position:</strong></div><div>The Senior QA Engineer will principally lead automation framework development, coding of backend and frontend tests, and automation of test execution for a product team.</div><div><br></div><div>A key responsibility is consulting to the team on test case specification, test creation, writing of test instructions, and the performance of testing by all team members as part of the Definition of Done. They will monitor that test cases are performed as expected by software engineers and product owners and triage any gap in test performance as a blocking impediment. The Senior QA Engineer has final go/no-go on releases. Their responsibilities, secondarily, include manual testing prior to the completion of automation, primarily when the development time frame becomes tight.<br><br><strong>Email your resume to:<br></strong>RecruitingQA@tactiqtech.com</div><div><br></div><div><strong>Responsibilities:</strong></div><ul>\n<li>Own the test automation and lead test coding</li>\n<li>Help develop QA thresholds, timelines, and priorities</li>\n<li>Mentor a developers on test creation </li>\n<li>Collaborate with frontend, QA, DevOps, mobile, product teams and a scrum master to get to market rapidly and with quality!</li>\n<li>You will be involved in the early stages of the projects and will participate in the definition of the test platform and the automated test cases for the next generation of products.</li>\n<li>Ensure that all functional and non-functional requirements are covered by creating and defining test plans in the enterprise tool.</li>\n<li>Add test automation into our CI/CD pipeline to ensure automated testing at every stage.</li>\n<li>Identify, report and track software defects using bug tracking tools and work with the developers to resolve the fix issues.</li>\n</ul><div><br></div><div><strong>Qualifications:</strong></div><ul>\n<li>Strong Python and/or Typescript skills</li>\n<li>Experience with Linux, APIs, test frameworks, and AWS-centric development.</li>\n<li>Excellent communication skills and a head for problem solving</li>\n<li>Degree in Computer Science is preferred, but we are open-minded</li>\n</ul><div><br></div><div>All qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. EOE</div><div>\n<br><br>\n</div><div>Email your resume to: <strong><em>RecruitingQA@tactiqtech.com</em></strong>\n</div><div>\n<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/tactiq-senior-qa-automation-engineer\">https://weworkremotely.com/remote-jobs/tactiq-senior-qa-automation-engineer</a></p>\n", "Publication Date": "Wed, 01 Nov 2023 23:54:14 +0000", "Link": "https://weworkremotely.com/remote-jobs/tactiq-senior-qa-automation-engineer", "Expiry Date": "Sun, 31 Dec 2023 23:54:14 +0000"}, {"Region": "Anywhere in the World", "Title": "XM: iOS Developer – Cyprus, Greece or Remote", "Category": "All Other Remote", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Cyprus, Greece or Remote\n    <br /><strong>URL:</strong> <a href=\"https://xm.com\">https://xm.com</a>\n</p>\n\n<div>\n<strong>The Role: <br></strong><br>\n</div><div>We are looking for an iOS Developer with a passion for pushing mobile technologies to the limits. If you're ready to join forces with our dynamic team to drive the growth and sustainability of a high-speed, multicultural environment within one of the premier Forex/CFD trading apps, we want to hear from you.<br><br>\n</div><div> </div><div><strong>The main responsibilities of the position include:</strong></div><div>·        Be part of the development of company's complex mobile application (challenging requirements such as security, live updates and complex business rules)</div><div>·        Emphasis on code quality delivery: unit and snapshot testing, UI testing</div><div>·        Follow continuous integration and Agile Methods; read and submit merge requests</div><div>·        Invest in multiple areas of the mobile development cycle: CI/CD, app health monitoring and alerting, data-driven analysis</div><div>·        Present ideas for system improvements and help to shape the future of our company</div><div>·        Continuously monitor and improve application, reliability and performance optimisation</div><div>·        Participate in design sprints when building new features or products</div><div> </div><div>\n<strong>Main requirements:<br></strong><br>\n</div><div>·        BSc/MSc in Computer Science, Engineering, or any other relevant degree</div><div>·        2+ years of experience on iOS development (Swift and the iOS SDK, Xcode, Apple Human Interface Guidelines)</div><div>·        Passion for mobile applications and a keen interest on personal development </div><div>·        Solid understanding of the full mobile development life cycle</div><div>·        Have successfully published at least one iOS application to App Store (portfolio of apps on App Store)  </div><div>·        A keen interest in benchmarking and optimisation</div><div>·        Showcase of open-source projects and technical blogs will be considered as a plus</div><div>·        Proactive, sharp, efficient and organised</div><div>·        Excellent team working skills</div><div> </div><div><br></div><div>\n<strong>Benefit from:<br></strong><br>\n</div><div>·        Attractive remuneration package</div><div>·        Food allowance </div><div>·        Intellectually stimulating work environment</div><div>·        Continuous personal development and international training opportunities</div><div><br></div><div>\n<br>Type of employment: Full time<br><br>\n</div><div>Location: Cyprus, Greece or Remote<br><br>\n</div><div> </div><div>Please visit this linkhttps://www.xm.com/careers to submit your online application for this position.<br><br>\n</div><div>\n<strong><br>All applications will be treated with strict confidentiality!<br></strong><br>\n</div><div> </div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/xm-ios-developer-cyprus-greece-or-remote-6\">https://weworkremotely.com/remote-jobs/xm-ios-developer-cyprus-greece-or-remote-6</a></p>\n", "Publication Date": "Wed, 01 Nov 2023 14:22:49 +0000", "Link": "https://weworkremotely.com/remote-jobs/xm-ios-developer-cyprus-greece-or-remote-6", "Expiry Date": "Sun, 31 Dec 2023 14:22:49 +0000"}, {"Region": "Anywhere in the World", "Title": "Fortune Writers Inc: Content Writer", "Category": "All Other Remote", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0124/8440/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> San Francisco, CA\n    <br /><strong>URL:</strong> <a href=\"https://fortunewriters.com\">https://fortunewriters.com</a>\n</p>\n\n<div><strong>About the Role:</strong></div><div><br></div><div>Fortune Writers Inc. is looking to hire a remote Content Writer with knowledge and competency in a wide breadth of topics and niches. You will be at the forefront of our storytelling and branding initiatives. The ideal candidate will work cohesively with our dynamic team to craft, refine, and elevate our content output. We’re seeking a writer who is not just skilled with words, but also possesses a strategic mindset, ensuring that all content aligns with both our clients' and our internal objectives.</div><div><br></div><div><strong>Key Responsibilities:</strong></div><div><br></div><div>1. <em>Content Development:</em>\n</div><div>- Craft and edit compelling, clear, and effective written content across various platforms.</div><div>- Produce content that aligns with client objectives, brand guidelines, and voice.</div><div>\n<br>2. <em>Strategy and Planning:</em>\n</div><div>- Contribute to content strategy development and planning sessions.</div><div>- Ensure content is SEO-optimized and adheres to the latest market trends.</div><div>\n<br>3. <em>Collaboration:</em>\n</div><div>- Work closely with design, marketing, and project management teams to ensure content cohesiveness and project timeliness.</div><div>\n<br>4. <em>Quality Assurance:</em>\n</div><div>- Conduct thorough research and fact-checking to uphold accuracy and reliability in all content.</div><div>- Review and revise content, ensuring it meets quality standards and is free of errors.</div><div>\n<br>5. <em>Client Interaction:</em>\n</div><div>- Occasionally communicate with clients to gain insight into their content needs and feedback.</div><div>\n<br>6. <em>Analytics:</em>\n</div><div>- Collaborate with the analytics team to gauge content effectiveness and modify strategies as needed.</div><div><br></div><div><strong>Requirements:</strong></div><div><br></div><div>1. <em>Educational &amp; Professional:</em>\n</div><div>- Preferred but not required: Degree in Journalism, Communications, English, or related field.</div><div>- Preferred but not required: 2 years of experience in content writing, preferably in an agency setting.</div><div><br></div><div>2. <em>Skills:</em>\n</div><div>- Stellar writing and editing abilities with an impeccable command of English.</div><div>- Proficient in SEO principles and utilizing SEO tools.</div><div>- Ability to adapt writing style to different tones and platforms.</div><div><br></div><div>3. <em>Personal Qualities:</em>\n</div><div>- Strategic and critical thinking skills.</div><div>- Excellent research, organizational, and multitasking abilities.</div><div>- Strong interpersonal and communication skills.</div><div><br></div><div>4. <em>Technical Proficiency:</em>\n</div><div>- Familiarity with content management systems (e.g., WordPress).</div><div>- Proficient in using Microsoft Office and Google Workspace.</div><div><br></div><div>\n<strong>How to Apply:<br></strong><br>\n</div><div>Interested candidates are invited to submit their application via email. Your application should include samples of your writing or a link to your portfolio. All writing samples can consist of previously written content. Your sample will serve as the first step in our shortlisting process. Fortune Writers Inc. is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.</div><div><br></div><div>\n<em>Please note:</em> Only shortlisted candidates will be contacted for the subsequent recruitment stage.</div><div><br></div><div>\n<strong>About the Company:<br></strong><br>\n</div><div>Fortune Writers Inc. is a growing content creation agency, providing top-tier content solutions to businesses and individuals across the globe. With a reputation for crafting compelling narratives, we serve a diverse client base, from start-ups to Fortune 500 companies, assisting them in navigating their content challenges and transforming their communication strategies. Our culture is built upon a foundation of creativity, inclusivity, and innovation, empowering our team to elevate the content and stories we create.<br><br><strong>Application Deadline: </strong>Applications for this position will be accepted until further notice</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/fortune-writers-inc-content-writer\">https://weworkremotely.com/remote-jobs/fortune-writers-inc-content-writer</a></p>\n", "Publication Date": "Thu, 05 Oct 2023 18:47:57 +0000", "Link": "https://weworkremotely.com/remote-jobs/fortune-writers-inc-content-writer", "Expiry Date": "Wed, 03 Jan 2024 18:47:57 +0000"}, {"Region": "Anywhere in the World", "Title": "XM: Cloud Security Engineer", "Category": "All Other Remote", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Cyprus, Greece or Remote\n    <br /><strong>URL:</strong> <a href=\"https://xm.com\">https://xm.com</a>\n</p>\n\n<div><strong>The Role:</strong></div><div>We are looking for a Cloud Security Engineer with experience on AWS, to join our growing team. The successful candidate will have an essential role in ensuring the information security of our business. You will be working in a team that is designing and building resilient and secure Cloud environments that proactively prevent security threats.</div><div>\n<strong><br>The main responsibilities of the position include:<br></strong><br>\n</div><ul>\n<li>Design and build resilient Cloud infrastructures that are protected against security threats</li>\n<li>Develop and assess Cloud security solutions to secure systems, databases and networks</li>\n<li>Conduct assessment and make recommendations to ensure that appropriate controls are in place</li>\n<li>Gain insight into security incidents and threats by monitoring/analyzing logs and performing vulnerability assessments</li>\n<li>Participate in efforts that shape the company’s security policies, procedures and standards for use in Cloud environments</li>\n<li>Create technical and managerial level security reports for Cloud-based applications and infrastructure</li>\n<li>Implement and tests network and security Disaster Recovery procedures to ensure business continuity</li>\n<li>Monitor use of sensitive data and regulates access to safeguard information</li>\n<li>Ensure the confidentiality and integrity of data during transmission, storage and processing</li>\n<li>Review violations of security procedures and discusses procedures with violators to ensure they are not repeated</li>\n<li>Provide support to end users regarding network and security related issues</li>\n</ul><div>\n<strong><br>Main requirements:<br></strong><br>\n</div><ul>\n<li>BSc/MSc in Information Security or any other related field</li>\n<li>Minimum 1 year working experience in Information Security, with proven focus in Cloud Security</li>\n<li>Deep technical knowledge of Amazon Web Services (AWS). Expertise in Microsoft Azure and Oracle Cloud will be considered an advantage</li>\n<li>Hands-on experience on AWS services such as IAM, Organizations, SSO, VPC, Transit Gateway, S3, EC2, RDS, ELB, CloudTrail, Config, Inspector, GuardDuty, WAF, etc</li>\n<li>Clear understanding of current threats to Cloud infrastructure and advanced knowledge of securing such environments</li>\n<li>Experience in DevSecOps methodologies is considered a plus</li>\n<li>Experience building and deploying applications to the cloud (AWS, Azure, etc.) using Infrastructure as Code tools such as Terraform is considered a plus</li>\n<li>Expertise in container security is considered a plus</li>\n<li>Ability to work autonomously with minimum supervision and to integrate well within a team</li>\n<li>Excellent problem solving and analytical skills</li>\n<li>Ability to quickly learn new technologies in depth </li>\n</ul><div>\n<strong><br>Benefit from:<br></strong><br>\n</div><ul>\n<li>Attractive remuneration</li>\n<li>Food allowance</li>\n<li>Intellectually stimulating work environment</li>\n<li>Continuous personal development and international training opportunities</li>\n</ul><div><br></div><div><br></div><div><strong>All applications will be treated with strict confidentiality!</strong></div><div>\n<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/xm-cloud-security-engineer\">https://weworkremotely.com/remote-jobs/xm-cloud-security-engineer</a></p>\n", "Publication Date": "Wed, 12 Jul 2023 07:45:38 +0000", "Link": "https://weworkremotely.com/remote-jobs/xm-cloud-security-engineer", "Expiry Date": "Mon, 08 Jan 2024 07:45:38 +0000"}, {"Region": "Anywhere in the World", "Title": "Proxify AB: Senior Data Engineer", "Category": "All Other Remote", "Type": "Contract", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Sweden\n    <br /><strong>URL:</strong> <a href=\"http://career.proxify.io\">http://career.proxify.io</a>\n</p>\n\n<div><strong>The Role:</strong></div><div><br></div><div>We are looking for a Senior Data Engineer with commercial experience for one of our clients.  You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products. </div><div><br></div><div><strong>What we are looking for:</strong></div><div><br></div><ul>\n<li>+5 years of solid experience as a Data Engineer in a top-notch environment.</li>\n<li>+3 years of experience with Cloud Infrastructures (e.g. Azure or AWS), virtualization and containerization environments (e.g. VMware, Docker, Kubernetes).</li>\n<li>Strong knowledge of software development processes including testing, continuous integration/delivery, automated deployment and verification/maintenance.</li>\n<li>High degree of ambition for self-improvement and self-initiative.</li>\n<li>Ability to work with minimal supervision.</li>\n<li>Intermediate-advanced English level.</li>\n<li>You can communicate well with both technical and non-technical clients.</li>\n</ul><div><br></div><div>\n<strong>Nice-to-have:</strong> <br><br>\n</div><ul>\n<li>Experience in data warehousing and data modeling.</li>\n<li>Solid understanding of relational database systems.</li>\n<li>Knowledge in working with Apache Spark.</li>\n<li>Time zone: CET (+/- 3 hours).</li>\n<li>Azure certifications in Cloud development and architecture would be a plus.</li>\n</ul><div><br></div><div><strong>Responsibilities:</strong></div><div><br></div><div>Competency in Implementing the best practices in AI/ML development to ensure the data pipelines and solutions are:</div><div><br></div><ul>\n<li>Effectively and efficiently tailored towards specific applications (automated processes on hybrid cloud/on-prem infrastructure).</li>\n<li>Scalable and maintainable to address an extensive customer community.</li>\n<li>Secure “on-prem” to protect the client’s IP.</li>\n<li>Knowledgeably built with the infrastructure upon which the prediction models will run.</li>\n</ul><div><br></div><div>\n<strong><br>What Proxify offers<br></strong><br>\n</div><ul>\n<li>\n<strong>Career-accelerating positions at cutting-edge companies</strong><br>Discover exclusive long-term remote engagements at the world's most interesting product companies.<br><br><br>\n</li>\n<li>\n<strong>Hand-picked opportunities, just for you</strong><br>Skip the typical recruitment roadblocks and biases with personally matched engagements.<br><br><br>\n</li>\n<li>\n<strong>Fast-track your independent developer career</strong><br>Start small and gain more freedom to take on new engagements as you build your independent developer career.<br><br><br>\n</li>\n<li>\n<strong>A recruitment process that values your time<br></strong>Only one hiring process with the possibility of several positions, without any additional tests.<br><br>\n</li>\n</ul><div>\n<br><strong>Salary Range: </strong>€3,200  - €6,080 per month<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/proxify-ab-senior-data-engineer\">https://weworkremotely.com/remote-jobs/proxify-ab-senior-data-engineer</a></p>\n", "Publication Date": "Thu, 02 Mar 2023 11:22:50 +0000", "Link": "https://weworkremotely.com/remote-jobs/proxify-ab-senior-data-engineer", "Expiry Date": "Wed, 27 Dec 2023 11:22:50 +0000"}, {"Region": "Anywhere in the World", "Title": "The Urban Writers: Freelance Creatives", "Category": "All Other Remote", "Type": "Contract", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0081/7380/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Toronto, Canada \n    <br /><strong>URL:</strong> <a href=\"https://theurbanwriters.com/\">https://theurbanwriters.com/</a>\n</p>\n\n<div><strong>Freelancers Wanted</strong></div><div><br></div><div>\n<strong>Looking for a better way to freelance?</strong><br>Check out TUW, the ultimate marketplace platform connecting you with businesses and individuals hungry for your skills! Our interactive and engaging platform provides a dynamic space for you to <strong>showcase your unique talents </strong>and connect with incredible clients from around the globe.Our SaaS-driven approach means we're always on the pulse of what our industry needs, and we're constantly providing you with the tools you need to achieve your goals and beyond.<strong>An easy-to-use interface that brings the customers to you!</strong>We're the go-to destination for talented and motivated freelancers who want to work with <strong>top-tier clients</strong>, build their reputation, and achieve their professional goals.We are revolutionizing the way creatives work with our user-friendly interface, flexible scheduling, and competitive rates, we offer inspiring projects from amazing clients, while you remain in complete control over your schedule and workload.We know that the world of freelancing can be tough, but with us, you'll have access to a supportive community, cutting-edge tools, and helpful resources to help you thrive. Not to mention, being a part of our platform means you'll be part of a vibrant and dynamic community, full of driven professionals just like you.That TUW Winning Combination:</div><ul>\n<li>Hustling hard to meet those deadlines and your goals!</li>\n<li>Being a champion communicator with clients and other freelancers.</li>\n<li>Serving up work that's so GOSH-DARN good, people will weep with joy.</li>\n<li>Keeping things classy and professional 24/7.</li>\n<li>Knowing your craft so dang well that you're basically a SUPERHERO.</li>\n<li>Staying hip and with the times, so you can navigate Platform updates like a boss!</li>\n<li>Keeping customers so happy that they'll be writing odes to your greatness.</li>\n<li>You're a champion of the remote work game, balance out being comfortable with getting the work done</li>\n</ul><div>We've got clients searching high and low for creative freelancers.</div><div><br></div><ul>\n<li>Writers</li>\n<li>Line/Copy Editors</li>\n<li>Book Cover Designers</li>\n<li>Book Illustrators</li>\n<li>Book Narrators!</li>\n</ul><div><br></div><div><strong>Build your business on a better Platform! </strong></div><div><br></div><div>Apply Via Website Only:</div><div>Please use this link to apply via our website. <a href=\"https://theurbanwriters.com/pages/join-our-team\">Apply Online</a>: <a href=\"https://theurbanwriters.com/pages/join-our-team\">https://theurbanwriters.com/pages/join-our-team</a> </div><div>Candidates will be asked to submit a short sample.</div><div>A trial/test order is a further part of the application and decision making process including platform and style guide training.</div><div>We pay in US currency.</div><div>\n<br><br>To learn more about our company please visit<a href=\"http://www.theurbanwriters.com/\"> www.theurbanwriters.com</a> </div><div>\n<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/the-urban-writers-freelance-creatives\">https://weworkremotely.com/remote-jobs/the-urban-writers-freelance-creatives</a></p>\n", "Publication Date": "Wed, 28 Jul 2021 16:38:05 +0000", "Link": "https://weworkremotely.com/remote-jobs/the-urban-writers-freelance-creatives", "Expiry Date": "Fri, 15 Dec 2023 16:38:05 +0000"}], "DevOps and Sysadmin Jobs": [{"Region": "Anywhere in the World", "Title": "Bax Energy: Service Reliability Engineer", "Category": "DevOps and Sysadmin", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7494/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Acireale, Italy\n    <br /><strong>URL:</strong> <a href=\"https://baxenergy.com\">https://baxenergy.com</a>\n</p>\n\n<div>To support our growth, we’re looking for an experienced and passionate Service Reliability Engineer (SRE) to join our fully remote team. We’re seeking someone with solid infrastructure-as-code skills and experience implementing service monitoring and infrastructure automation. If you’re a driven technical geek who thrives in the fast-paced environment of a fast growing scale-up, we want to hear from you!<br><br>\n</div><div>\n<strong><br>What you’ll do<br></strong><br>\n</div><ul>\n<li>Develop and maintain our infrastructure using Ansible and Terraform</li>\n<li>Provide technical leadership to a team of SRE managing hundreds of services and virtual machines</li>\n<li>Collaborate with our development team to integrate new services, including MLops infrastructure, into our and our customers’ clouds</li>\n<li>Devise and implement new and better ways to do infastructure together with our development and architecture teams</li>\n<li>Make a real impact in the way we do SRE as our lead SRE</li>\n<li>You’ll maintain services that ensure millions of people have access to clean, renewable energy</li>\n</ul><div>\n<strong><br>What we are looking for<br></strong><br>\n</div><ul>\n<li>Smart and gets things done</li>\n<li>At least two years of experience as a Service Reliability Engineer</li>\n<li>Full proficiency of infrastructure-as-code with Terraform and cloud services (we use Azure)</li>\n<li>Versatility – we are growing and building our practices as we go!</li>\n<li>Experience working with high performance teams</li>\n<li>Demonstrable contributions to significant projects or FOSS initiatives (e.g., on GitHub)</li>\n<li>Excellent communication and teamwork skills, with the ability to work remotely. Fluent English written and spoken (C2).</li>\n</ul><div>\n<strong><br>Why join BaxEnergy?<br></strong><br>\n</div><ul>\n<li>Contribute to meaningful projects that make a difference, we build the software used to drive the adoption of renewable energy (solar, wind, geothermal)</li>\n<li>Join a growing remote team, offering plenty of room for personal and professional growth with highly skilled coworkers (alums of Toptal, Stack Overflow, …)</li>\n<li>Enjoy the flexibility and work-life balance that come with a fully remote role</li>\n<li>33 days paid vacation and sick leave</li>\n<li>Yearly retreats and paid travel arrangements</li>\n<li>Paid premium hardware and all you need to do your job</li>\n<li>Be part of an inclusive, supportive, and diverse team that values creativity and innovation</li>\n<li>Free canteen and gym at our Catania offices if you decide to come by</li>\n</ul><div><br></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/bax-energy-service-reliability-engineer\">https://weworkremotely.com/remote-jobs/bax-energy-service-reliability-engineer</a></p>\n", "Publication Date": "Wed, 06 Dec 2023 08:52:44 +0000", "Link": "https://weworkremotely.com/remote-jobs/bax-energy-service-reliability-engineer", "Expiry Date": "Fri, 05 Jan 2024 08:52:44 +0000"}, {"Region": "Anywhere in the World", "Title": "Truestory: Platform Engineer", "Category": "DevOps and Sysadmin", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7452/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Aarhus, Denmark\n    <br /><strong>URL:</strong> <a href=\"https://truestory.com/\">https://truestory.com/</a>\n</p>\n\n<div>\n<strong><br>The Role<br></strong>Join us as our inaugural DevOps/Platform Engineer and set the stage for our Platform's future! Up until now, we've navigated without a dedicated DevOps/Platform engineer, presenting a unique opportunity for you to not only propel us forward but also significantly shape our approach. We envision you embracing this role with zeal, taking charge of our platform's reliability, security, and scalability. If you're growth-driven, passionate about your work, and thrive on bringing fresh ideas to life, you're the ideal candidate for us.<strong><br></strong><br>\n</div><div><br></div><div><strong><br>What We're Looking For</strong></div><ul>\n<li>A minimum of 3 years in engineering roles, focusing on DevOps or platform engineering.</li>\n<li>Profound knowledge of AWS, cloud automation tools like Terraform, containerisation (Docker, Kubernetes), ELK stack, MySQL and SQL Server databases, configuration management systems (Puppet), and monitoring tools (Prometheus, Grafana).</li>\n<li>Strong expertise in networking, documentation, web technologies (including HTTP caching, Linux OS, Elasticsearch).</li>\n<li>Exceptional troubleshooting skills, and the ability to use monitoring and metrics for operational advancements.</li>\n<li>Fluency in English (both written and spoken) and a standout performer in a remote-first work environment.</li>\n</ul><div><strong><br>Nice-to-Have</strong></div><ul>\n<li>AWS certifications (e.g., AWS Certified DevOps Engineer) are a significant bonus.</li>\n<li>Familiarity with .Net Framework (C#).</li>\n<li>A robust grasp of deployment processes via GitHub.</li>\n<li>Keen interest in embracing and implementing AI tooling.</li>\n</ul><div><strong><br>Responsibilities</strong></div><div>As our pioneering DevOps/Platform Engineer, you will lead and implement our platform infrastructure, collaborating with our Platform Tech-lead and development team. Your day-to-day will include:<br><br>\n</div><ul>\n<li>Crafting and maintaining a scalable, highly available cloud infrastructure, perfectly tailored to our needs.</li>\n<li>Automating infrastructure provisioning and configuration using Terraform scripts.</li>\n<li>Streamlining our CI/CD pipelines with Github Workflows for seamless software deployment.</li>\n<li>Managing containerised applications using AWS services (Amazon ECS or EKS) and orchestrating with Docker and Kubernetes.</li>\n<li>Applying Infrastructure as Code principles to manage our infrastructure resources efficiently.</li>\n<li>Developing and overseeing monitoring and logging solutions to ensure peak performance and health of our platform.</li>\n<li>Collaborating closely with development and Service Teams to guarantee minimal downtime and continual operational improvements.</li>\n<li>Crafting and maintaining disaster recovery plans, bolstering the resilience of our cloud-based systems.</li>\n<li>Tackling performance bottlenecks, optimising AWS resources, and incorporating best practices for maximum efficiency.</li>\n<li>Creating and updating technical documentation for our AWS infrastructure, deployment processes, and best practices.</li>\n<li>Taking the helm in developing our DevOps/Platform area in close partnership with our Tech-lead.</li>\n</ul><div><strong><br>Truestory</strong></div><div>At Truestory we want to help people experience more together. Truestory is a curated marketplace built to create and share experiences in Scandinavia. We cater to our customers and our hosts by being a helping hand. Our platform allows customers to find, buy, and book their next experience for themselves or as a gift for someone, while our hosts get exposure and a new customer base. Win-win.<br><br>\n</div><div>Working at Truestory is full of freedom and challenges that will move you professionally and personally. We have a flat organizational structure with a really ambitious growth plan, but still a goal of keeping things calm. We dont believe in burning the midnight oil – we believe in balance and in being “good at home”, in order to be good at work. All of this while still delivering great results and constantly moving the bar and improving key metrics.<br><br>\n</div><div><strong><br>What We Offer</strong></div><ul>\n<li>\n<strong>Remote-First Culture:</strong> We relish the flexibility and convenience of working from anywhere.</li>\n<li>\n<strong>Career Growth:</strong> Seize the opportunity to lead and reshape our entire DevOps &amp; Platform engineering unit.</li>\n<li>\n<strong>Collaborative Team:</strong> Thrive in an environment where teamwork and collective achievements are celebrated.</li>\n<li>\n<strong>A Team of Dedicated Individuals:</strong> Join forces with a group of highly motivated people, all committed to excellence and ownership.</li>\n</ul><div><strong><br>Facts About the Position</strong></div><ul>\n<li>Full-time (37 hours weekly).</li>\n<li>Remote-first, with the option to work from our Aarhus office.</li>\n<li>Salary range: €3,800 - €6,400 per month.</li>\n<li>Applications deadline: 15.01.2024.</li>\n</ul><div>\n<strong><br>Application Process<br></strong>We're excited to hear your story and understand your expertise in DevOps/Platform engineering.<strong><br><br></strong>Apply by sending an email to <a href=\"mailto:job@truestory.com\">job@truestory.com</a> with “DevOps at Truestory” as the subject.<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/truestory-platform-engineer\">https://weworkremotely.com/remote-jobs/truestory-platform-engineer</a></p>\n", "Publication Date": "Fri, 01 Dec 2023 13:10:16 +0000", "Link": "https://weworkremotely.com/remote-jobs/truestory-platform-engineer", "Expiry Date": "Sun, 31 Dec 2023 13:10:16 +0000"}, {"Region": "Anywhere in the World", "Title": "RemoteMore: DevOps Engineer", "Category": "DevOps and Sysadmin", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Berlin/Chicago \n    <br /><strong>URL:</strong> <a href=\"https://remotemore.com/candidates?utm_source=wwr&amp;utm_medium=jobpost&amp;utm_campaign=devops\">https://remotemore.com/candidates?utm_source=wwr&amp;utm_medium=jobpost&amp;utm_campaign=devops</a>\n</p>\n\n<div><strong>The position</strong></div><div><br></div><div>RemoteMore is helping a large tech company hire DevOps Engineers for its Australian and US teams.</div><div><br></div><div>The company is a major tech leader and works across many internal product teams. Multiple DevOps engineers will be hired and matched to the best-fit teams for their background/experience. The company culture is to focus on work delivered and not hours worked.</div><div><br></div><div>Good work-life balance is encouraged. You can work from home or any other place of your choice.</div><div><br></div><div>The position is full-time and fully remote.</div><div>\n<br><br>\n</div><div><strong>Your profile</strong></div><div><br></div><div>Coming from a strong technical background, you are expected to have:</div><div><br></div><ul>\n<li>Required technologies: AWS/Azure/GCP,  Kubernetes, CI/CD pipelines</li>\n<li>Bonus points: Programming language proficiency (Python/JavaScript/Golang, etc); Docker; Jenkins; Linux</li>\n<li>Exceptional English Language Skills: Required to work as part of an international team.</li>\n<li>Time Zone: Availability to work in Australian and US time zones</li>\n<li>Top technical skills for your level of experience: Intermediate or Senior (3+  years of experience)</li>\n<li>The soft skills to work remotely: Strong individual contributor, strong communication skills.</li>\n<li>Passion for remote work: You understand the pros and cons of working remotely</li>\n</ul><div><br></div><div><br></div><div><strong>Why should YOU apply?</strong></div><div><br></div><ul>\n<li>Work from anywhere you want.</li>\n<li>Competitive compensation based on your skills.</li>\n<li>Work in a team with other top developers.</li>\n<li>Making a difference.<br><br>\n</li>\n</ul><div>To be considered for the position, please sign up to RemoteMore by following the apply button. </div><div>\n<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/remotemore-devops-engineer-1\">https://weworkremotely.com/remote-jobs/remotemore-devops-engineer-1</a></p>\n", "Publication Date": "Fri, 24 Nov 2023 22:24:44 +0000", "Link": "https://weworkremotely.com/remote-jobs/remotemore-devops-engineer-1", "Expiry Date": "Sun, 24 Dec 2023 22:24:44 +0000"}], "Full-Stack Programming Jobs": [{"Region": "Anywhere in the World", "Title": "Yoko Co: Full Stack Web Developer - WordPress & More ", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> McLean, VA\n    <br /><strong>URL:</strong> <a href=\"https://www.yokoco.com/\">https://www.yokoco.com/</a>\n</p>\n\n<div>We're looking for a senior developer with a strong sense of teamwork and a desire to make a positive impact on the world. You'll take on a player/coach position, and contribute directly to some great projects while also providing guidance and mentorship to our team. </div><div><br></div><div><strong>Why work at Yoko Co?</strong></div><div><br></div><ul>\n<li>\n<strong>Do good, better:</strong> We exclusively serve clients who make a positive impact on the world. This is your chance to build things that help create a better place for all of us.</li>\n<li>\n<strong>4-day work week and lots of holidays.</strong> Mondays are flex days, meaning you’re free to take them off if you’re caught up on your work. Plus, we’re closed for nearly a full week at Thanksgiving (November), and two weeks at the end of the year, plus a bunch of other days, too. Work-life balance FTW!</li>\n<li>\n<strong>High performance, no jerks.</strong> You'll collaborate with good people who believe in doing great work.</li>\n<li>\n<strong>Best Place to Work (and that’s not just our opinion).</strong> We’ve been named a Best Place to Work by the Inc. 5000 and Washington Business Journal.</li>\n</ul><div><br></div><div>We value team members who are motivated by our mission and driven to make a positive impact. If you have a passion for excellence, a growth mindset, and a commitment to collaboration, we'd love to hear from you.</div><div><br></div><div><strong>In this role, you’ll:</strong></div><div><br></div><ul>\n<li>Work on multiple projects at once, collaborating with other developers, designers, project managers, and strategists on a variety of engagements </li>\n<li>Help expand our codebase, workflows, and tools, while maintaining focus on reliability and scalability</li>\n<li>Participate in code reviews and provide constructive feedback to foster a culture of continuous improvement</li>\n<li>Help shape the future of our team by contributing to strategy and planning</li>\n<li>Work on complex projects involving advanced technologies and integrations, alongside our core offerings (like WordPress)</li>\n</ul><div><br></div><div><strong>To succeed in this position, you’ll need: </strong></div><div><br></div><ul>\n<li>Extensive experience with WordPress development, including custom plugins, functionality, themes, data structures, and integrations</li>\n<li>Strong proficiency in Git, PHP, MySQL, Javascript, HTML, CSS </li>\n<li>Experience working with modern frontend frameworks and libraries like React or VueJS </li>\n<li>Exceptional leadership and communication skills to inspire and mentor team members</li>\n<li>A solution-oriented mentality, and the perspective, context, and awareness to solve complex problems in a sustainable way </li>\n<li>8+ years of experience building cool stuff for the internet, and a commitment to continuous learning (for yourself and others)</li>\n<li>Availability to work at least 5 hours overlap with 9-5pm ET</li>\n<li>A genuine desire to contribute to the growth of our team and the quality of our work</li>\n</ul><div><br></div><div><strong>What you get:</strong></div><div><br></div><div>You’ll get a flexible schedule, unlimited time off, a competitive salary, a profit share bonus (starting in your second year), the ability to work wherever you want, a personal development budget, and all US federal holidays and multiple weeks off at the end of the year to recharge. We’ll also offset your entire carbon footprint. If you’re in the US, we also offer health insurance, disability and life insurance, and 401(k) matching.</div><div><br></div><div><strong>More about us:</strong></div><div><br></div><div>We’re a group of people who are passionate about the work we do, the clients we serve, and improving our craft. We also care about each other — we don’t think of one another as coworkers or employees, but as fellow humans. From developers to designers, project managers to strategists, we bring out the best in each other.</div><div><br></div><div>We’ve been in business for over a decade, our whole team is remote, we’ve been named a Best Place to Work by the Inc. 5000 and the Washington Business Journal. </div><div><br></div><div><strong>To apply:</strong></div><div><br></div><div>If you’re interested, send an email to careers@yokoco.com with the subject line “<strong>Secret Treehouse Club</strong>” — and while you’re at it, we’d love to learn a bit more about you and get a link to your website, your GitHub, and/or some neat stuff you’ve built.  </div><div><br></div><div>We take applicants from all over the world. However, you must be willing to work a schedule that overlaps with normal US business hours. </div><div>\n<br>Please note that we will begin responding to applications the week of January 8, 2024. </div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/yoko-co-full-stack-web-developer-wordpress-more-1\">https://weworkremotely.com/remote-jobs/yoko-co-full-stack-web-developer-wordpress-more-1</a></p>\n", "Publication Date": "Tue, 12 Dec 2023 20:45:34 +0000", "Link": "https://weworkremotely.com/remote-jobs/yoko-co-full-stack-web-developer-wordpress-more-1", "Expiry Date": "Thu, 11 Jan 2024 20:45:34 +0000"}, {"Region": "Anywhere in the World", "Title": "Clerky: Senior Software Engineer (Ruby on Rails)", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0074/4823/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Palo Alto, CA\n    <br /><strong>URL:</strong> <a href=\"https://www.clerky.com\">https://www.clerky.com</a>\n</p>\n\n<div>Help fix the legal industry!</div><div><br></div><div>The way legal paperwork gets done is filled with inefficiencies, which leads to ridiculously high legal fees. We fix this by building software that automates and streamlines the process.</div><div><br></div><div>We're profitable and growing sustainably. We're the most popular way for high-growth technology startups to form, and are also used by tons of top-tier startups for hiring and fundraising. Our software is more advanced than any other online legal service. We've invested a lot in architecture, maintainability, and testing, giving us a significant advantage as we build out functionality that founders and attorneys can currently only dream of.</div><div><br></div><div>We're a quiet leader in the legal technology space — if you are interested in changing the legal industry, this is arguably the best place to be.</div><div>\n<strong><br>Notes on our stack and process:</strong><br><br>\n</div><ul>\n<li>Our backend is mostly in Ruby on Rails, with very small amounts of Scala and Go as well.</li>\n<li>Our front-end is mostly in Ember.</li>\n<li>We use CI extensively for linting, tests, visual diffs, and deployment.</li>\n<li>We're not religious about any particular technology — we believe in using the right tool for a given problem.</li>\n</ul><div>\n<strong><br>This is a great fit if you want to work:<br></strong><br>\n</div><ul>\n<li>... on a complex product, with a ton of engineering challenges</li>\n<li>... in a company that strongly values good software development practices</li>\n<li>... at a product-driven company bringing an archaic industry into the future</li>\n<li>... on a beloved product with a lot of usage and visibility in the startup community</li>\n<li>... with bright people who are extremely passionate about their work</li>\n<li>... on a small, extremely high-performing team </li>\n<li>... at a financially sound company that is not dependent on venture capital financing</li>\n</ul><div>\n<strong><br>You must have:</strong><br><br>\n</div><ul>\n<li>An inability to write anything but clean, maintainable code.</li>\n<li>A strong aversion to code without test coverage.</li>\n<li>Deep experience with building, maintaining, and optimizing large-scale, production Ruby on Rails applications</li>\n<li>Significant experience building software as part of a team with strong development practices</li>\n<li>Native-level written English communication skills</li>\n</ul><div>\n<br><br>Experience with Ember is a huge bonus, but not mandatory.</div><div><br></div><div>We've been remote-first since 2013. We are only looking directly for full-time employees - we are absolutely not interested in agencies, contractors, or recruiters.</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/clerky-senior-software-engineer-ruby-on-rails-1\">https://weworkremotely.com/remote-jobs/clerky-senior-software-engineer-ruby-on-rails-1</a></p>\n", "Publication Date": "Tue, 12 Dec 2023 06:15:38 +0000", "Link": "https://weworkremotely.com/remote-jobs/clerky-senior-software-engineer-ruby-on-rails-1", "Expiry Date": "Thu, 11 Jan 2024 06:15:38 +0000"}, {"Region": "Anywhere in the World", "Title": "Reply Pro: Tech Lead (GCP/Python/Microservices)", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7485/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Boise, Idaho\n    <br /><strong>URL:</strong> <a href=\"https://replypro.io\">https://replypro.io</a>\n</p>\n\n<div>Are you craving a chance to grow with a forward-thinking team? If so, Reply Pro wants to hear from you! We are seeking an ambitious tech lead to join our growing company!</div><div><br></div><div>Reply Pro, a growing SaaS company based in the U.S., is a leader in omnichannel Customer Experience (CX) management for local businesses. We empower businesses with our tools to enhance customer experiences, streamline processes, and foster growth.</div><div><br></div><div><strong>This is a full-time, 100% remote role. We hire and pay you directly!</strong></div><div><br></div><div><strong>Role Outcomes</strong></div><ul>\n<li>\n<strong>Platform Scalability</strong>: Successfully lead the platform's rebuild to efficiently handle over 50,000+ MAUs within the next 6 months.</li>\n<li>\n<strong>Enterprise-Grade Reporting</strong>: Refine and scale the existing reporting system to meet enterprise-level demands, targeting the capability to efficiently handle reporting for 10,000+ locations within the next 3 months.</li>\n<li>\n<strong>Mentorship and Team Growth</strong>: Actively mentor junior engineers, aiming to enhance their skills and responsibilities, with measurable growth in their performance and autonomy in project execution within 6 months.</li>\n</ul><div><br></div><div><strong>Key Responsibilities</strong></div><ul>\n<li>Autonomously manage complex projects from planning to delivery.</li>\n<li>Lead the development of event-driven microservices and GraphQL API integrations.</li>\n<li>Implement modern DevOps practices (Github Actions, Terraform, Docker, Kubernetes, serverless).</li>\n<li>Plan and architect new features, subdomains, domain models, and microservices.</li>\n<li>Assist with backlog refinement and sprint planning.</li>\n<li>Help engineers triage and overcome blockers.</li>\n<li>Write and review project specifications for projects.</li>\n<li>Run 1on1s with engineers.</li>\n<li>Champion TDD best practices.</li>\n</ul><div><br></div><div>To be successful in this role, you must be self-driven. You must be able to take action, even when you lack all the information you need. The kinds of problems we deal with are ambiguous. You must be willing and capable of thriving in a role where you make big decisions and are accountable for those decisions.</div><div><br></div><div>The first 45 days working with us will be an introductory period. After your first 45 days, we evaluate if you are a strong fit per the criteria in this post. If we feel that we are a solid fit for each other, we will extend our offer to a permanent role.</div><div><br></div><div>During your introductory period, we would also like to see that you are able to take ownership of your learning and are able to take projects from planning to delivery.</div><div><br></div><div><strong>Ideal Candidate:</strong></div><ul>\n<li>At least 5 years of Python backend development experience.</li>\n<li>3+ years of experience with Django, FastAPI, and/or GraphQL Relay.</li>\n<li>One (1) year of experience with microservice architecture and DDD modeling.</li>\n<li>At least one (1) year of project management and delivery experience.</li>\n<li>At least 6 months of public code published on Github (class/hobby projects are ok) so we can see your coding style.</li>\n<li>Exceptional communication and leadership skills, with a focus on team collaboration.</li>\n<li>Eagerness to embrace rapid learning and contribute to a visionary tech environment.</li>\n</ul><div><br></div><div><strong>Skills</strong></div><ul>\n<li>Python 3</li>\n<li>Django/FastAPI</li>\n<li>Google Cloud Platform (GCP)</li>\n<li>GraphQL + Relay</li>\n<li>DDD + Domain modeling</li>\n<li>SQL</li>\n<li>TDD</li>\n<li>Project management</li>\n<li>Git/Github</li>\n<li>Team management and agile planning</li>\n</ul><div><br></div><div><strong>You will be a great fit in Reply Pro's culture if you….</strong></div><ol>\n<li>Embrace our core values: Extreme Ownership, Move the Needle, Constant Communication, and Make it Easy. These values should already align with your personal approach to work and collaboration.</li>\n<li>Contribute positively to our high-energy environment, which values your contributions and ideas. We look for team members who energize and enhance our culture.</li>\n<li>Seek opportunities for professional growth. This role lets you work towards significant salary increases.</li>\n<li>Have a natural inclination towards professional development. If learning and refining your craft feels like a chore, you may not be a good fit. We are committed to supporting our employees' growth. We provide books, online courses, and other professional development tools.</li>\n</ol><div><br></div><div><strong>Remote Work Requirements</strong></div><div>For this role, you must have:</div><ul>\n<li>A reliable high-speed internet connection and a quality microphone.</li>\n<li>Availability to work 8+ hours per day between 7 AM and 5 PM Mountain Standard Time.</li>\n</ul><div><br></div><div><strong>What We Offer</strong></div><ul>\n<li>Competitive compensation with the potential for an increase based on performance and role evolution.</li>\n<li>A flexible, remote work environment that values freedom and trust.</li>\n<li>Opportunities for growth, personal education, and advancement within the company.</li>\n<li>A supportive and collaborative team environment that practices Constant Communication and values diversity and respect.</li>\n</ul><div><br></div><div><strong>Interested? Start the Application Process</strong></div><div>Are you ready to make a real impact? Apply now by sending us a note. We will send you a link to our application. Please note that we hire directly. No agencies, please.</div><div><br></div><div>Thank you for considering us for your next career move!</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/reply-pro-tech-lead-gcp-python-microservices\">https://weworkremotely.com/remote-jobs/reply-pro-tech-lead-gcp-python-microservices</a></p>\n", "Publication Date": "Thu, 07 Dec 2023 16:45:14 +0000", "Link": "https://weworkremotely.com/remote-jobs/reply-pro-tech-lead-gcp-python-microservices", "Expiry Date": "Sat, 06 Jan 2024 16:45:14 +0000"}, {"Region": "Anywhere in the World", "Title": "LifeAnalytics: mage Analysis Web Application Senior Full Stuck Develope", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7461/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> LifeAnalytics\n    <br /><strong>URL:</strong> <a href=\"https://lifeanalytics.org\">https://lifeanalytics.org</a>\n</p>\n\n<div>The ideal candidate is self-motivated, multi-tasker, and a proven team player. Become a lead developer responsible for developing new software products and enhancing existing ones. Must be good at working with large scale applications and frameworks and have good communication and leadership skills.</div><div><br></div><div>responsibility)</div><div>Write clean, high-quality, performant, and maintainable code</div><div>Software development and support, including applications, database integration, interfaces and new enhancements</div><div>Coordinate across departments to ensure projects meet business objectives and compliance standards</div><div>Support testing and deployment of new products and features</div><div>Participate in code review</div><div><br></div><div>High skills required）</div><div>react,</div><div>vue.js,</div><div>fast APIs,</div><div>python,</div><div>json,</div><div>docker,</div><div>image processing,</div><div>c++</div><div>u-net,</div><div>caffe,</div><div>image analysis</div><div>deep learning</div><div>openCV</div><div>openGL</div><div>PHP</div><div>Laravel</div><div><br></div><div>Qualification)</div><div>Image analysis, image processing development experience, and those who are suitable for microscopes</div><div>7+ years of relevant work experience</div><div>Expertise in object-oriented design, database design, and XML Schema</div><div>Experience with Agile or Scrum software development methodologies</div><div>Ability to multitask, organize and prioritize</div><div>Experience with React, Vue.js, Docker, GCP, TensorFlow, U-net, Python, Laravel, PHP, imageJ</div><div><br></div><div>work)</div><div>Supervisor or Sinor Web Application Developer</div><div>biotechnology</div><div>employment situation</div><div>full-time employee</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/lifeanalytics-mage-analysis-web-application-senior-full-stuck-develope\">https://weworkremotely.com/remote-jobs/lifeanalytics-mage-analysis-web-application-senior-full-stuck-develope</a></p>\n", "Publication Date": "Sat, 02 Dec 2023 10:52:59 +0000", "Link": "https://weworkremotely.com/remote-jobs/lifeanalytics-mage-analysis-web-application-senior-full-stuck-develope", "Expiry Date": "Mon, 01 Jan 2024 10:52:59 +0000"}, {"Region": "Anywhere in the World", "Title": "LeadSimple, Inc.: Senior Software Engineer I", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0075/9006/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Washington State, U.S.A.\n    <br /><strong>URL:</strong> <a href=\"https://www.leadsimple.com/careers\">https://www.leadsimple.com/careers</a>\n</p>\n\n<div>The mission of the Senior Software Engineer is to own delivery of projects of high complexity with strong effort and skill, significantly expanding the company’s capacity to deliver value to end users, while mentoring mid- or junior-level software engineers.<br><br>\n</div><div>‍<br><br>\n</div><div>\n<strong><br>A day in the life of a Senior Software Engineer…<br></strong><br>\n</div><ul>\n<li>High Quality Code - Code follows both industry and LeadSimple best practices, causes few preventable bugs, doesn’t require many re-reviews, and changes are delivered on a daily basis.</li>\n<li>Debugging - Able to identify the root cause of bugs and potential solutions, and implement those solutions ASAP.</li>\n<li>Proficiency in specific technologies - Able to implement features and improvements independently using these technologies</li>\n<li>Front-End: React, Relay and GraphQL (1+ years)</li>\n<li>Back-End: Ruby on Rails, (3+ years preferred)  Postgres, Redis and some Elixir</li>\n<li>Automated Testing: RSpec, Minitest</li>\n<li>Proficiency in Automated Testing - Uses automated unit or functional tests to verify changes and prevent defects. Understands the core principles of Test-driven Design (TDD) or Behavior-driven Design. (BDD)</li>\n<li>Clear Communication - Speaks and writes clearly in English and maintains this standard in all forms of written communication including email, tickets and Slack. Able to communicate effectively with their supervisor about roadblocks.</li>\n</ul><div>\n<strong><br>Expectations for your first 90 days:<br></strong><br>\n</div><ul>\n<li>30 days: You are familiar with the company, product, and codebase. You have shipped 5+ code changes to production.</li>\n<li>60 days: You contribute meaningfully to the development process, delivering high quality PRs and PR reviews on a daily basis.</li>\n<li>90 days: You are able to complete full-stack tasks independently in the codebase. You have also completed at least 1 cycle focused on resolving bugs &amp; support tickets in your first 90 days.</li>\n</ul><div>\n<strong><br>Perks:<br></strong><br>\n</div><ul>\n<li>Company Holidays</li>\n<li>Paid Time Off (in addition to the above)</li>\n<li>Monthly Healthcare Allowance</li>\n<li>Yearly Vacation Allowance</li>\n<li>Fun and outcome driven work environment with a smart, hard working team</li>\n<li>Location independence</li>\n<li>Mission driven company and values-based culture</li>\n</ul><div>🚀 Want to join a team of A players in an exciting, high-growth, entrepreneurial environment?<br><br>\n</div><div>‍<br><br>\n</div><div>We’re a small team solving big problems in the property management industry. Bootstrapped since 2013, we're passionate about helping small businesses simplify growth and streamline operations, providing the leading CRM in our space.<br><br>\n</div><div>‍<br><br>\n</div><div>\n<strong>The long version of our story:</strong> Back when web 2.0 was a thing (<em>get off my lawn!</em>) LeadSimple’s founders started a lead generation business connecting landlords with property management companies. Witnessing the challenges lead buyers had closing deals led into a natural segue to build out an industry-specific CRM which became the de-facto industry standard. Fast forward to 2020 when we released a process/workflow suite to move from the sales side of our clients business into the heart of day-to-day operations. The market was hungry and responded aggressively to the new direction, which led us to double down with growth and additional product expansion.<br><br>\n</div><div>\n<strong><br>Please only apply if you:<br></strong><br>\n</div><ul>\n<li>Embrace learning new technology </li>\n<li>Learn fast</li>\n<li>Communicate crisply</li>\n<li>Proactively seek solutions</li>\n<li>Own the outcome</li>\n<li>Embody emotional maturity</li>\n<li>Bring an optimistic “can do” attitude</li>\n<li>Have B2B SaaS experience (preferred</li>\n</ul><div>\n<br><br>\n</div><div>\n<strong><br>Our Interview Process<br></strong><br>\n</div><ul>\n<li>Fill out the application</li>\n<li>Answer questions via video questionaire to help use get to know you (15 minutes)</li>\n<li>Entry Interview with a member from our People Operations team (15 minutes)</li>\n<li>Interview with Hiring Manager (60 - 90 minutes)</li>\n<li>Offline work sample test (up to 60 minutes)</li>\n<li>Possible panel interview (up to 60 minutes)</li>\n<li>Culture Interview (up to 30 minute) </li>\n<li>Offer call (15 minutes)</li>\n<li>Written offer</li>\n<li>Start date commences a 90 day onboarding period</li>\n</ul><div>‍<br><br>\n</div><div>SO…<strong>Are You All In?<br></strong><br>\n</div><div>Not everyone can hang. It take a special person - <br><br>\n</div><div>Someone who’s all IN. We are building a “rocket ship” at LeadSimple,<br><br>\n</div><div>And we need All Stars to help us accomplish our mission.<br><br>\n</div><div>LeadSimple, our team members are connected and driven leaders,<br><br>\n</div><div>Who take personal responsibility for what they create.<br><br>\n</div><div>We hit deadlines, we’re obsessed with both the customer and <br><br>\n</div><div>Team member experience. We own the outcome, <br><br>\n</div><div>We overcome obstacles and we find life lessons everywhere. <br><br>\n</div><div>‍<br><br>\n</div><div>\n<strong><br>In summary...<br></strong><br>\n</div><div>‍<br><br>\n</div><div>\n<em>You can do it in an office<br></em><br>\n</div><div>\n<em>You can do it from home<br></em><br>\n</div><div>\n<em>We really don’t care<br></em><br>\n</div><div>\n<em>As long as it’s known 👇<br></em><br>\n</div><div>‍<br><br>\n</div><div>\n<em>What matters is this…<br></em><br>\n</div><div>\n<em>When the chips are down<br></em><br>\n</div><div>\n<em>And your back is against the wall<br></em><br>\n</div><div>\n<em>Can we count on you to make the right call?<br></em><br>\n</div><div>‍<br><br>\n</div><div>\n<em>Judgment, intuition, or care by another name<br></em><br>\n</div><div>\n<em>We call it “Owning The Outcome” - because it really is the whole game<br></em><br>\n</div><div>\n<em>Have the customers back, and they will treat you the same<br></em><br>\n</div><div>‍<br><br>\n</div><div>\n<em>If you can do that<br></em><br>\n</div><div>\n<em>Then we’re birds of the same feather<br></em><br>\n</div><div>\n<em>So come join our team and we’ll make music together.<br></em><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/leadsimple-inc-senior-software-engineer-i\">https://weworkremotely.com/remote-jobs/leadsimple-inc-senior-software-engineer-i</a></p>\n", "Publication Date": "Fri, 01 Dec 2023 15:14:51 +0000", "Link": "https://weworkremotely.com/remote-jobs/leadsimple-inc-senior-software-engineer-i", "Expiry Date": "Sun, 31 Dec 2023 15:14:51 +0000"}, {"Region": "Anywhere in the World", "Title": "pooliestudios: Shopware 6 Entwickler (m/w/d) - Remote oder vor Ort", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Germany Cologne\n</p>\n\n<h2>Aufgaben</h2>\n<p>Als EntwicklerIn (m/w/d) für Shopware 6 schreibst du skalierbare und performante Lösungen für spannende E-Commerce-Projekte. Dein Fokus liegt dabei auf der Umsetzung und Weiterentwicklung. <strong>Gerne auch Remote/im Homeoffice.</strong></p>\n<p>Unser Tech-Stack: je nach Projekt Symfony, WordPress oder Shopware mit MySQL, Elasticsearch, MongoDB und/oder Redis. Frontend-Entwicklung in SCSS, Vanilla JS und/oder React. Entwicklung in Docker-Containern mit CI/CD, automatisierten Tests und Deployments mit GitLab.</p>\n<h2>Qualifikation</h2>\n<ul>\n<li>Sehr gute Kenntnisse in Shopware 6 und PHP</li>\n<li>Gute Kenntnisse in HTML, CSS und JavaScript</li>\n<li>Interesse an Continuous Integration und Deployment</li>\n<li>Tiefes Interesse an technologischen Entwicklungen</li>\n<li>Analytisches und konzeptionelles Denken</li>\n<li>Selbstständiges und lösungsorientiertes Arbeiten</li>\n<li>Du sprichst fließend Deutsch zur Kommunikation im Team und mit Kunden</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>Unbefristete Arbeitsverträge</li>\n<li>Freie Wahl des Arbeitsortes (Office oder Remote)</li>\n<li>KVB-Ticket für poolies in Köln</li>\n<li>50,- Euro Gehaltsextra mit SpenditCard</li>\n<li>Ein JobRad</li>\n<li>MentorIn für Junior KollegInnen</li>\n<li>Weiterbildungsbudget von Ø 2.500,- Euro im Jahr</li>\n<li>Macbook Pro (Wunschkonfiguration) + Peripherie</li>\n</ul>\n<p><strong>pooliestudios Voyage</strong><br>\nEnde September ging es für die gesamte Agentur eine ganze Woche in die Berge von Sitges, Spanien. Unsere Reise (company retreat) soll dazu beitragen, dass wir besser zusammenarbeiten und uns gegenseitig besser kennenlernen. Schließlich ist unsere Arbeit nur so gut, wie unser Zusammenhalt. Mal gucken wo es das nächste mal hingeht! <a href=\"https://www.youtube.com/watch?v=bxwxHZ2A2D8\">Zum Video</a>.</p>\n\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/pooliestudios-shopware-6-entwickler-m-w-d-remote-oder-vor-ort\">https://weworkremotely.com/remote-jobs/pooliestudios-shopware-6-entwickler-m-w-d-remote-oder-vor-ort</a></p>\n", "Publication Date": "Fri, 01 Dec 2023 13:31:30 +0000", "Link": "https://weworkremotely.com/remote-jobs/pooliestudios-shopware-6-entwickler-m-w-d-remote-oder-vor-ort", "Expiry Date": "Sun, 31 Dec 2023 13:31:30 +0000"}, {"Region": "Anywhere in the World", "Title": "LeadSimple, Inc.: Senior Software Engineer II", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Washington State, U.S.A.\n    <br /><strong>URL:</strong> <a href=\"https://www.leadsimple.com/careers\">https://www.leadsimple.com/careers</a>\n</p>\n\n<div>The mission of the Senior Software Engineer is to own delivery of projects of high complexity with strong effort and skill, significantly expanding the company’s capacity to deliver value to end users, while mentoring mid- or junior level software engineers.</div><div><br></div><div>We are looking to hire three Software Engineers for different teams, each role tailored to specific expertise. Please refer to the detailed requirements for each position below:<br><br>\n</div><ol>\n<li>\n<strong>Progressive Web App (PWA) Engineer (React/JavaScript/TypeScript)</strong>: As a PWA Engineer, your primary focus will be on crafting exceptional user experiences on mobile for customers. Proficiency in React and a strong understanding of PWAs is essential.</li>\n<li>\n<strong>AI Engineer (Ruby)</strong>: If you specialize in AI, this role is tailored for you. Your primary responsibility is to delve into building AI-powered features using commercially-available APIs, leveraging your experience with Ruby.</li>\n<li>\n<strong>Comms Integration Engineer (Ruby)</strong>: As a strong Ruby Backend Engineer, your core focus is on communication and deeper integration with Twilio, Gmail, and Microsoft APIs.<br><br>\n</li>\n</ol><div>\n<br>A day in the life of a Senior Software Engineer…<br><br>\n</div><ul>\n<li>Build amazing experiences for our customers</li>\n<li>Contribute ideas to scale the team, product, and company.</li>\n<li>Manage technical design, tasks, and deadlines for projects, providing status updates and escalating roadblocks.</li>\n<li>Verify code changes align with best practices, behave correctly, and include adequate automated tests.</li>\n<li>Triage incoming tickets, prioritize, and address customer-reported bugs, escalating when necessary.</li>\n<li>Participate in weekly meetings such as one-on-one and team meetings, bringing prepared discussion topics to address issues and propose process improvements.</li>\n<li>Participate in quarterly 1-hour performance reviews, discussing performance and personal development plans with your supervisor.<br><br>\n</li>\n</ul><div>\n<br>Expectations for your first 90 days:<br><br>\n</div><ul>\n<li>30 days: You are familiar with the company, product, and codebase. You can complete simple GitHub issues.</li>\n<li>60 days: You contribute meaningfully to the development process, delivering high quality PRs and PR reviews on a daily basis.</li>\n<li>90 days: You are able to complete full-stack tasks independently in the codebase. You have also completed at least 1 on-call rotation in your first 90 days.<br><br>\n</li>\n</ul><div>\n<br>Perks:<br><br>\n</div><ul>\n<li>Company Holidays</li>\n<li>Paid Time Off (in addition to the above)</li>\n<li>Monthly Healthcare Allowance</li>\n<li>Yearly Vacation Allowance</li>\n<li>Fun and outcome driven work environment with a smart, hard working team</li>\n<li>Location independence</li>\n<li>Mission driven company and values-based culture<br><br>\n</li>\n</ul><div>🚀 Want to join a team of A players in an exciting, high-growth, entrepreneurial environment?</div><div><br></div><div>We’re a small team solving big problems in the property management industry. Bootstrapped since 2013, we're passionate about helping small businesses simplify growth and streamline operations, providing the leading CRM in our space.</div><div><br></div><div>\n<strong>The long version of our story:</strong> Back when web 2.0 was a thing (<em>get off my lawn!</em>) LeadSimple’s founders started a lead generation business connecting landlords with property management companies. Witnessing the challenges lead buyers had closing deals led into a natural segue to build out an industry-specific CRM which became the de-facto industry standard. Fast forward to 2020 when we released a process/workflow suite to move from the sales side of our clients business into the heart of day-to-day operations. The market was hungry and responded aggressively to the new direction, which led us to double down with growth and additional product expansion.<br><br>\n</div><div>\n<br>Please only apply if you:<br><br>\n</div><ul>\n<li>Embrace learning new technology </li>\n<li>Learn fast</li>\n<li>Communicate crisply</li>\n<li>Proactively seek solutions</li>\n<li>Own the outcome</li>\n<li>Embody emotional maturity</li>\n<li>Bring an optimistic “can do” attitude</li>\n<li>Have B2B SaaS experience (preferred<br><br>\n</li>\n</ul><div>\n<br><br><br>\n</div><div>Our Interview Process<br><br>\n</div><ul>\n<li>Fill out the application</li>\n<li>Answer questions via video questionaire to help use get to know you (15 minutes)</li>\n<li>Entry Interview with a member from our People Operations team (30 minutes)</li>\n<li>Interview with Hiring Manager (60 - 90 minutes)</li>\n<li>Offline work sample test (up to 60 minutes)</li>\n<li>Possible panel interview (up to 60 minutes)</li>\n<li>Culture Interview (up to 30 minute) </li>\n<li>Offer call (15 minutes)</li>\n<li>Written offer</li>\n<li>Start date commences a 90 day onboarding period<br><br>\n</li>\n</ul><div><br></div><div>SO…<strong>Are You All In?<br></strong><br>\n</div><div>Not everyone can hang. It take a special person - <br><br>\n</div><div>Someone who’s all IN. We are building a “rocket ship” at LeadSimple,<br><br>\n</div><div>And we need All Stars to help us accomplish our mission.<br><br>\n</div><div>LeadSimple, our team members are connected and driven leaders,<br><br>\n</div><div>Who take personal responsibility for what they create.<br><br>\n</div><div>We hit deadlines, we’re obsessed with both the customer and <br><br>\n</div><div>Team member experience. We own the outcome, <br><br>\n</div><div>We overcome obstacles and we find life lessons everywhere. <br><br>\n</div><div><br></div><div>\n<br>In summary...<br><br>\n</div><div><br></div><div><em>You can do it in an office</em></div><div><em>You can do it from home</em></div><div><em>We really don’t care</em></div><div><em>As long as it’s known 👇</em></div><div><br></div><div><em>What matters is this…</em></div><div><em>When the chips are down</em></div><div><em>And your back is against the wall</em></div><div><em>Can we count on you to make the right call?</em></div><div><br></div><div><em>Judgment, intuition, or care by another name</em></div><div><em>We call it “Owning The Outcome” - because it really is the whole game</em></div><div><em>Have the customers back, and they will treat you the same</em></div><div><br></div><div><em>If you can do that</em></div><div><em>Then we’re birds of the same feather</em></div><div><em>So come join our team and we’ll make music together.</em></div><div>\n<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/leadsimple-inc-senior-software-engineer-ii\">https://weworkremotely.com/remote-jobs/leadsimple-inc-senior-software-engineer-ii</a></p>\n", "Publication Date": "Fri, 01 Dec 2023 12:51:50 +0000", "Link": "https://weworkremotely.com/remote-jobs/leadsimple-inc-senior-software-engineer-ii", "Expiry Date": "Sun, 31 Dec 2023 12:51:50 +0000"}, {"Region": "Anywhere in the World", "Title": "Pangolia: Lead WordPress Developer for Fast-Growing Pet Company (Remote/Worldwide)", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7446/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Singapore\n    <br /><strong>URL:</strong> <a href=\"https://pangolia.com\">https://pangolia.com</a>\n</p>\n\n<div>(btw, here's a quick video that explains the position: <a href=\"https://youtu.be/s8aW66ZB8_o?feature=shared\">https://youtu.be/s8aW66ZB8_o?feature=shared</a>)<br><strong><br>👉 Are you a talented web developer who loves WordPress? And do you get excited about building new features that will be used by millions of pet lovers every month? Then this could very well be the opportunity for you!</strong>\n</div><div>\n<br>We’re <a href=\"https://pangolia.com/\">Pangolia</a>—one of the fastest-growing pet companies, and we’re on a mission to create the biggest, most helpful pet company in the world. Our largest sites: <a href=\"https://www.catster.com/\">Catster.com</a>, <a href=\"https://www.dogster.com/\">Dogster.com</a>, <a href=\"https://www.hepper.com/\">Hepper.com</a>, and <a href=\"https://petkeen.com/\">PetKeen.com</a> are visited by more than 60 million pet lovers every year, and we’re undergoing rapid growth.</div><div>\n<br>Our media sites are all built on WordPress, and our own cat furniture e-commerce brand, Hepper, is running on WooCommerce.</div><div>\n<br>In this position you would be the lead web developer, which will consist of fixing the issues that come up, proactively keeping our sites secure, and building new things.<br><br>\n</div><div>We’re a 100% remote company so you’d have the freedom to work from anywhere. It's a full-time position (40 hours a week), yet you get to plan your own schedule and work whenever you want. You will become an integral member of our team at Pangolia consisting of a diverse group of more than 80 talented individuals from all over the world, joining us on our united goal of building the biggest, most helpful pet company in the world.<br><br>\n</div><div>📌 Note: we’re a fast-paced kickass team with very high expectations of ourselves and each other, and <strong>we work really hard</strong>. The webdev department needs to become kickass, so this position will definitely require working on some weekends.<br><br>\n</div><div>💻 We’re looking for a fullstack developer. However, for this position, <strong>it is much more important to be great at backend coding than frontend design</strong>. Our sites already look great on the front end, but it’s mainly on the back end where a lot of work needs to be done. (we also have graphic designers on our team)<br><br>\n</div><div>💬 <strong>Strong communication and team collaboration skills are a MUST. </strong>We're a remote company, so great communication is a fundamental part of making the company thrive.<br><br>\n</div><div>—&gt; All in all, this is a great opportunity if you’re an amazing developer looking to rapidly grow your skills whilst working alongside peers who are at the top of their field.<br><br>\n</div><div><strong>Big projects in front of us right now:</strong></div><div>1. Make Catster.com, Dogster.com, PetKeen.com, and Hepper.com the fastest loading websites when compared to our competitors, and have fewer display ads than the competition.<br>2. Build out the Hepper.com e-commerce experience: revamping checkout pages, category pages, product listings, and making sure that data analytics on Hepper is properly configured.<br>3. Clearing the big backlog of tasks that has piled up over the last couple of months. We are behind, and we have lots to do, so it’s important that you hit the ground running!</div><div>4. In this role, you would over the next 3-4 months hire 1-2 developers in your department. So, it’s crucial that you’re excited about managing, inspiring, and doing code reviews with other developers too.<br><br>\n</div><div>\n<strong>You will be responsible for<br>- </strong>Making the webdev department kickass: catching up with the backlog of tasks, and being an amazing communicator.</div><div>- After 3-4 hiring months: hiring 1-2 web developers who will work under you. It’s therefore important you are excited about hiring, managing, and doing code reviews with developers. We can help teach you the skills to hire and manage developers, though, you must be excited about this for this to work.<br>- Developing new tools and software that help millions of pet lovers every month (could for example be to develop a Puppy Weight Chart Tool / Calculator that helps pet owners predict how fast, and how big their dog will grow)</div><div>- Developing, testing, and maintaining new features and solutions for our WordPress sites for desktop and mobile browsers that are optimized for high traffic.<br>- Create, review, and update technical documentation such as contributing to our development processes, QA procedures, and technical planning</div><div>- Communicating and supporting our content and marketing departments with dev/IT requests, troubleshooting, fixing bugs<br>- Performing scheduled and non-scheduled maintenance and security updates on our WordPress sites</div><div>- Always proactively being on top of things and securing and protecting our WordPress sites from hackers and malware, as well as eliminating risks<br>- Be informed of relevant new technology and best practices<br><br>\n</div><div><strong>You are expected to have:</strong></div><ul>\n<li>Experience with HTML, CSS, JavaScript/jQuery, and PHP</li>\n<li>Experience with MySQL and managing databases</li>\n<li>Experience with WordPress development (e.g. themes, hooks, filters, plugin API, etc)</li>\n<li>Experience with build tools like Webpack or ViteJS</li>\n<li>Experience with Composer and a basic understanding of autoloading, dependency management, and dependency injection</li>\n<li>Experience with SSH and comfortable with basic terminal usage</li>\n<li>Experience with Git (and GitHub)</li>\n<li>Troubleshooting abilities (ie include finding CSS and JavaScript conflicts using browser developer tools, navigating codebases in theme and plugins, and determining whether a plugin or theme code could be causing a code conflict)</li>\n<li>The ability to take a project on your own and get it done before the deadline</li>\n<li>Strong communication skills. This is a MUST as we work remotely. (most of our communication is written in Slack with occasional calls)</li>\n</ul><div><br></div><div>\n<strong>The Type of Person We Would Love For This Role<br></strong><br>\n</div><div>—&gt; You are a dependable, friendly communicator</div><div>—&gt; You’re passionate about solving problems with smart and elegant programming solutions. Your code is clean, understandable, and well-commented</div><div>—&gt; You’re a self-starter who loves taking initiative and seeing things through to completion.</div><div>—&gt; You have the curiosity and desire to learn and grow your skills and discover new modern practices and follow the latest trends in WordPress</div><div>—&gt; You’re able to juggle around and work on different projects and side tasks on a weekly basis. While we wish we could focus on one thing for weeks at a time to make it perfect, that’s often not the reality in a competitive market.<br><br>\n</div><div><strong>Benefits/Perks when working at Pangolia</strong></div><div>🌏 Work from anywhere (we’re 100% remote)</div><div>💡 Work with a hard-working, talented team of kickass people</div><div>🕑 Flexible work hours, you get to plan your own schedule and work whenever you want</div><div>🌴 Company retreats! (we just did a company retreat in Phuket, Thailand!)</div><div>💰 Your payment is paid biweekly (You’re paid every two weeks)</div><div>\n<strong>💻</strong> We encourage you to find a working environment that suits your needs the best if working from home every single day isn’t for you. (We’ll cover monthly membership and/or day passes for co-working spaces.)<br>⛱️ 21 days of paid time off every year</div><div>🤝 Your work with a great, talented team that produces a high-growth work environment (we move fast)</div><div>📈 Opportunity to move up in the company, and earn higher pay and bonuses<br><br>\n</div><div><strong>Some things to know about our workflow</strong></div><ul>\n<li>Every Monday, we have a one-on-one Zoom meeting to discuss our goals, whether you are meeting your goals, what went well, what did not go well, and so on.</li>\n<li>You would work directly with the CEO, Simon, who trusts you with your responsibility areas and empowers you to come up with and for you to find the solutions. In other words: this role has a lot of freedom for you to work in the way that you think is best for the company. Simon and the team do not micromanage and have no interest in doing so.</li>\n<li>You’re also responsible for maintaining the Github repository of the project you’re working on, committing/pushing/documenting your changes, commenting on your code, and writing SOPs or technical documentation (if necessary). It doesn’t have to be pages long and can be very short and concise. But, as a developer, it makes life so much easier if you can return to your code in the future without having to think too hard about what you did. This is also about being considerate of your teammates' time.</li>\n<li>There must be some overlap in our working hours so you can respond to urgent requests (if any) or chat with your manager or any of our departments on demand if they have an IT question. This means that some extra tasks may arise during the week.</li>\n<li>You might have a day where one of our team members needs something urgent and needs it done the same or the next day, which can be valuable to the company, or a major issue needs to be fixed ASAP, in which case you might have to drop what you're working on and work on that. If your main project's deadline cannot be met because of this (which is understandable), you should be able to communicate this on time.</li>\n<li>However, most of the time you are able to work on your main projects in solitary. We understand that developers need complete focus. You can also chat and ask questions in our Slack channels.</li>\n</ul><div><strong>The team (and our work culture)</strong></div><div>You’ll get to be part of a 100% remote company consisting of a diverse group of 80 talented individuals from all over the world. The people you will find on the team are veterinarians, marketers, content writers, editors, social media managers, graphics designers, content managers, and a lot more.<br><br>\n</div><div>And you’ll get to join us on our united mission of improving the lives of pets and those who care for them. We dream big, and our mission is to become the biggest, most helpful pet company in the world.<br><br>\n</div><div>You’ll get to be part of a company that’s undergoing hyper-growth, and the fast-paced work environment that comes with it.<br><br>\n</div><div>And we’ve managed to grow at a healthy pace without ever sacrificing our culture and values.<br><br>\n</div><div>Our company culture is focused on work and collaboration, but also being open to the casual humor and chatter that makes us get to know each other.<br><br>\n</div><div>We value the freedom of being able to work from anywhere, trust, and collaboration.</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/pangolia-lead-wordpress-developer-for-fast-growing-pet-company-remote-worldwide\">https://weworkremotely.com/remote-jobs/pangolia-lead-wordpress-developer-for-fast-growing-pet-company-remote-worldwide</a></p>\n", "Publication Date": "Fri, 01 Dec 2023 06:38:24 +0000", "Link": "https://weworkremotely.com/remote-jobs/pangolia-lead-wordpress-developer-for-fast-growing-pet-company-remote-worldwide", "Expiry Date": "Sun, 31 Dec 2023 06:38:24 +0000"}, {"Region": "Anywhere in the World", "Title": "Secure Privacy: Senior Full-Stack Developer (.NET / Angular / MongoDB)", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0064/2896/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Europe (DK)\n    <br /><strong>URL:</strong> <a href=\"https://secureprivacy.ai\">https://secureprivacy.ai</a>\n</p>\n\n<div>Secure Privacy is expanding its team with a passionate and analytical full-stack developer to enhance our product portfolio. Our tech stack includes C# (.NET Core) for back-end, ServiceStack for APIs, Angular for front-end, MongoDB for database, and Azure for infrastructure and DevOps.<br><br>\n</div><div>Ideal candidates will possess:</div><ul>\n<li>Strong experience in C# and writing APIs using .NET Core (ServiceStack familiarity is a plus).</li>\n<li>Extensive experience with Angular and JavaScript.</li>\n<li>Proficiency in MongoDB and its C# driver, especially in advanced functionalities like aggregation pipelines, indexes, transactions, etc.</li>\n<li>Solid git experience.</li>\n<li>Understanding of optimizing and scaling solutions for hundreds of millions of weekly API calls.</li>\n<li>Attention to security and best practices for a secure, scalable application.</li>\n<li>Analytical prowess and proactive mindset.</li>\n<li>A friendly and collaborative attitude.</li>\n</ul><div>Learn more about us at <a href=\"https://secureprivacy.ai/\">https://secureprivacy.ai</a>.</div><div>\n<br>Interested? Reach out to us. We look forward to hearing from you!</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/secure-privacy-senior-full-stack-developer-net-angular-mongodb\">https://weworkremotely.com/remote-jobs/secure-privacy-senior-full-stack-developer-net-angular-mongodb</a></p>\n", "Publication Date": "Thu, 30 Nov 2023 11:44:38 +0000", "Link": "https://weworkremotely.com/remote-jobs/secure-privacy-senior-full-stack-developer-net-angular-mongodb", "Expiry Date": "Sat, 30 Dec 2023 11:44:38 +0000"}, {"Region": "Anywhere in the World", "Title": "Seeq: Principal Software Engineer, General Staff", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7423/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Seattle, WA\n    <br /><strong>URL:</strong> <a href=\"https://www.seeq.com/\">https://www.seeq.com/</a>\n</p>\n\n<div><strong>Introduction</strong></div><div>Seeq makes <a href=\"https://www.seeq.com/product/overview\">data analytics software</a> for a big market that’s often overlooked by tech companies: industrial process data. Think pharmaceutical manufacturers, wind farms, and energy companies with tons of equipment and sensors. Our software engineers tackle hard problems in streaming calculations, storage and distributed computing, and we create elegant data visualizations with smooth interactivity.<br><br>\n</div><div>Our company is 100% remote <a href=\"https://www.linkedin.com/pulse/stay-at-home-team-mark-derbecker/\">and proud of it</a>. We use a variety of collaboration tools, like Zoom, Slack, and our homegrown <a href=\"https://qube.work/\">Qube Virtual Office</a>, which makes us feel like we're in the same building together. We use agile tenets to iterate on both our product and development processes. We have a wonderful team of kind-hearted, talented engineers that love to collaborate, teach each other new tricks, and build products that exceed our customers’ expectations.<br><br>\n</div><div>Our technology stack is largely JVM languages (Java, Kotlin) on the backend, and TypeScript + React on the frontend, but we also have a growing ecosystem of languages and frameworks we use for Machine Learning, Generative AI, and DevOps (Python, Terraform). The core of our product is a full-featured calculation engine that can perform complex math and execute machine learning algorithms on streaming time series data. The Seeq platform is enhanced by Python libraries and Jupyter notebooks to enable extensibility and data science workflows. Seeq SaaS (software-as-a-service) runs this functionality on a cloud-native infrastructure layer built in Kubernetes.</div><div>\n<br><strong>Skills &amp; Requirements</strong><br>You love to design and build great software. Elegant, extensible, and maintainable architecture brings you joy.<br><br>\n</div><div>You are typically one of the most highly productive engineers in your company or team. You are constantly finding ways to perfect your craft, be a better teammate, and come up with cool stuff. You recognize when something needs to be improved and don’t wait for it to be pointed out. You have a consistent record of shipping products or features rapidly, demonstrating proficiency in a continuous delivery model. You are eager to pair-program with colleagues, can review others' code quickly and make the entire team faster with your teaching and guidance.<br><br>\n</div><div>You are typically among the most product- and user-focused engineers in your company or team. You seek out regular customer interactions, you can articulate the “why” behind features and use cases, you explain pain points to your fellow engineers. You are equally energized by working on large projects and by fixing the little things that annoy users.<br><br>\n</div><div>You’re disciplined with a high attention to detail. You evangelize unit testing, continuous integration, and elegant solutions. You are allergic to bugs and have to take care of them immediately. You delight in burning technical debt when you refactor code.<br><br>\n</div><div>You’re flexible, versatile, reliable, and learn quickly. You regularly bring new technologies and methodologies to the team and cultivate a high degree of influence as a technological thought leader, while giving your teammates the respect they deserve. You meet deadlines through wise planning, prioritizing, and accurate estimates, proactively communicating adjustments that need to be made well in advance. You typically mentor 2 or more colleagues on technical skill at any one time.<br><br>\n</div><div>You proactively solicit feedback and are candid about communicating your own growth opportunities with your manager(s) and colleagues. You provide constructive feedback to teammates and respect their autonomy.<br><br>\n</div><div>You are comfortable working across the tech stack. You are proficient in a JVM language (Kotlin, Java, Scala, etc.) or Python for backend functionality. You want to work with databases (Postgres), distributed computing (Kubernetes) and cloud platforms (AWS, Azure). When you work on the front-end, you want to build beautiful pages for our Typescript + React application. You are an expert in at least one of these technologies. You're interested in finding the best tool to solve a problem without getting caught up in whether it's the new hip thing.<br><br>\n</div><div>You are self-aware and want to have an impact that extends beyond your individual technical contributions. You see the big picture and work across boundaries seamlessly, focusing on outcomes and doing what’s right for the product and users.<br><br>\n</div><div>You have a Bachelor’s degree in Computer Science or equivalent relevant experience plus years of experience as a Staff or Principal software development engineer. You have led successful, large multi-developer efforts and enjoy helping others learn and attain their goals.<br><br>\n</div><div>You are up for traveling occasionally to hang out with your colleagues and get some face-to-face time.<br><br>\n</div><div>You want to be in a position at a company where a balance between work and life is possible.<br><br>\n</div><div>You want to work with a diverse group of really smart people that love working together. And you want to work for a startup with lots of happy customers, good investors and a bright future.<br><br>\n</div><div>You will answer the following question in your application cover letter: “What makes Seeq a good fit for you?”<br><br><strong>The Perks of Working at Seeq</strong>\n</div><ul>\n<li>Many communities around the US are incentivizing remote workers. Seeq's work from anywhere (WFA) policy may enable you to take advantage of these programs. <br><br>\n</li>\n<li>Important benefits like this (because we want you to be happy):<br><br><ul>\n<li>Freedom PTO<br><br>\n</li>\n<li>Internet and mobile phone reimbursement<br><br>\n</li>\n<li>Home office allowance for equipment needed to work efficiently<br><br>\n</li>\n<li>The best co-workers (we've analyzed the data, so we know it's true)<br><br>\n</li>\n<li>Pet-friendly workspace (your animals will be so happy to have you home)<br><br>\n</li>\n<li>Loving your job!</li>\n</ul>\n</li>\n</ul><div><br></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/seeq-principal-software-engineer-general-staff\">https://weworkremotely.com/remote-jobs/seeq-principal-software-engineer-general-staff</a></p>\n", "Publication Date": "Wed, 29 Nov 2023 14:35:23 +0000", "Link": "https://weworkremotely.com/remote-jobs/seeq-principal-software-engineer-general-staff", "Expiry Date": "Fri, 29 Dec 2023 14:35:23 +0000"}, {"Region": "Anywhere in the World", "Title": "IFE GmbH: Vertrieb ERP Software Odoo Remote bundesweit oder Büro Hannover (w/m/d)", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Germany Hanover\n</p>\n\n<p>Wir sind zertifizierter Gold Partner der ERP Software Odoo. Odoo ist mit 10 Millionen Anwendern das weltweit am meisten verbreitetste ERP Programm. Odoo deckt alle Prozesse eines Unternehmens in einer einzigen modernen Lösung ab. Mit 83 Hauptmodulen und 43.000 Zusatzmodulen bietet Odoo die größte ERP Modulbibliothek der Welt.   </p>\n<p>Wir sind der Odoo Partner mit den meisten Kunden in Deutschland und gehören weltweit zu den Top 10 Partnern. Wir betreuen Unternehmen aller Größen vom Startup bis zu Konzernen wie METRO (neuester METRO Markt komplett mit Odoo).   </p>\n<p>Mit einem Team von 80 Personen in Hannover, Hamburg, Berlin, Frankfurt, Köln, Nürnberg, Bielefeld, Kiel, Lübeck, Oldenburg, Walsrode, Wien, Georgien, Indien, Marokko und Vietnam betreuen wir unsere Kunden von der Anforderungsanalyse bis hin zu individuellen Programmierungen.</p>\n<h2>Aufgaben</h2>\n<ul>\n<li>Du überzeugst potenzielle Neukunden von unserem gesamten Lösungsportfolio: Odoo ERP Software,  Consulting, Wartung, Hosting</li>\n<li>Du führst Ferndemos/Webinare zur Vorstellung von Odoo durch (anschließende Workshops werden von Consultants durchgeführt)</li>\n<li>Du bearbeitest Anforderungslisten/Pflichtenhefte und erstellst Angebote</li>\n<li>Mit dem Odoo CRM Modul führst Du deine Aktivitäten zum Erfolg und übergibst gewonnene Projekte an unsere Consultants</li>\n</ul>\n<h2>Qualifikation</h2>\n<ul>\n<li>Berufserfahrung im Vertrieb von ERP Systemen idealerweise von Odoo</li>\n<li>Lösungsorientierte sowie eigenverantwortliche, selbstständige Arbeitsweise</li>\n<li>Analytisches Denkvermögen und Eigeninitiative sowie - sicheres Auftreten und ein hohes Maß an Teamorientierung</li>\n<li>Hervorragende Organisations- und Kommunikationsfähigkeiten</li>\n<li>betriebswirtschaftliches Know-How</li>\n<li>hohe IT-Affinität</li>\n<li>Ausgeprägte Dienstleistungsmentalität</li>\n<li>sehr gute Deutsch- sowie gute Englischkenntnisse</li>\n<li>Reisebereitschaft (0 - 10%)</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>Abwechslungsreiche und anspruchsvolle Tätigkeit</li>\n<li>attraktive Vergütung mit Erfolgsbeteiligung</li>\n<li>Wahlweise Home Office deutschlandweit oder Büro Hannover</li>\n<li>Arbeit in einem modernen, innovativen, dynamischen und kooperativen Arbeitsumfeld</li>\n<li>Intensive Einarbeitung ins ERP System Odoo, Kennenlernen von modernsten IT Technologien</li>\n<li>Weiterentwicklung durch systematische Fortbildungen und Know-How-Austausch</li>\n<li>Internationaler Wissens- und Erfahrungsaustausch durch globales Netzwerk</li>\n<li>flache Hierarchien in einem sympathischen Team- ein vielfältiges Arbeitsumfeld, in dem Du dich entfalten kannst</li>\n<li>Kontakt mit interessanten Persönlichkeiten wie CEOs, CFOs und CTOs von diversen Unternehmen</li>\n<li>ein riesiger Anwendungsbereich; von CRM, Lager, HR, Projektmanagement, eCommerce, Buchhaltung</li>\n<li>Kennenlernen von Unternehmen jeglicher Größe und Herkunft aus einer breiten Auswahl von Branchen</li>\n<li>eine offene Du-Kultur mit tollen Kollegen</li>\n<li>Teamspirit &amp; Teamevents</li>\n<li>Bahncard 1. Klasse </li>\n<li>Unbefristeter Arbeitsvertrag</li>\n</ul>\n\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/ife-gmbh-vertrieb-erp-software-odoo-remote-bundesweit-oder-buro-hannover-w-m-d\">https://weworkremotely.com/remote-jobs/ife-gmbh-vertrieb-erp-software-odoo-remote-bundesweit-oder-buro-hannover-w-m-d</a></p>\n", "Publication Date": "Mon, 27 Nov 2023 08:31:27 +0000", "Link": "https://weworkremotely.com/remote-jobs/ife-gmbh-vertrieb-erp-software-odoo-remote-bundesweit-oder-buro-hannover-w-m-d", "Expiry Date": "Wed, 27 Dec 2023 08:31:27 +0000"}, {"Region": "Anywhere in the World", "Title": "IFE GmbH: Odoo ERP Berater/Consultant/Projektleiter Home Office oder Büro auch Quereinsteiger/Keyuser (m/w/d)", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Germany Hanover\n</p>\n\n<p>Odoo ist mit 11 Millionen Anwendern das weltweit am meisten verbreiteste ERP Programm. Odoo deckt alle Prozesse eines Unternehmens in einer einzigen modernen Lösung ab. Mit 83 Hauptmodulen und 43.000 Zusatzmodulen bietet Odoo die größte Modulbibliothek der Welt.  </p>\n<p>Wir sind der Odoo Partner mit den meisten Kunden in Deutschland und weltweit gehören wir zu den TOP 10 von 5.000 Partnern. Wir betreuen Unternehmen aller Größen vom Startup bis zu Konzernen wie METRO (kompletter Standort mit Odoo). Unsere Consultants betreuen Kunden von der Anforderungsanalyse bis zum Live Betrieb.</p>\n<p><strong>Wir bieten:</strong></p>\n<ul>\n<li>Abwechslungsreiche und anspruchsvolle Beratungs- und Projektmanagementaufgaben</li>\n<li>Flache Hierarchien in einem sympathischen Team</li>\n<li>attraktive Vergütung mit hoher Erfolgsbeteiligung</li>\n<li>wahlweise Homeoffice bundesweit oder Büro</li>\n<li>Moderne Büroausstattung mit höhenverstellbaren Schreibtischen</li>\n<li>Standort in Hannover Podbielskistr. 269 direkt an der U-Bahn Station Klingerstrasse</li>\n<li>Bahncard 1. Klasse</li>\n</ul>\n<h2>Aufgaben</h2>\n<ul>\n<li>Du beräts und unterstützt Kunden bei der Einführung der ERP-Lösung Odoo </li>\n<li>Anforderungsanalyse, Lösungskonzeption, Implementierung, Test, Einführung und Rollout </li>\n<li>Customizing der Module, Berichte, Bildschirmmasken und Workflows</li>\n<li>Vorbereitung und Durchführung von Workshops/Präsentationen</li>\n<li>Schnittstellenfunktion zur Softwareentwicklung</li>\n<li>Koordination und Leitung von Projekten</li>\n<li>Projektdokumentation und Archivierung</li>\n<li>Pflege der Kundenkontakte</li>\n</ul>\n<h2>Qualifikation</h2>\n<ul>\n<li>Studium oder Berufserfahrung im ERP Bereich (auch als Anwender/in, z.B. Key User möglich)</li>\n<li>Erfahrung in der Projektarbeit mit ERP Systemen idealerweise mit Odoo</li>\n<li>Gute Kenntnisse betriebswirtschaftlicher Prozesse</li>\n<li>lösungsorientierte und selbstständige Arbeitsweise</li>\n<li>Analytisches Denkvermögen, sicheres Auftreten und ein hohes Maß an Teamorientierung</li>\n<li>Organisations- und Kommunikationsfähigkeiten</li>\n<li>IT-Affinität</li>\n<li>Ausgeprägte Dienstleistungsmentalität </li>\n<li>Reisebereitschaft (0 - 10%)</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>ein vielfältiges Arbeitsumfeld, in dem Du dich entfalten kannst</li>\n<li>Kontakt mit interessanten Persönlichkeiten wie CEOs, CFOs und CTOs von diversen Unternehmen</li>\n<li>ein riesiger Anwendungsbereich; von CRM, Lager, HR, Projektmanagement, eCommerce, Buchhaltung</li>\n<li>Kennenlernen von Unternehmen jeglicher Größe und Herkunft aus einer breiten Auswahl von Branchen</li>\n<li>eine offene Du-Kultur mit tollen Kollegen</li>\n<li>Teamspirit &amp; Teamevents</li>\n<li>Unbefristeter Arbeitsvertrag</li>\n</ul>\n\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/ife-gmbh-odoo-erp-berater-consultant-projektleiter-home-office-oder-buro-auch-quereinsteiger-keyuser-m-w-d\">https://weworkremotely.com/remote-jobs/ife-gmbh-odoo-erp-berater-consultant-projektleiter-home-office-oder-buro-auch-quereinsteiger-keyuser-m-w-d</a></p>\n", "Publication Date": "Mon, 27 Nov 2023 08:31:26 +0000", "Link": "https://weworkremotely.com/remote-jobs/ife-gmbh-odoo-erp-berater-consultant-projektleiter-home-office-oder-buro-auch-quereinsteiger-keyuser-m-w-d", "Expiry Date": "Wed, 27 Dec 2023 08:31:26 +0000"}, {"Region": "Anywhere in the World", "Title": "Wordwall: Senior Full-Stack .NET developer", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0071/4993/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> United Kingdom\n    <br /><strong>URL:</strong> <a href=\"https://wordwall.net\">https://wordwall.net</a>\n</p>\n\n<div>We're looking for a senior developer who excels in working full-stack, but can bring their distinctive skills to our team, whether that's someone who loves writing tests or has a flair for game design. Whatever you do, we need you to have top-notch JScript and C# skills.<br><br>Our mission is to make it easy for teachers to create interactive games and worksheets for their students. Our site automates the process of resource design, so teachers can simply enter the content that is appropriate for their class – a list of keywords, definitions, questions or images. Wordwall produces the content in over 60 different templates; for example, gameshow quizzes, crosswords, labelled diagrams and arcade games. It seeks to disrupt the publisher-driven model of paid-for “professionally” made educational content by putting high-quality content creation in the hands of teachers and making that teacher-made content freely accessible through our online community.<br><br>We are a small team with big ambitions who work remotely across the world. Our 35 million monthly users are rapidly proliferating. We’ve got a product that works and we’re building for the long-term. We want people who want to stick around, grow with us and help make games-based learning accessible to all.<br><br>Technologies we use: HTML5, CSS, Javascript, C#, Canvas API, WebAudio API, ASP.NET MVC, MS-SQL, Azure, Selenium, TeamCity CD<br><br>We are an equal opportunities employer. We support flexible working arrangements - full or part time.<br><br>Real applicants only - please do not contact us if you represent an agency.<br><br>Requirements<br><strong>• </strong>Excellent C# &amp; Javascript skills<br><strong>• </strong>Minimum 3 years' experience working within a software development team<br><strong>• </strong>Able to self-organise and motivate when working remotely<br><br>Benefits<br><strong>• </strong>Salary £45-55k per year<br><strong>• </strong>30 days holiday per year<br><strong>•</strong>100% remote &amp; flexible working #LI-Remote</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/wordwall-senior-full-stack-net-developer-7\">https://weworkremotely.com/remote-jobs/wordwall-senior-full-stack-net-developer-7</a></p>\n", "Publication Date": "Thu, 23 Nov 2023 22:06:22 +0000", "Link": "https://weworkremotely.com/remote-jobs/wordwall-senior-full-stack-net-developer-7", "Expiry Date": "Sat, 23 Dec 2023 22:06:22 +0000"}, {"Region": "Anywhere in the World", "Title": "Fibbl: Fullstack Engineer", "Category": "Full-Stack Programming", "Type": "Contract", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7346/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Stockholm\n    <br /><strong>URL:</strong> <a href=\"http://fibbl.com\">http://fibbl.com</a>\n</p>\n\n<div>Fibbl is a Swedish startup that creates augmented reality experiences for e-commerce.</div><div> </div><div>We handle all the steps: </div><div><br></div><ol>\n<li> Photogrammetry - Scanning of real products.</li>\n<li> Production of 3D models from photos.</li>\n<li> 3D model optimizations (if needed).</li>\n<li> Storage and distribution of 3D content and metadata. </li>\n<li> 3D/AR/VTO experience display on client's websites via special Fibbl components. </li>\n</ol><div><br></div><div>Besides 3D models, Fibbl also provides Augmented reality (AR), Virtual Try-on (VTO), images and videos. </div><div>You can read more on our website <a href=\"https://fibbl.com\">https://fibbl.com</a>\n</div><div><br></div><div>We strive to automate all the processes and make it as easy as possible for our clients to add 3D, AR and VTO to their websites. This goal requires quite a lot of work - both on the backend and frontend. So we are looking for an experienced full-stack developer. </div><div>\n<br><br>\n</div><div><strong>Who can apply</strong></div><div><br></div><div>This is a completely remote position. We are ready to work with anyone from any country, if:</div><div><br></div><ol>\n<li> You are able to be online within about 6 hours on workdays from 9 am to 6 pm Stockholm time (CET). </li>\n<li> You can receive payments from Sweden (SWIFT payments in EUR are preferred). </li>\n</ol><div>\n<br><br>\n</div><div><strong>What skills are required</strong></div><div><br></div><ol>\n<li> Good spoken English - we are an international team, not native speakers, but we should be able to understand each other easily. </li>\n<li> 5+ years of experience in software development. </li>\n<li> Good knowledge and experience with React+Redux, JS &amp; TS, Node.js. </li>\n<li> An ability to solve different and unique tasks.</li>\n<li> Flexibility and sharpness of mind. </li>\n</ol><div>\n<br><br>\n</div><div><strong>What skills are good to have</strong></div><div>\n<br><br>\n</div><ol>\n<li> AWS (serverless solutions) - we use it for all our infrastructure. </li>\n<li> SQL &amp; NoSQL databases - currently we are using DynamoDB, but we may switch to PostgreSQL in the future. </li>\n<li> Three.js, WebGL, maths, experience in computer graphics - we are using Three.js to render 3D models. From time to time we need to improve/adjust it to meet our clients' requirements. These tasks are rare, but if you are familiar with computer graphics, it will be a plus.</li>\n</ol><div>\n<br><br>\n</div><div><strong>What we offer</strong></div><div><br></div><ol>\n<li> From 20 to 45 EUR per hour (and even more for really skilled candidates). When you work - you are paid, when you don’t - you are not. It’s a full-time position, so we would expect you to work 40 hours a week. </li>\n<li> Flexible work hours - you can decide yourself when you work, but you should participate in meetings and be online at the same time with other team members for several hours a day. </li>\n<li> A possibility to be creative and work on non standard tasks, make architectural decisions, learn new technologies and approaches.</li>\n<li> We are a small international  team - only 3 developers + CTO. So each developer is important. </li>\n</ol><div>\n<br><br>\n</div><div><strong>Additional notes</strong></div><div><br></div><div>If you are a person who can learn new things and grow professionally without much help from others, if you are smart, not afraid of challenges, and ready to work on new non-standard tasks, then this job can be rather beneficial for you. </div><div><br></div><div>If you are looking for a calm job, where you can work on well-defined tasks and forget about them once they are finished, then it’s better not to apply. At Fibbl all developers have to understand and care about the company’s aim and our clients’ needs.</div><div><br></div><div>Fibbl is a startup, its goals are changing, and the future isn’t secured. We are not working overtime (if you thought about that), but our inner processes are constantly evolving, so there is certain instability and uncertainty. It’s an opportunity to get much valuable experience that is quite difficult to acquire in big teams and big companies, but it’s not for everyone. </div><div>\n<br><br>\n</div><div><strong>How to apply</strong></div><div><br></div><div>Send an email to <a href=\"mailto:fullstack-job@fibbl.com\">fullstack-job@fibbl.com</a> with the following information (preferably as an ordered list): </div><div><br></div><ol>\n<li> Your name.</li>\n<li> Your age. </li>\n<li> Total experience in years.</li>\n<li> Your country and timezone. </li>\n<li> Your desired salary in EUR per hour, e.g. 25 eur. </li>\n<li> Your strongest side as a developer, e.g. “I’m a generalist and have worked with 100500 different technologies” or “I’m smart and quite good at solving complex problems / non-standard tasks”. </li>\n<li> Anything you want to add + your resume/CV. You can attach it to the email or add a link.</li>\n</ol><div><br></div><div>Use “Job Application” as an email subject, if you are sending a resume. Or “Question”, if you just want to ask something. </div><div><br></div><div>Start your email with the phrase \"A white bear is eating a fish\" - it will prove that you have read this job description.</div><div><br></div><div>We will try to reply to everyone, but if there are too many applications we may not have enough time for that. If you get no reply within 2 weeks, it means your application has been rejected. </div><div><br></div><div>Also, we promise to delete your resume and the personal data you provide in your application (the email itself) within 60 days after we receive it. We don't share it with anyone else.</div><div><br></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/fibbl-fullstack-engineer\">https://weworkremotely.com/remote-jobs/fibbl-fullstack-engineer</a></p>\n", "Publication Date": "Thu, 23 Nov 2023 15:24:41 +0000", "Link": "https://weworkremotely.com/remote-jobs/fibbl-fullstack-engineer", "Expiry Date": "Sat, 23 Dec 2023 15:24:41 +0000"}, {"Region": "Anywhere in the World", "Title": "BBE Marketing Inc: Full-Stack Wordpress Developer", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Hurst, TX\n    <br /><strong>URL:</strong> <a href=\"http://bbemarketing.com/\">http://bbemarketing.com/</a>\n</p>\n\n<div>BBE Marketing creates online products that help businesses connect with celebrities and influencers. We are looking for a talented Full-Stack Wordpress Developer to join our team, who could help us in shipping features for our application and drive our application design and architecture as we grow.<br><br>\n</div><div>The tasks include:<br><br>\n</div><div>- Developing plugins<br>- Making fixes and updates to existing plugins<br>- Work with team in planning and strategizing<br>- Working with designer in developing designs<br>- Various backend tasks<br><br>\n</div><div>You will love this role if:<br><br>\n</div><div>- You like working with the stakeholders directly. We’re a relatively small startup, there’s no bureaucracy and complex hierarchy. You’ll be communicating directly with all the team members, from CEO to Customer Support.<br>- You like to work and ship stuff fast without compromising quality. You know when to stop and call it done without trying to achieve the unattainable perfection.<br>- You’re not afraid to prove your point when necessary. We trust our team members and believe they have businesses best interest at heart. If there’s no simple solution to a problem, you can provide the arguments and clearly communicate the risks.<br>- Self-starter, we don’t like to micro-manage our team<br>- You treat privileged information with care. You can be trusted with sensitive company data<br>- Great communication skills<br><br>\n</div><div>Requirements:<br>- Experience with PHP<br>- Experience with Wordpress<br>- Experience with MySQL;<br>- Experience with Asana (preferred)<br>- Written and spoken English (required).<br>- Able to work 4 hours overlap within 07:00 - 18:00 PST<br><br>\n</div><div>\n<br><br>\n</div><div>\n<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/bbe-marketing-inc-full-stack-wordpress-developer-7\">https://weworkremotely.com/remote-jobs/bbe-marketing-inc-full-stack-wordpress-developer-7</a></p>\n", "Publication Date": "Thu, 23 Nov 2023 14:47:51 +0000", "Link": "https://weworkremotely.com/remote-jobs/bbe-marketing-inc-full-stack-wordpress-developer-7", "Expiry Date": "Sat, 23 Dec 2023 14:47:51 +0000"}, {"Region": "Anywhere in the World", "Title": "Hennessey Digital: Wordpress Developer", "Category": "Full-Stack Programming", "Type": "Contract", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0126/5398/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> California\n    <br /><strong>URL:</strong> <a href=\"http://hennessey.com\">http://hennessey.com</a>\n</p>\n\n<div><strong>What are we looking for?</strong></div><div>We’re looking for a Software Engineer I that has experience designing <strong>custom themes on WordPress,</strong> with Full-Stack development proficiency. Someone who is a thoughtful team member who can ensure that all projects are delivered on time, on budget, and on strategy.</div><div><br></div><div><strong>What will you do?</strong></div><ul>\n<li>Develop applications and websites (coding, programming)</li>\n<li>Document and test new software applications</li>\n<li>Utilize <strong>custom theme Wordpress</strong> development</li>\n<li>Assess new application ideas</li>\n</ul><div><br></div><div><strong>What do we require?</strong></div><ul>\n<li>Must have created at least 3 websites and be able to provide samples and/or a link to a GitHub portfolio</li>\n<li>Experience building websites with <strong>CSS, JavaScript and PHP</strong> in Wordpress or another similar CMS</li>\n<li>Full-Stack Experience (front-end and back-end development)</li>\n<li>Proficient understanding of code versioning tools such as Git, Bitbucket</li>\n<li>Experience programming in different languages such as HTML, CSS, SCSS, JS, PHP</li>\n<li>Comfortable with scoping features and delivering the feature according to the agreed deadline with the project manager</li>\n<li>Comfortable working with debugging tools like Firebug, Chrome inspector, etc.</li>\n<li>Experience in marketing, forum posting, link building and SEO is a plus</li>\n<li>Fluent in English</li>\n<li>Ability to work in teams</li>\n</ul><div><br></div><div><strong>Do you need to know anything else? </strong></div><ul>\n<li>This is a 40 hour per week contract position, paid biweekly</li>\n<li>Core business hours are 9 am - 2 pm Pacific Standard Time</li>\n</ul><div>\n<br><br>\n</div><div><strong>Interested in being our next Wordpress Developer? We’d love to hear from you! Please apply with your CV, 3 links to websites you’ve created (or a link to a portfolio), and the answers to the following questions. </strong></div><div>\n<br><br>\n</div><div>1. What are your salary expectations per month (in USD)? </div><div>2. Our required core business hours are 9 am to 2 pm Pacific Standard Time, with a full work day being 8 hours. Are you okay working those hours?</div><div>3. Do you have experience in both Front End and Back End development?</div><div>4. What coding languages do you have experience with?</div><div>5. Do you have experience with custom theme Wordpress?</div><div><br></div><div>Click to apply, or send your application to <a href=\"mailto:peoplesuccess@hennessey.com\">peoplesuccess@hennessey.com</a>.</div><div><br></div><div><br></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/hennessey-digital-wordpress-developer\">https://weworkremotely.com/remote-jobs/hennessey-digital-wordpress-developer</a></p>\n", "Publication Date": "Mon, 20 Nov 2023 16:05:49 +0000", "Link": "https://weworkremotely.com/remote-jobs/hennessey-digital-wordpress-developer", "Expiry Date": "Wed, 20 Dec 2023 16:05:49 +0000"}, {"Region": "Anywhere in the World", "Title": "Booster SEO: Senior Ruby on Rails Engineer", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0082/0572/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Dublin, Remote\n    <br /><strong>URL:</strong> <a href=\"https://www.boosterseo.com\">https://www.boosterseo.com</a>\n</p>\n\n<h1>Stuart here, founder of Booster SEO</h1><div>Are you a full stack Rubyist with 6+ years experience? Interested in working on the bleeding edge of what Rails has to offer when it comes to new features and developments (Rails 7 &amp; Hotwire)?<br><br>Have you previously worked with another Shopify app?<br><br>If so, awesome! Keep reading. If not - no worries, perhaps we'll cross paths in the future.<br><br>\n</div><h1>About the job</h1><div>With the help of our small team, (and some awesome team members at Thoughtbot), we've built an amazing Shopify SEO platform on Rails that has scaled wonderfully so far. To give a small indication, we process roughly 20-30M Sidekiq Jobs per day and are adding 8-10M db rows per day.<br><br>\n</div><h1>How are we different?</h1><div>We might lose you here :)<br><br>\n</div><ul>\n<li>\n<a href=\"https://gist.github.com/stuartchaney/e7e7b86f6338ebd7f969e55dafe5080a\">We believe in writing Rails in a particular style</a>, sticking close to standard and general Rails best practices. </li>\n<li>If a feature takes our competitors 8 weeks to build, we build a solid MVP in 8-10 days. We utilize the 80/20 principle to focus on what matters and just ship. Of course, we look at the usage metrics, then come back and complete the other 20% over time.</li>\n</ul><div>If this sounds like your style, we'd love to chat.<br><br>\n</div><h1>What will you be responsible for?</h1><ul>\n<li>Development of our Ruby on Rails monolith.</li>\n<li>Write high-quality, clean, and scalable code following best practices and design patterns</li>\n<li>Write and maintain unit tests, integration tests, and end-to-end tests to ensure the reliability of the application</li>\n<li>Perform debugging and troubleshooting to identify and fix issues promptly</li>\n<li>Collaborate with teams to ensure smooth deployment and continuous integration processes and participate in configuring and maintaining the deployment pipeline and monitoring systems</li>\n</ul><h1>Who you are</h1><ul>\n<li>You’re self-driven and prefer working autonomously with limited guidance</li>\n<li>You’re dependable, reasonable and trustworthy, with proven sound judgment</li>\n<li>You can operate in a high-octane environment </li>\n<li>You utilize the Pareto Principle (80/20)</li>\n<li>You prefer 5 minute daily standups vs long drawn out meetings </li>\n<li>You have a profound passion for Rails best practices</li>\n</ul><h1>Requirements</h1><ul>\n<li>6+ years of professional software development experience with Ruby / Ruby on Rails</li>\n<li>Deep knowledge of working with the Shopify app ecosytem</li>\n<li>In-depth knowledge of database systems, particularly relational databases (e.g., Postgres, Sidekiq and Redis)</li>\n<li>The ability to adjust to our high octane workflow. One of our core values is to create what works in its simplest form and iterate based on metrics and feedback. We don't have long release cycles 🤗</li>\n<li>The ability to work in EST or PDT time zone, or at least overlap by 5 hours</li>\n<li>Ability to write efficient and optimized code, following best practices and design patterns</li>\n<li>Strong analytical and problem-solving abilities to tackle complex technical challenges</li>\n<li>Excellent communication skills to effectively collaborate with cross-functional teams, including product managers, designers, and other engineers</li>\n</ul><h1>❤️ Things we love</h1><ul>\n<li>Living by our GAINS core values of Growth Mindset, Analyze Before Assuming, Iterate &amp; Improve, Nurture Relationships, and Scrappy.</li>\n<li>Helping over 1.4M Shopify merchants who have installed our software</li>\n<li>Having a stress free work environment!</li>\n<li>Being a 100% remote &amp; 100% global team! </li>\n</ul><h1>🤮 Things we avoid</h1><ul>\n<li>Micro-managing</li>\n<li>Egos</li>\n<li>Drama</li>\n</ul><h1>Salary</h1><div>Salary is negotiable and based upon experience. Everyone should earn what they feel is fair. This is a remote, full-time role (40+ hours/week).<br><br>\n</div><div>Does this sound like you would be a good fit? Please <a href=\"https://boosterseo.homerun.co/senior-ruby-on-rails-engineer/en/apply?&amp;step=1\"><strong>complete the application form</strong></a> with a quick loom video about why you think you’d be a good fit, and we'll be in touch.<br><br>\n</div><div>Thank you!</div><div><br></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/booster-seo-senior-ruby-on-rails-engineer\">https://weworkremotely.com/remote-jobs/booster-seo-senior-ruby-on-rails-engineer</a></p>\n", "Publication Date": "Thu, 16 Nov 2023 18:32:46 +0000", "Link": "https://weworkremotely.com/remote-jobs/booster-seo-senior-ruby-on-rails-engineer", "Expiry Date": "Sat, 16 Dec 2023 18:32:46 +0000"}, {"Region": "Anywhere in the World", "Title": "RemoteMore: Senior Flutter Developer", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Berlin/Chicago \n    <br /><strong>URL:</strong> <a href=\"https://remotemore.com/candidates?utm_source=wwr&amp;utm_medium=jobpost&amp;utm_campaign=flutter\">https://remotemore.com/candidates?utm_source=wwr&amp;utm_medium=jobpost&amp;utm_campaign=flutter</a>\n</p>\n\n<div><strong>The position</strong></div><div><br></div><div>RemoteMore is helping a large tech company hire Flutter Developers for its European and US teams.</div><div><br></div><div>The company is one of the major tech companies and works across many internal product teams. Multiple Flutter Developers will be hired and matched to the teams that are best fit for their background/experience.  All product teams are fully distributed. The company culture is to focus on work delivered and not hours worked.</div><div><br></div><div>You can work from home or any other place of your choice.</div><div><br></div><div>The position is full-time and remote.<br><br><strong>Your profile</strong>\n</div><div><br></div><div>Coming from a strong technical background, you are expected to have:</div><div><br></div><ul>\n<li>Required technologies: <strong>Flutter</strong>, Firebase, Data Storage, Audio enabling tools</li>\n<li>Top technical skills for your level of experience:  <strong>2+ years</strong> of experience as an <strong>Intermediate</strong> or <strong>Senior </strong>Software Engineer</li>\n<li>The soft skills to work remotely. Strong individual contributor, strong communication skills.</li>\n<li>Passion for remote work. You understand the pros and cons of working remotely.</li>\n<li>\n<strong>Proficient English</strong> language skills to work as part of an international team.<br><br>\n</li>\n</ul><div>Why should YOU apply?</div><div><br></div><ul>\n<li>Work from anywhere you want.</li>\n<li>Competitive compensation based on your skills.</li>\n<li>Work in a team with other top developers.</li>\n<li>Make a difference.</li>\n</ul><div><br></div><div>To be considered for the position please sign up to RemoteMore by following the apply button link. </div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/remotemore-senior-flutter-developer\">https://weworkremotely.com/remote-jobs/remotemore-senior-flutter-developer</a></p>\n", "Publication Date": "Thu, 16 Nov 2023 16:18:35 +0000", "Link": "https://weworkremotely.com/remote-jobs/remotemore-senior-flutter-developer", "Expiry Date": "Sat, 16 Dec 2023 16:18:35 +0000"}, {"Region": "Anywhere in the World", "Title": "IVPN: Full-stack Web Developer", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0066/9815/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Gibraltar \n    <br /><strong>URL:</strong> <a href=\"https://www.ivpn.net\">https://www.ivpn.net</a>\n</p>\n\n<div>\n<strong>Job description<br></strong><br>\n</div><div>\n<strong>Please note for this role we are only recruiting within the UTC-1 to UTC+3 timezones.<br><br></strong><br>\n</div><div>IVPN is a VPN service built for helping customers protect their privacy and resist online surveillance. We have been around since 2010 and are known as one of the most <a href=\"https://www.ivpn.net/team\">transparent</a>, <a href=\"https://www.ivpn.net/ethics/\">ethical</a> and <a href=\"https://www.ivpn.net/trust\">trustworthy</a> providers.<br><br>\n</div><div>\n<strong>Why join IVPN?<br></strong><br>- You will be developing a product that we believe is crucial in the fight for online privacy together with a team that truly <a href=\"https://www.ivpn.net/team\">cares about their mission</a>.</div><div>- Fully remote setting.<br>- We offer a competitive salary, generous vacation policy and the hardware of your choice to do your job.<br><br>\n</div><div><br></div><div>\n<strong>Job Summary<br></strong><br>\n</div><div>We are seeking a full-stack developer to architect and build a robust web application focused on user privacy. This application must be designed for high scalability to accommodate a rapidly growing user base. The ideal candidate will be proficient in creating efficient, high-load systems and committed to delivering a secure, performant solution that respects user privacy on a large scale.<br><strong><br><br></strong><br>\n</div><div><strong>Core Responsibilities</strong></div><ul>\n<li>Design, develop and maintain a scalable web application serving hundreds of thousands of customers</li>\n<li>Continually refactoring, optimising, and improving the codebase for scale and security.</li>\n<li>Collaborating with other members of the product development team (developers, UX designers, PM etc) to achieve project objectives.</li>\n<li>Ensuring the overall stability, performance and security of the web application.</li>\n</ul><div><strong><br>Job requirements</strong></div><ul>\n<li>Bachelor's degree in Computer Science or a related field.</li>\n<li>Proficient in front-end technologies such as HTML5, CSS3, JavaScript, and modern JS frameworks (React, Angular, Vue.js).</li>\n<li>Experience with back-end development, including server, network, and hosting environments, ideally using Node.js / Python or Golang.</li>\n<li>Knowledge of DNS protocols, privacy tools, and ad-blocking technology.</li>\n<li>Fluent in SQL and able to create complex database schemas.</li>\n<li>Understanding of security best practices to safeguard user data.</li>\n<li>Experience with testing frameworks and continuous integration.</li>\n<li>Ideally experience working in a remote, globally-distributed, agile team environment.</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/ivpn-full-stack-web-developer\">https://weworkremotely.com/remote-jobs/ivpn-full-stack-web-developer</a></p>\n", "Publication Date": "Thu, 16 Nov 2023 15:57:40 +0000", "Link": "https://weworkremotely.com/remote-jobs/ivpn-full-stack-web-developer", "Expiry Date": "Sat, 16 Dec 2023 15:57:40 +0000"}, {"Region": "Anywhere in the World", "Title": "CobbleWeb: Senior Full-stack PHP Developer", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0084/1275/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> London\n    <br /><strong>URL:</strong> <a href=\"https://www.cobbleweb.co.uk\">https://www.cobbleweb.co.uk</a>\n</p>\n\n<div><strong>What are we looking for?</strong></div><div>We are looking for solution-focused individuals with a can-do attitude. Your commitment to continuous learning means you are tech agnostic – always looking for the best way to execute a project or task. You share our philosophy of purpose-driven development that ensures the best possible outcomes for our clients. Like us, you believe in a strong work ethic and take pride in the quality of your code. You see the big picture and strive for the sense of accomplishment that comes from successfully executing a new project, such as an online marketplace that is perfectly geared for growth. Last but not least, you enjoy collaborating with a team of equally motivated developers and digital strategists.</div><div><br></div><div><strong>Job requirements</strong></div><ul>\n<li>Expert with Symfony framework (3+years experience)</li>\n<li>Expert PHP5, PHP7 (5+years experience)</li>\n<li>Strong Experience developing within ReactJS (2+years experience)</li>\n<li>Expert MySQL / Doctrine 2 (3+years experience)</li>\n<li>Experience Developing Frontend with Bootstrap/Material (1+years experience).</li>\n<li>Very strong Object Oriented Programming skills</li>\n<li>Experience with REST APIs</li>\n<li>Use of Docker in local and production environments</li>\n<li>Adoption of Agile methodologies</li>\n<li>Experience with techniques such as TDD, continuous integration and continuous delivery</li>\n<li>Experience with test automation using Behat, Jenkins, Selenium or other testing frameworks would be advantageous</li>\n<li>RabbitMQ, Redis, AWS or Elastisearch is a plus</li>\n<li>Be willing to help your teammates, share your knowledge with them, and learn from them.</li>\n<li>Be open to receiving feedback.</li>\n<li>Be conscientious and have a good work ethic.</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/cobbleweb-senior-full-stack-php-developer-6\">https://weworkremotely.com/remote-jobs/cobbleweb-senior-full-stack-php-developer-6</a></p>\n", "Publication Date": "Thu, 16 Nov 2023 11:43:39 +0000", "Link": "https://weworkremotely.com/remote-jobs/cobbleweb-senior-full-stack-php-developer-6", "Expiry Date": "Sat, 16 Dec 2023 11:43:39 +0000"}, {"Region": "Anywhere in the World", "Title": "LaunchGood, Inc.: Sr. Full Stack Software Engineer", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7241/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Detroit, MI\n    <br /><strong>URL:</strong> <a href=\"https://launchgood.com\">https://launchgood.com</a>\n</p>\n\n<div>\n<strong><em>Bismillah</em></strong><strong>. LaunchGood is actively looking for a Senior Full Stack Software Engineer!<br><br></strong>Are you a <strong>Senior Full Stack Software Engineer</strong> that wants to build awesome products that will be used by millions of people around the globe? If so, read on.<br><br>You'll need to be comfortable with both frontend and backend development (some specialization is okay!) You should be adept at turning product designs into usable products. We use full stack Typescript (Nest.js backend and Next.js+Tailwind frontend).  Our approach to Engineering at LaunchGood is like Henry Ford: <em>you can code in any language you like, as long as it's Typescript!</em><br><br>As a Senior Full Stack Software Engineer, you'll be expected to help mentor and guide more junior team members especially on architecture and technical design. You should be motivated to help team members understand architecture, integration patterns, and how to write maintainable code that works at scale. <br><br>We're a fully remote company, but we make a point to meet up in person at least a few times per year in inspiring destinations (Istanbul, Alexandria, Cancun, Doha, and Bali are examples of onsite destinations). Roughly a week of travel 2-3 times a year is a requirement.</div><div><br></div><div><strong>What you'll do</strong></div><ul>\n<li>Work on products &amp; features that user's love, impact for communities around the globe</li>\n<li>Implement mission-critical (macro)services using Nest.js (Node.js)</li>\n<li>Create user experiences using Next.js (React) &amp; Tailwind on the frontend</li>\n<li>Design &amp; build standards-based APIs using Open API (Swagger)</li>\n<li>Relentlessly drive enhancements to push them into the hands of our users</li>\n<li>Champion improvements by working across the product &amp; design teams</li>\n<li>Deliver systems that handle high-volumes with high-availability</li>\n</ul><div><strong>Requirements</strong></div><ul>\n<li>7+ years experience within a product-oriented software engineering team</li>\n<li>Advanced experience with full-stack JavaScript &amp; relevant tooling, including Typescript</li>\n<li>Strong experience with at least one (2) modern front-end JavaScript frameworks</li>\n<li>Strong experience with Express.js, Nest.js, or other backend framework</li>\n<li>Strong web stack fundamentals (HTTP, servers, browsers, caching, etc.)</li>\n<li>Experience with TDD workflow and all manner of test automation</li>\n<li>Experience working fully remote &amp; with teams that span multiple time zones</li>\n<li>Strong relational database design savvy &amp; solid experience with MySQL or Postgres</li>\n<li>Some experience with CI/CD systems, managed infrastructure, etc.</li>\n<li>Knowledge of standards-based REST APIs using Open API</li>\n<li>Basic modern dev-ops knowledge; working knowledge of Docker, etc.</li>\n<li>Basic working knowledge of semantic markup &amp; styling (HTML/CSS)</li>\n</ul><div>\n<br><strong>Other Perks</strong>\n</div><ul>\n<li>Gear up! We offer a generous equipment stipend for you to get the hardware you want</li>\n<li>Celebrate! We offer flexible paid time off plus a generous time off for both Eids</li>\n<li>You're covered! Medical benefits for employees located in qualifying countries</li>\n</ul><div>\n<strong>How does global work?<br></strong>Our team is generally aligned to either US Eastern or Pakistan Timezone, allowing for overlap between the two. Preference will be given to candidates with favorable timezone overlap.<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/launchgood-inc-sr-full-stack-software-engineer\">https://weworkremotely.com/remote-jobs/launchgood-inc-sr-full-stack-software-engineer</a></p>\n", "Publication Date": "Wed, 15 Nov 2023 06:33:28 +0000", "Link": "https://weworkremotely.com/remote-jobs/launchgood-inc-sr-full-stack-software-engineer", "Expiry Date": "Fri, 15 Dec 2023 06:33:28 +0000"}, {"Region": "Anywhere in the World", "Title": "Duet, Inc.: Senior Software Engineer", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0017/2328/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Miami, FL\n    <br /><strong>URL:</strong> <a href=\"https://www.duetdisplay.com\">https://www.duetdisplay.com</a>\n</p>\n\n<div><strong>What You'll Do</strong></div><ul>\n<li>Work closely with the CEO, CTO, and Engineering Team to develop new features and products</li>\n<li>Ship to customers around the world</li>\n<li>Help individuals, teams, and companies work more effectively while remote</li>\n<li>Work across technologies, but with a focus on either macOS, Windows, or our Backend Engineering</li>\n</ul><div>\n<br><strong>What We Are Looking For</strong>\n</div><ul>\n<li>Driven, ambitious, and excited to learn new things</li>\n<li>Takes responsibility and ownership, and can work across a complex codebase</li>\n<li>Can learn quickly and get things done</li>\n<li>Has shipped apps with hundreds of thousands of customers</li>\n<li>Can solve complex engineering tasks</li>\n<li>Comfortable writing clean, organized code with an eye for performance optimization</li>\n</ul><div>\n<br><strong>Technologies<br></strong>There are several teams at Duet, so you should have experience in at least one set of technologies:</div><ul>\n<li>Windows Engineering Team: C++</li>\n<li>Apple Engineering Team: Objective-C/Swift (and some C/C++)</li>\n<li>Backend Engineering Team: Go (and nice to have webRTC)</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/duet-inc-senior-software-engineer-10\">https://weworkremotely.com/remote-jobs/duet-inc-senior-software-engineer-10</a></p>\n", "Publication Date": "Tue, 14 Nov 2023 12:08:00 +0000", "Link": "https://weworkremotely.com/remote-jobs/duet-inc-senior-software-engineer-10", "Expiry Date": "Thu, 14 Dec 2023 12:08:00 +0000"}, {"Region": "Anywhere in the World", "Title": "Sanctuary Computer: Technical Studio Lead", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0018/4269/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> NYC\n    <br /><strong>URL:</strong> <a href=\"https://www.sanctuary.computer\">https://www.sanctuary.computer</a>\n</p>\n\n<div>As a Studio Lead at <a href=\"https://www.sanctuary.computer\">Sanctuary Computer</a>, you’ll partner with two other Studio Leads to support our project teams, define the strategy of the studio, and lead internal projects to help us achieve our vision. You’ll help cultivate a culture of intellectual curiosity and continuous improvement that empowers us to push the boundary of our technical projects year-over-year.<br><br>Based on the responsibilities of this role, we think the right candidate will be a decade or so into their career and will have prior experience in an Engineering Manager role. Maybe they'll be a little burned out by Big Tech and intrigued by a worker-first company with profit share and an optional 4-day workweek.<br><br>If this sounds like you, check out the full job posting with detailed information on the role, the studio, and the compensation program: <a href=\"https://garden3d.notion.site/Technical-Studio-Lead-Fall-2023-900d4c0a4fc342a2810f791da07d869e\">https://garden3d.notion.site/Technical-Studio-Lead-Fall-2023-900d4c0a4fc342a2810f791da07d869e</a><br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/sanctuary-computer-technical-studio-lead\">https://weworkremotely.com/remote-jobs/sanctuary-computer-technical-studio-lead</a></p>\n", "Publication Date": "Wed, 01 Nov 2023 13:34:11 +0000", "Link": "https://weworkremotely.com/remote-jobs/sanctuary-computer-technical-studio-lead", "Expiry Date": "Sun, 31 Dec 2023 13:34:11 +0000"}, {"Region": "Anywhere in the World", "Title": "OpenCraft: Senior Open Source Developer & DevOps (Python, Django, React, AWS/OpenStack)", "Category": "Full-Stack Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0017/3489/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Fully remote company (worldwide, incorporated in Berlin)\n    <br /><strong>URL:</strong> <a href=\"https://opencraft.com/\">https://opencraft.com/</a>\n</p>\n\n<div>Do you care about contributing to open-source, and appreciate a good challenge? We do too! :) <br><br>\n</div><div>\n<strong>Open-source<br></strong><br>\n</div><div>We are a team of veteran open-source developers, working on educational and community-based projects in an<a href=\"https://handbook.opencraft.com/en/latest/open_first/\"> open-first</a> environment – and we are looking for new members. By joining us, you will work full-time on open-source, pushing your changes to free software projects upstream through pull requests, contributing features, documentation, or help on public forums. </div><div>\n<br>We care deeply about contributing our work upstream. You will see the results of your work reused and recognized across the educational community, increasing access to quality education for everyone, everywhere.</div><div>\n<br><strong>Remote-first</strong>\n</div><div>\n<br>Unlike companies who reluctantly started to accept remote workers recently, we have embraced it from day 1. For the past 7 years, we have based and refined our way of working around remote-friendly workflows, from the ground up. No day-long video meetings, mandatory work hours, or risk of being forced back into an office one day -- as long as you have a good internet connection, it’s none of our business when or where you work from. :)</div><div>\n<br>We are all working remotely, from all continents (except Antarctica, at least so far - applicants welcome!). We use remote-friendly and timezone-agnostic workflows based on asynchronous principles and good documentation practices.</div><div>\n<br><strong>Online education<br></strong><br>\n</div><div>We are one of the main contributors to the <a href=\"https://open.edx.org/\">Open edX project</a>, the main open-source MOOC platform created by MIT, Harvard and many other top universities. It powers sites like <a href=\"https://www.edx.org/\">edX.org</a>, the <a href=\"https://openlearning.mit.edu/courses-programs/open-learning-library\">MIT Open Learning Library</a>, and the <a href=\"https://www.fun-mooc.fr/\">national online learning platform for France</a>. We provide development and hosting for institutions like <a href=\"https://onlinelearning.hms.harvard.edu/hmx/\">Harvard Medical School</a>, <a href=\"https://www.labxchange.org\">Harvard LabXchange</a>, <a href=\"https://ondemand.cloudera.com\">Cloudera</a>, <a href=\"https://www.upskill.autodesk.com\">Autodesk</a>, and several governments. We are not affiliated with <a href=\"https://www.edx.org/\">edX.org</a>, but we contribute and work with them on various projects. </div><div>\n<br><strong>Technical stack</strong><br><br>\n</div><div>The Open edX project is a large Python/Django codebase, with good code standards and architecture. Tasks are varied, from developing core platform features, custom exercises and tools for specific courses (XBlocks), customizing and deploying instances, working full-stack, operating our service infrastructure, improving our hosting platform, etc. You won't get bored here.<br><br>\n</div><div>\n<strong>Contracting terms<br></strong><br>\n</div><div>This is a full-time, permanent contract position. We aim for long-term relationships -- once in, almost all team members stay for many years. </div><div><br></div><div>We care about paying fairly: </div><ul>\n<li>Team members set their own compensation level, which is paid based on hours worked (no unpaid overtime!). </li>\n<li>When determining your rate, we will expect you to factor in benefits (vacation, healthcare, purchase budgets, etc.) - the idea is to let <em>you</em> pick the benefits that are useful to you, rather than offer one-size-fits-all packages that aren’t always very valuable.</li>\n<li>We also proactively apply generous raises team-wide, based on the company results at the end of each year. <a href=\"https://handbook.opencraft.com/en/latest/team_compensation/\">See the details about how we approach compensation in our handbook</a>.</li>\n</ul><div>We also firmly believe in work-life balance: as long as you deliver what you commit to, there is a lot of latitude in how much work you can choose to accept. We are open to time commitments anywhere in the 30h to 40h/week range, and highly discourage working more than that. It’s important to have time to ourselves, as well as having some slack, and there are diminishing returns in working more anyway. We are currently recruiting precisely to preserve that balance, and ensure we have plenty of capacity to handle our projects.</div><div><br></div><div>We welcome applicants of all genders and ethnicities.</div><div>\n<br><strong>Basic Requirements:</strong>\n</div><ul>\n<li>Experience with contributing to free software projects - small contributions are completely fine, but you <em>must</em> have at least one patch or pull request merged in a third-party project, or been a maintainer of an open source project with significant adoption. (Note that you can contribute now to satisfy this requirement - see for example the <a href=\"https://github.com/openedx/build-test-release-wg/projects/1\">Open edX release issues</a>, fixing one of these issues guarantees an interview.)</li>\n<li>Senior developer with 3+ years working with Python</li>\n<li>Experience with Python web frameworks, specifically Django</li>\n<li>3+ years of HTML, Javascript, and CSS (experience with React and/or Typescript is a big plus!)</li>\n<li>Experience with unit testing</li>\n<li>Comfortable working in a Linux environment, specifically Debian or Ubuntu</li>\n<li>Experience with databases: MySQL, MongoDB, PostgreSQL</li>\n</ul><div>\n<strong>Additional Skills:</strong><br><br>\n</div><div>You will work on tasks from the following categories, but you can pick up the skills on the job if you haven't mastered these yet:</div><ul>\n<li>DevOps experience, especially on Debian/Ubuntu servers, Terraform, Vault, Packer, Prometheus, ELK, Docker. We are building a modern infrastructure and having a strong DevOps presence on top of core software engineering skills is a big plus with us.</li>\n<li>Cloud computing, like AWS or OpenStack</li>\n<li>Configuration management tools such as Ansible, Consul</li>\n<li>RabbitMQ, Redis &amp; Elasticsearch</li>\n<li>Mobile development (iOS and/or Android)</li>\n<li>Managing clients &amp; projects from beginning to completion (senior developer)</li>\n<li>Public speaking at conferences (you would present a talk every year at the Open edX Con)</li>\n</ul><div>\n<br><strong>Apply for this Position</strong><br><br>\n</div><div>Our recruitment process differs from most other companies - we don’t believe resumes and the traditional interviews to be particularly effective. Often, they tell more about how good someone is at interviewing, rather than at the actual work. So, our initial interview is lighter and easier to pass than in other companies - but we then provide you with real (and paid!) work to see how it works out in reality.</div><ul>\n<li>Step 1: You apply by filling out this form: <a href=\"https://opencraft.com/jobs/open-source-developer/\">https://opencraft.com/jobs/open-source-developer/</a> </li>\n<li>Step 2: We do two interviews with candidates matching the requirements listed above. The first interview includes a (simple) coding exercise.</li>\n<li>Step 3: If this works out, we hire you! We start with a 2 months <a href=\"https://handbook.opencraft.com/en/latest/processes/#recruitment\">trial period</a>, which allows both you and the rest of the team to fully evaluate how we work together, and is followed by a final review and confirmation. </li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/opencraft-senior-open-source-developer-devops-python-django-react-aws-openstack\">https://weworkremotely.com/remote-jobs/opencraft-senior-open-source-developer-devops-python-django-react-aws-openstack</a></p>\n", "Publication Date": "Tue, 10 Nov 2020 20:46:50 +0000", "Link": "https://weworkremotely.com/remote-jobs/opencraft-senior-open-source-developer-devops-python-django-react-aws-openstack", "Expiry Date": "Mon, 25 Dec 2023 20:46:50 +0000"}], "Front-End Programming Jobs": [{"Region": "Anywhere in the World", "Title": "Whitespectre: Senior React Native Engineer", "Category": "Front-End Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0082/1800/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Remote\n    <br /><strong>URL:</strong> <a href=\"http://www.whitespectre.com/\">http://www.whitespectre.com/</a>\n</p>\n\n<div>\n<a href=\"http://www.whitespectre.com/\"><strong><br>Whitespectre</strong></a>is a product-centric,  technology consultancy for both VC funded start-ups and large, established companies across the US and Europe. We’re also a product incubator with our own applications and B2B SaaS platform. As long-term partners to our clients, we’ve played a critical role in their growth- both through the products we co-create and the expertise and processes we bring. Proudly remote first since 2013, we’re a close-knit team of 75, working in fast-moving, cross-functional agile pods to solve interesting technical challenges and drive real business impact.</div><div><br></div><div><strong>What's it like to be a React Native engineer at Whitespectre?</strong></div><ul>\n<li>Our React Native developers are sharp technical experts with the ability to think like product owners- being able to advocate for code quality as a long term strategic investment while knowing when to adapt a more start-up mentality to deliver rapid business value. They drive architecture and implementation decisions, mentor other engineers, and stay up to date with the latest Javascript techniques and trends as part of the collective Whitespectre Javascript brain trust. </li>\n<li>Whitespectre operates on a fully-modern tech stack- toolset includes React Native, ReactJS, Typescript, Webpack, Node.js/Express, REST/GraphQL, Rails, Postgres, Elastic, CI/CD with Docker, Heroku/AWS, etc. Working smartly is important to us; automation, dynamic environments spin up with new feature branches and slack bot integrations control our production releases.</li>\n<li>We follow an agile 2-week sprint methodology with Product, UI/UX and Engineering within the team to align closely with business stakeholders and incrementally build and release new functionality.</li>\n<li>The majority of our projects involve building greenfield applications and our delivery teams typically own products end to end - your thinking and contribution make a big impact!</li>\n<li>You can read more about life in our engineering team in this blog<a href=\"https://www.whitespectre.com/ideas/a-day-in-the-life-with-eneko-senior-react-engineer/?utm_source=workable&amp;utm_medium=job-openings\"> post by our Senior Engineer, Eneko</a> and <a href=\"https://www.whitespectre.com/ideas/meet-ana-babac-react-native-engineer/\">Ana, React Native Engineer <br></a><br>\n</li>\n</ul><div><strong>Benefits</strong></div><ul>\n<li>Competitive salaries, with payment in USD</li>\n<li>Annual Performance &amp; Salary Reviews, with proactive career management</li>\n<li>20 Days PTO &amp; 3 Charity Days annually</li>\n<li>Funded face-to-face meet ups in Barcelona, as well as, South America and Asia</li>\n<li>Assisted Relocation package </li>\n<li>Flexible working hours for efficient teaming in a 100% remote environment (proudly remote-first for 10 years!)</li>\n<li>Free English classes &amp; educational expenses support</li>\n<li>Generous Employee Referral Plan</li>\n<li>Team Fitness and Charity Initiatives</li>\n</ul><div>\n<br><strong>Cultural benefits<br></strong>In addition to the above benefits, we foster an inclusive working environment that provides:</div><ul>\n<li>Great company environment - check out <a href=\"https://www.glassdoor.com/Reviews/Whitespectre-Reviews-E1575846.htm?countryRedirect=true\">Glassdoor</a>\n</li>\n<li>Personalized onboardings</li>\n<li>Opportunity to contribute to company-level initiatives</li>\n<li>Work with a broad range of best-in-class technologies</li>\n<li>Cross-company knowledge groups - improve your expertise, share your learnings and work with different technologies and tools</li>\n<li>Regular brown bag learning sessions</li>\n<li>An emphasis on Work-life balance</li>\n</ul><div>\n<br><strong>This is the right position for you if want-</strong>\n</div><ul>\n<li>The challenge of collaborating with business stakeholders and Product Managers to advocate for technology solutions while bearing in mind the tradeoffs for business results</li>\n<li>The responsibility of designing new architectures and being confident to justify your technology decisions. (Plus debating and recognizing when a colleague has an even better idea!)</li>\n<li>The opportunity to go outside your core expertise and strengthen skills with other technologies and learn more</li>\n<li>To solve problems that can’t be addressed by just searching Stack Overflow</li>\n<li>An environment where excellent communication skills (both verbal and written) are valued and honed.</li>\n<li>A culture where people from different backgrounds interact, collaborate and reach a shared goal<br><br>\n</li>\n</ul><div><strong>The “check the box” Requirements</strong></div><ul>\n<li>5+ years of experience in software development and 4+ years of React Native</li>\n<li>Advanced English level, excellent verbal and written communication skills</li>\n<li>Experience contributing to technical decision-making within a team</li>\n<li>Can work full-time with a significant crossover with the core hours: 11am - 7pm Central European Time</li>\n<li>Live outside of the US. Please, no recruitment agencies.</li>\n</ul><div>\n<br><strong>Interested in applying?</strong>\n</div><ul>\n<li>Apply by completing the form below</li>\n<li>Or email us with any questions on reactnative-jobs@whitespectre.com</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/whitespectre-senior-react-native-engineer-1\">https://weworkremotely.com/remote-jobs/whitespectre-senior-react-native-engineer-1</a></p>\n", "Publication Date": "Wed, 13 Dec 2023 09:23:41 +0000", "Link": "https://weworkremotely.com/remote-jobs/whitespectre-senior-react-native-engineer-1", "Expiry Date": "Fri, 12 Jan 2024 09:23:41 +0000"}, {"Region": "Anywhere in the World", "Title": "Speechify Inc: Senior Software Engineer, Web", "Category": "Front-End Programming", "Type": "Contract", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7517/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Florida\n    <br /><strong>URL:</strong> <a href=\"http://www.speechify.com\">http://www.speechify.com</a>\n</p>\n\n<div>\n<strong><br>Overview<br></strong><br>\n</div><div>With that growth comes the need for a Javascript Engineer to join the existing Web team and continue supporting the growing user base as well as building new and exciting features.</div><div><br></div><div>This is a key role and ideal for someone who thinks strategically, enjoys high-pace environments, passionate about owning product decisions and has experience building and scaling complex engineering systems.</div><div>\n<strong><br>What You’ll Do<br></strong><br>\n</div><ul>\n<li>Actively ship production code to the web products</li>\n<li>Work closely with your dedicated product team</li>\n<li>Participate in product discussions to shape the product roadmap</li>\n<li>Have the opportunity to work on new and exciting features that will impact millions of lives</li>\n</ul><div>\n<strong><br>An Ideal Candidate Should Have<br></strong><br>\n</div><ul>\n<li>Experience. You've built and ship products that have scaled to thousands or millions of users</li>\n<li>Customer obsession. You are passionate about the field and have the desire to build high quality product that serves customer needs</li>\n<li>Speed. You work quickly to generate ideas and know how to decide which things can ship now and what things need time</li>\n<li>Focus. We’re a high-growth startup with a busy, remote team. You know how and when to engage or be heads down</li>\n<li>Collaboration. You know how to inspire, play, and negotiate with opinionated designers, marketers, and PMs</li>\n<li>Tech Stack: Vanilla JS, ReactJS, Redux, Firebase, Typescript</li>\n</ul><div>\n<strong><br>What We Offer<br></strong><br>\n</div><ul>\n<li>A fast-growing environment where you can help shape the culture</li>\n<li>An entrepreneurial crew that supports risk, intuition, and hustle</li>\n<li>A hands-off approach so you can focus and do your best work</li>\n<li>The opportunity to make an impact in a transformative industry</li>\n<li>A competitive salary, a collegiate atmosphere, and a commitment to building a great asynchronous culture</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/speechify-inc-senior-software-engineer-web\">https://weworkremotely.com/remote-jobs/speechify-inc-senior-software-engineer-web</a></p>\n", "Publication Date": "Wed, 06 Dec 2023 11:40:08 +0000", "Link": "https://weworkremotely.com/remote-jobs/speechify-inc-senior-software-engineer-web", "Expiry Date": "Fri, 05 Jan 2024 11:40:08 +0000"}, {"Region": "Anywhere in the World", "Title": "Toggl: Senior Frontend Developer", "Category": "Front-End Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Tallinn, Estonia\n    <br /><strong>URL:</strong> <a href=\"https://toggl.com/jobs/\">https://toggl.com/jobs/</a>\n</p>\n\n<div>\n<br>We are looking for a passionate and sharp Senior Frontend Engineer to help us shape the future of the time-tracking industry, delivering real value to our customers by introducing new features and improving the existing ones.<br><br>\n</div><div>The salary for this position is <strong>€72,000</strong> annually.<br><br>\n</div><div>You can work <strong>from anywhere in the world as long as your main location is between UTC-4 and UTC+8:00.<br></strong><br>\n</div><div><strong><br>About the Team</strong></div><div>\n<br>We are a global team of 100+ awesome people working from over 40 countries around the globe. We hire globally, you work locally—in the heart of London, a beach outside of São Paulo, or a quiet village near Florence, the choice is yours. Every few months we travel to meet up somewhere in the world and spend some quality time together. We place a huge amount of trust in our people, and we measure the outcomes rather than the work itself. <a href=\"https://toggl.com/culture/\">Our values</a> fuel our results.<br><br>\n</div><div>\n<strong><br>The Role<br></strong><br>\n</div><div>As a Senior Frontend Engineer, you will play a critical role in taking ownership of major projects, using React, JavaScript, TypeScript, HTML and CSS to code slick and fast data visualizations that translate our data into meaningful insights.<br><br>\n</div><div>Your main responsibilities will be:</div><ul>\n<li>Work closely with other engineers, product managers and designers to understand requirements and translate them into user-friendly web-based components</li>\n<li>Develop and maintain scalable data visualizations using modern frontend technologies such as React and Nivo</li>\n<li>Optimize frontend performance to ensure fast rendering and smooth interactions for high data volumes</li>\n<li>Conduct code reviews, identify and resolve technical issues, and maintain high coding standards</li>\n<li>Collaborate with other development teams to identify and implement best practices in frontend development and related areas</li>\n</ul><div><strong><br>About you</strong></div><div>\n<br>We would love to hear from you if you have significant experience in frontend development and can lead major development projects. You love working with data visualizations and believe React and web components are the future.</div><div>\n<br>In particular, we are looking for:</div><ul>\n<li>Extensive knowledge about JavaScript and React, and preferably Redux and a side effect managing library like Redux-Saga</li>\n<li>Demonstrated experience leading large development projects, with good organization skills and the ability to plan well-structured projects, estimate tasks, manage stakeholders and coordinate with other cross-functional teams</li>\n<li>A knack for data visualizations, with some familiarity of its principles and best practices</li>\n<li>Knowledge about testing frameworks, like Jest</li>\n<li>Excellent communication and collaboration skills, with the ability to work in a remote team environment</li>\n<li>Strong problem-solving skills, attention to detail, and ability to work independently</li>\n</ul><div><strong><br>Benefits</strong></div><ul>\n<li>Freedom to choose when and how much you work - we only measure results</li>\n<li>24 days of paid time off a year, plus your local holidays</li>\n<li>In-person meetups for team-building (expenses covered)</li>\n<li>4-6 weeks paid sabbatical (depending on the tenure)</li>\n<li>Laptop budget up to €2,500 and it renews every 3 years</li>\n<li>€2,000 budget to set up your home office, and additional €300 every year after 3 years of tenure</li>\n<li>€250 per month for co-working space membership and/or internet service at home</li>\n<li>€4,000 per year contribution to use for training, workshops, and conferences</li>\n<li>€2,000 per year contribution for any equipment or services to improve and/or maintain your physical and mental health</li>\n<li>Support for buying tools you need for doing your best work (even eyeglasses if you need a new pair)</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/toggl-senior-frontend-developer-1\">https://weworkremotely.com/remote-jobs/toggl-senior-frontend-developer-1</a></p>\n", "Publication Date": "Tue, 05 Dec 2023 14:08:38 +0000", "Link": "https://weworkremotely.com/remote-jobs/toggl-senior-frontend-developer-1", "Expiry Date": "Thu, 04 Jan 2024 14:08:38 +0000"}, {"Region": "Anywhere in the World", "Title": "Secfix: Senior Frontend Engineer", "Category": "Front-End Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0127/7435/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Berlin, Germany\n    <br /><strong>URL:</strong> <a href=\"https://secfix.com\">https://secfix.com</a>\n</p>\n\n<div>Secfix automates security compliance for SMBs in Europe. We help companies get and stay compliant with standards such as ISO 27001, GDPR, TISAX, and SOC 2 in weeks rather than months. </div><div>Our platform integrates with a company’s tech stack (such as GCP, AWS, Azure, Google Workspaces, Jira, Gitlab, etc.), automatically extracts the data needed for compliance, and creates a checklist to become and remain certified. Our fastest customer finished their certification in 4 weeks instead of 12+ months, typically seen from older institutions.</div><div>We raised pre-seed funding from top German angel investors and recently closed our seed round from leading UK and German VCs after impressive growth. Now, the goal (with your help) is to become the market leader.</div><div><br></div><div><strong>About the role:</strong></div><div>As a small team, we are all generalists and constantly picking up new challenges. Regarding product and code, we’re looking to work with experienced people who can pick a problem and solve it. We use TypeScript and want to build more scalable systems so we can continuously make progress on a solid foundation. We don’t expect you to have a background in everything we use but expect strong JavaScript fundamentals and a background working with Angular and TypeScript. Every feature that is being ideated will go through you, and every future front-end engineer hire will live the engineering values that you will shape with us and live by. You'll get first-hand exposure to what it means to build and scale a remote software startup.</div><div><br></div><div><strong>Preferred experience &amp; culture:</strong></div><ul>\n<li>You love iterating and taking pride in owning customer-facing features from ideas to going live and strive for great visuals and usability. </li>\n<li>You are a team player and communicate with other members and set up calls with customers if necessary to get feedback directly.</li>\n<li>You have strong JavaScript fundamentals working with Angular and TypeScript with more than 7 years of experience in front-end development. We don’t expect you to have a background in every technology we use but you are able to learn quickly on your own.</li>\n<li>In our current growth stage, we want to achieve a lot with a small team. Priorities can change fast. Hence you are a strong believer that hard work and flexibility are qualities that an early startup employee should live by. You can pick up a customer problem, define it, and work on it. </li>\n<li>You love speed and have high standards in writing clean, maintainable, and testable code.</li>\n<li>You have 3+ years of experience in a fast-paced tech environment, startup, or scale-up where engineers wear multiple hats and define the products together with users. </li>\n<li>You are a force multiplier for your team. You always catch up with new front-end trends, love building reusable components, and helping other engineers become better day by day.</li>\n<li>You can communicate and structure your thoughts well both inside and outside of your team to ensure we ship products in time without getting lost in details.</li>\n<li>You have experience in mentoring junior developers or leading a small team.</li>\n<li>You have experience in working and improving a remote team culture.</li>\n</ul><div><strong>Responsibilities</strong></div><ul>\n<li>You’ll design, develop, and maintain new user-facing features with beautiful and scalable UI components using Angular and TypeScript</li>\n<li>You’ll contribute to new and existing products by shaping features with product and design teams. </li>\n<li>You’ll implement state management and improved authentication across the platform</li>\n<li>You’ll implement complex Angular components from drag &amp; drop to the virtualized rendering of large data collections</li>\n<li>You’ll mentor and develop junior engineers to help them become expert Secfixers</li>\n<li>You’ll keep learning new technologies to improve our product and will structure complex product in simple deliverables</li>\n<li>You’ll redefine best-in-class software development processes so that we can build an opinionated product for the European SMB market.</li>\n<li>You’ll work closely with founders, tech lead, other team members, and users to ship features on schedule.</li>\n</ul><div><br></div><div><strong>Our Tech</strong></div><ul>\n<li>Angular frontend with styled-components &amp; TypeScript</li>\n<li>Ngrx State management</li>\n<li>Java Springboot, Node Nest.js, Postgres, and RDS as backend</li>\n<li>Hosted on AWS with ECS, EKS</li>\n<li>Gitlab, Slack, Notion, <a href=\"http://gather.town/\">Gather.town</a> for communication and documentation</li>\n<li>Clickup for project management</li>\n<li>Design system with Bootstrap Angular component library</li>\n</ul><div><br></div><div><strong>We are very proud of our Secfix values - and look for candidates who share them. They are:</strong></div><ul>\n<li>We are obsessed with our customers. We start with the customer and work our way backward to create amazing products they love.</li>\n<li>We build everything in a smart way. We love working by YCombinator's principles and preach those to our team.</li>\n<li>We create trust within our organisation. Transparency and ethics are within our DNA.</li>\n<li>We are hacky. A functional prototype delivered within 2 weeks is worth more than a perfect solution delivered in 2 months.</li>\n<li>We take ownership. Building a startup is about ownership and being accountable for timely delivery.</li>\n<li>We are leaders of remote work. We are passionately building a culture where people can be productive working from anywhere.</li>\n</ul><div><br></div><div><strong>Benefits you get at Secfix:</strong></div><ul>\n<li>We are backed by top VCs and accelerators. Get direct access to world-class mentors.</li>\n<li>Industry-competitive base salary and generous equity package. We pay local rates that are at or above the market. We share this <a href=\"https://about.gitlab.com/blog/2019/02/28/why-we-pay-local-rates/\">philosophy with GitLab</a>.</li>\n<li>Secfix is run by international founders in Germany. We can help you move to Germany and get a visa or just hire you locally with our partner Deel. And we have a track record! Our Customer Success Manager moved to Germany from Brazil and our Account Executive from LA.</li>\n<li>Receive the latest tech equipment (MacBook, monitors, headphones)</li>\n<li>Health insurance</li>\n<li>Remote Workspace budget to make your home office great</li>\n<li>Access to co-working around the world</li>\n<li>Flexible Work Hours and Location</li>\n<li>26 vacation days per year, in addition to local Public Holidays</li>\n<li>100% remote work - enhanced by our virtual office in <a href=\"https://www.gather.town/\">Gather </a>\n</li>\n<li>Virtual and on-site Team Building Activities, Lunch and Learns, and other Company-Wide Events</li>\n<li>A Personal Development Budget of 1,000 EUR per year - available for whatever you wish to support your health and fitness, mental health, and learning &amp; development</li>\n<li>Have more ideas for perks? You can make them a reality at Secfix 🙂</li>\n</ul><div><br></div><div><strong>Interview Process:</strong></div><ul>\n<li>30 min - Screening call</li>\n<li>30 min - Interview with our Chief of Staff</li>\n<li>Tech Assessment (either take-home or live)</li>\n<li>2h - Final \"Virtual On-Site Interview\" with team &amp; Co-Founders in Gather, our virtual office</li>\n</ul><div><br></div><div>\n<em>Please note: We are an equal-opportunity employer and remote-only company. At this time, we can support hiring only within EU time zones. We work in sync using Gather as our virtual office. As a small fast-growing company, we believe in the need for an in-sync component of daily communication and therefore cannot support 100% asynchronous work. </em><a href=\"https://www.notion.so/secfix/Remote-Culture-93bf571583904c5e814b7afd83c240f2?pvs=4\"><em>Read more about our Remote Culture here</em></a><em>.</em>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/secfix-senior-frontend-engineer\">https://weworkremotely.com/remote-jobs/secfix-senior-frontend-engineer</a></p>\n", "Publication Date": "Thu, 30 Nov 2023 12:53:56 +0000", "Link": "https://weworkremotely.com/remote-jobs/secfix-senior-frontend-engineer", "Expiry Date": "Sat, 30 Dec 2023 12:53:56 +0000"}, {"Region": "Anywhere in the World", "Title": "Float: Senior Front-end Engineer", "Category": "Front-End Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> New York\n    <br /><strong>URL:</strong> <a href=\"http://float.com\">http://float.com</a>\n</p>\n\n<div><strong>Who We Are</strong></div><div>Float is the world’s leading software for teams to plan their time. Launched in 2012, we’ve grown every year since, and remain proudly independent, self-funded and profitable. We’re a team of 46 working 100% remotely and you’ll be partnering with team members distributed across the world including Australia, Canada, Mexico and Taiwan. Hear what our team has to say by browsing <a href=\"https://www.float.com/blog/\"><strong>our blog</strong></a>, or reading our <a href=\"https://www.glassdoor.com/Overview/Working-at-Float-EI_IE2055330.11,16.htm\"><strong>Glassdoor reviews</strong></a>. Check out what our customers think of Float <a href=\"https://www.g2.com/products/float-float/reviews\"><strong>from our G2 reviews</strong></a>.<br><br>\n</div><div>We’re on a scale up journey, and we’re seeking people who thrive in this stage, given the autonomy, and the opportunity, to do the best work of their career.<br><br>\n</div><div><br></div><div><strong>Why We’re Hiring For This Role</strong></div><div>Our front-end team is responsible for our customer facing applications which are the primary method by which our customers get their value from Float. We support a web application, an iOS app, an Android app, and a desktop app (Electron), all of which share a considerable amount of code, and they are only getting bigger.<br><br>\n</div><div>As our product continues to grow our customer base continues to grow with it. We are seeking a skilled engineer to help move things forward and also to provide the all important coverage and maintenance to ensure that we can continue to deliver the high quality experience that our customers have come to expect.<br><br>\n</div><div>That’s where you come in.<br><br>\n</div><div>You’ll join a smart, capable group of engineers specifically focused on the web application, ensuring that the primary vehicle to deliver value remains exactly that. You’ll be helping to push forward the state of the art in web-based resource management, allowing customers to make the most of their time and providing value far beyond our cost.<br><br>\n</div><div>We have some ambitious goals as a company and in order to fulfill them, we have some equally ambitious goals for our web application. We’re keen to be able to support our customers as they become more successful and grow, and this ever-increasing growth is starting to challenge some of our older systems. We’re eager to re-imagine our front-end so that we are able to support customers that are multiples the size of our current larger customer.<br><br>\n</div><div>In this role, you’ll be an integral member of the team, contributing regular impactful changes and improvements to an application used for significant intervals of time each day by over 4,000 customers.</div><div>\n<br><br>\n</div><div>Our Team Lead, Haakon, explains the important role you will play within our Interfaces team. <a href=\"https://www.loom.com/share/a18da435788649279e7f6cbd523902f7?sid=0691ddce-8d20-4883-80e6-59f0e803d3b7\"><strong>Watch this video.</strong></a><a href=\"https://www.loom.com/share/a18da435788649279e7f6cbd523902f7\"><strong><img src=\"https://cdn.loom.com/sessions/thumbnails/a18da435788649279e7f6cbd523902f7-with-play.gif\" width=\"640\" height=\"360\"></strong></a>You’ll be working asynchronously with a bright, dedicated team from across the globe, with a strong focus on taking complex problems and creating solutions that feel simple and intuitive for our customers.<br><br>\n</div><div><br></div><div><strong>What You’ll Be Responsible For</strong></div><div>You’ll join our web application team and after an initial familiarization process you’ll likely find yourself leading a product-focused project in an upcoming cycle – perhaps bringing to life our project reports with improved charts and visualizations, or adding delight to every interaction of our onboarding experience. You’ll be responsible for discussing the specification with the Product and Design stakeholders, understanding the problem to be solved and satisfying yourself that we are able to produce a deliverable satisfying any constraints - performance being a key one.<br><br>\n</div><div>Over time, you’ll likely specialize in some particular area of our application based on the overall front-end architecture, being responsible for resolving any regressions or bugs within that area as well as being the point of contact for any customer-sourced queries or similar.<br><br>\n</div><div>As you become more comfortable with the product as a whole, it would be expected that you become more involved in the wider-ranging discussions on the future direction of our front-end architecture, and in particular how we can ensure that our web application can evolve to support our ambitious scaling goals, whether that be by wholesale rewrites of certain areas or strategic incremental changes or even simply more process &amp; guidelines around how to develop within this performance-critical area.<br><br>\n</div><div>You will quickly become a core member of the team, responsible for customer visible aspects of our product, working with our User Experience team to understand how our customers work with our product and how they want to use it, so that we can help them to make the most of it.</div><div>\n<br><br>\n</div><div><strong>What You’ll Need To Be Successful</strong></div><div>We’re looking for a strong, seasoned engineer with at least six years experience in leading and shipping successful and demanding projects to a global audience, working as part of a small focused team to deliver objectives, being comfortable managing your time and communicating clearly with other members of the team.<br><br>\n</div><div>You’ll be excited and eager to work on a sophisticated web application and solve data and presentation problems in a performant manner for our world-wide user-base. You’ll understand the commitment that requires but also the fascinating challenges it can present.<br><br>\n</div><div>You’d be described by your colleagues as a React expert and are completely comfortable working in an application written with React combined with Redux and Reselect for the state management aspects.<br><br>\n</div><div>You have a passion for usability and able to account for the needs and ergonomics of both the end users of our interfaces, and the developers that will build them.<br><br>\n</div><div>With respect to styling, we favor a CSS-in-JS approach that does not rely heavily on utility classes—no Tailwind here!<br><br>\n</div><div>We’re currently in the process of migrating our front-end codebase to TypeScript, so familiarity with that is crucial.<br><br>\n</div><div>In addition, you should be familiar with Jest or Vitest for all things testing and should be comfortable operating in a monorepo environment.<br><br>\n</div><div>Experience with the following would be a big plus:</div><ul>\n<li>Building Android and iOS apps with React Native</li>\n<li>Implementing Design Systems as a means to bridge the gap between design and development and provide a consistent user experience</li>\n<li>Accommodating accessibility standards and best-practices</li>\n<li>Working with distributed systems &amp; event-based architectures at scale</li>\n</ul><div>Finally, you should be very comfortable working asynchronously, since the nature of our Engineering team is that we are distributed around the world. We rely on clear, concise, and proactive written communication to ensure we all have clarity and that any problems are raised in good time so we have the necessary time to react. You will have the freedom to set your own schedule and the autonomy to do so - provided you continue to deliver and communicate, we’re very hands-off on how you structure your days.<br><br>\n</div><div><br></div><div><strong>Why Join Us</strong></div><div>Pay for this role is US $161,475 (Level 3). Here’s a <a href=\"https://www.float.com/blog/why-were-changing-the-way-we-compensate-at-float/\"><strong>blog post</strong></a> with more information on how we determine our salaries.<br><br>\n</div><div>We’re a global <a href=\"https://www.float.com/blog/giving-our-team-agency-over-their-time/\"><strong>async remote company</strong></a> with a diverse team of people from all over the world who share a common belief in living our <a href=\"https://www.float.com/blog/\"><strong>best work life</strong></a>. We believe deeply in the idea of transparency and share our <a href=\"https://www.notion.so/Float-Handbook-9bf7a6a869744d41b2adfaa1c9131746\"><strong>Float Handbook</strong></a> publicly so potential new team members can see first hand our <a href=\"https://www.notion.so/floatteam/Perks-Benefits-b0ce164a369d44138c9dea1ef0178f7a\"><strong>perks &amp; benefits</strong></a> as well as our <a href=\"https://www.notion.so/floatteam/How-We-Work-4727bfc669f647e790f2809efa92f8fe\"><strong>ways of working</strong></a>. If you feel like you can thrive at Float to do your best work, we would love to hear from you.<br><br>\n</div><div>\n<br><em>Note: Industry research shows that women and those in traditionally underrepresented groups generally don’t apply to jobs unless they check all the boxes for the role. If you feel strongly that you have what it takes for this role but don’t check 100% of the boxes—that’s okay—we encourage you to apply anyway and highlight what you can bring to the table.<br></em><br>\n</div><div><br></div><div><strong>Hiring Process For This Role</strong></div><div>You’ll find a lot of useful information about our interview process and what it’s like to join our global team on the <a href=\"https://www.float.com/careers\"><strong>Float careers page</strong></a>. The hiring process for this role looks like this:<br><br>\n</div><ul>\n<li>\n<strong>Initial First Meet:</strong> If your application is shortlisted, you will have a 15-minute meeting with our Talent team. This meeting gives us an opportunity to learn more about your experience and also allows you to ask any questions you have about the role. We run through questions like the following:<ul>\n<li>Why do you feel your work experience aligns with this role at Float specifically?</li>\n<li>What do you enjoy most about your current role? What will you be happy to leave behind?</li>\n<li>What are your career goals for the next 2-4 years?</li>\n</ul>\n</li>\n<li>\n<strong>Technical Exercise:</strong> If you move forward you will be invited to complete a technical exercise that allows us to learn more about your technical skills. This is done at your own pace but on average takes between 4-8 hours to complete. Candidates that complete the exercise and meet the technical skill requirements will move on to the co-worker interview.</li>\n<li>\n<strong>Co-Worker Interview:</strong> You’ll meet with Haakon and Guido from our Dev team, for a 45-minute interview that will deep dive into your related skills and experience and run through you</li>\n<li>\n<strong>Management Interview:</strong> We take a very collaborative approach to hiring, so you’ll meet with Colin, our Director of Engineering and Lars, our CTO, for a 30-minute interview.</li>\n<li>\n<strong>Final Interview:</strong> As the final step in the process, you’ll meet with Glenn, Float’s CEO, for a 30-minute interview.<br><br>\n</li>\n</ul><div>Our hiring process takes an average of 24 days from the first interview to a job offer (based on YTD 2023 data). Romina or Linda from our Talent team will be in touch each step of the way to ensure that you are well informed and aware of the next step in the process.<br><br>\n</div><div>Unfortunately, due to the high volume of applications, we can only contact candidates who have been shortlisted for the role. If you do not hear from us within 14 days of submitting your application, we encourage you to apply for another role in the future.<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/float-senior-front-end-engineer\">https://weworkremotely.com/remote-jobs/float-senior-front-end-engineer</a></p>\n", "Publication Date": "Wed, 25 Oct 2023 04:59:25 +0000", "Link": "https://weworkremotely.com/remote-jobs/float-senior-front-end-engineer", "Expiry Date": "Sun, 24 Dec 2023 04:59:25 +0000"}], "Back-End Programming Jobs": [{"Region": "Anywhere in the World", "Title": "Toggl: Senior Backend Engineer", "Category": "Back-End Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Tallin\n    <br /><strong>URL:</strong> <a href=\"https://toggl.com/jobs/\">https://toggl.com/jobs/</a>\n</p>\n\n<div>\n<br>We are looking for an experienced Senior Backend Engineer to help us shape the future of the time-tracking industry and deliver real value to our customers with both new and improved features.<br><br>\n</div><div>The salary for this position is <strong>€80,000</strong> annually.<br><br>\n</div><div>You can work <strong>from anywhere in the world as long as your main location is between UTC-4 and UTC+8:00.<br></strong><br>\n</div><div>\n<strong><br>About the Team<br></strong><br>\n</div><div>We are a global team of 100+ awesome people working from over 40 countries around the globe. We hire globally, you work locally—in the heart of London, a beach outside of São Paulo, or a quiet village near Florence, the choice is yours. Every few months we travel to meet up somewhere in the world and spend some quality time together. We place a huge amount of trust in our people, and we measure the outcomes rather than the work itself. <a href=\"https://toggl.com/culture/\">Our values</a> fuel our results.<br><br>\n</div><div>\n<strong><br>The Role<br></strong><br>\n</div><div>As a Senior Backend Engineer, you will be taking ownership of one or more domains of our product and will work closely with other Backend and Frontend engineers using cutting-edge open source frameworks to develop highly-available RESTful services and back-end systems.</div><div>\n<br>The main technologies you will be working with are Go, PostgreSQL and Google Cloud Infrastructure. <strong>Our team meetings can happen between 11:00 and 15:00 UTC.</strong> You need to be willing and available to attend these meetings when they happen<br><br>\n</div><div>Your main responsibilities will be:</div><ul>\n<li>developing, scaling and maintaining some of our backend services including the API, reports and other infrastructure services that manage our product and logistics worldwide</li>\n<li>working with multiple teams day to day to bring more value to Toggl’s users, covering customer-facing web and native applications and public APIs</li>\n<li>designing, breaking down, and completing projects of a medium to large scope with high-level productivity</li>\n<li>looking for technical problems of existing system/product without guidance and offering solutions</li>\n<li>leading projects with a small group of people, such as hosting weekly meetings, communicating with other partners and stakeholders</li>\n</ul><div><strong><br>About you</strong></div><div>\n<br>We would love to hear from you if you strive to solve technical problems of high scope and complexity and have long-standing experience programming in Go.<br><br>\n</div><div>In particular, we are looking for:</div><ul>\n<li>Strong backend engineering experience in Go;</li>\n<li>Significant professional experience with distributed systems, PostgreSQL, and Google Cloud Infrastructure;</li>\n<li>Experience with software engineering best practices (e.g. unit testing, code reviews, design documentation);</li>\n<li>Experience with performance and optimisation problems, particularly at large scale, and a demonstrated ability to both diagnose and prevent these problems;</li>\n<li>Ability to work cross-teams and improve cross-functional relationships which will facilitate ongoing projects;</li>\n<li>Eagerness to make contributions to improve the engineering team. For example, activities like interviewing, or mentoring;</li>\n<li>Mentor and grow junior engineers;</li>\n<li>Ability to give on-point and actionable feedback to peers;</li>\n<li>Effective communication skills: regularly achieve consensus with peers and clear status updates;</li>\n<li>Collaborate across the company to define, design, build and improve our product;</li>\n<li>Proficiency in the English language, both written and verbal, is required for success in a remote and largely asynchronous work environment;</li>\n</ul><div>Bonus points for:</div><ul>\n<li>Having full-stack experience;</li>\n<li>Experience with data warehouse and analytics systems</li>\n<li>Experiences with Kubernetes at scale</li>\n<li>Experience with system architecture at scale</li>\n</ul><div><strong><br>Benefits</strong></div><ul>\n<li>Freedom to choose when and how much you work - we only measure results</li>\n<li>24 days of paid time off a year, plus your local holidays</li>\n<li>In-person meetups for team-building (expenses covered)</li>\n<li>4-6 weeks paid sabbatical (depending on the tenure)</li>\n<li>Laptop budget up to €2,500 and it renews every 3 years</li>\n<li>€2,000 budget to set up your home office, and additional €300 every year after 3 years of tenure</li>\n<li>€250 per month for co-working space membership and/or internet service at home</li>\n<li>€4,000 per year contribution to use for training, workshops, and conferences</li>\n<li>€2,000 per year contribution for any equipment or services to improve and/or maintain your physical and mental health</li>\n<li>Support for buying tools you need for doing your best work (even eyeglasses if you need a new pair)</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/toggl-senior-backend-engineer-2\">https://weworkremotely.com/remote-jobs/toggl-senior-backend-engineer-2</a></p>\n", "Publication Date": "Tue, 05 Dec 2023 13:59:50 +0000", "Link": "https://weworkremotely.com/remote-jobs/toggl-senior-backend-engineer-2", "Expiry Date": "Thu, 04 Jan 2024 13:59:50 +0000"}, {"Region": "Anywhere in the World", "Title": "Whitespectre: Senior Data Engineer", "Category": "Back-End Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Remote\n    <br /><strong>URL:</strong> <a href=\"http://www.whitespectre.com/\">http://www.whitespectre.com/</a>\n</p>\n\n<div>\n<strong>We are looking for a Senior Data Engineer</strong> to join our growing team of technologists. In this position, you will work in a multidisciplinary team to understand, design and transform disparate data sources into ERP and warehousing systems.<br><br>\n</div><div>Day to day, you’ll work within a fast-moving delivery squad comprising product management, engineering and QA who work towards delivering and optimizing features that drive core business value to our clients. </div><div><br></div><div>\n<a href=\"http://www.whitespectre.com/\"><strong>Whitespectre</strong></a> is a product-centric, technology consultancy for both VC funded start-ups and large, established companies across the US and Europe. We’re also a product incubator with our own applications and B2B SaaS platform. As long-term partners to our clients, we’ve played a critical role in their growth - both through the products we co-create and the expertise and processes we bring. Proudly remote first since 2013, we’re a close-knit team of 75, working in fast-moving, cross-functional agile pods to solve interesting technical challenges and drive real business impact.<br><br>\n</div><div><strong>In this role you will:</strong></div><ul>\n<li>Analyze, design and build data pipelines for missing data from known sources to a data lake / data warehouse (AWS products)</li>\n<li>Transform data into common data models / tables of known structure at both detailed and aggregated levels</li>\n<li>Extract and upload data to an ERP (Netsuite) via custom REST endpoints</li>\n<li>Create logging and sanity checks to adhere to data validation requirements</li>\n</ul><div>The primary technologies you will use include Python, AWS Glue, AWS Lambda, DBT, Meltano, and Spark.<br><br>\n</div><div><strong>Benefits</strong></div><ul>\n<li>Competitive salaries, with payment in USD</li>\n<li>Annual Performance &amp; Salary Reviews, with proactive career management</li>\n<li>20 Days PTO &amp; 3 Charity Days annually</li>\n<li>Funded face-to-face meet ups in Barcelona, as well as, South America and Asia</li>\n<li>Assisted Relocation package </li>\n<li>Flexible working hours for efficient teaming in a 100% remote environment (proudly remote-first for 10 years!)</li>\n<li>Free English classes &amp; educational expenses support</li>\n<li>Generous Employee Referral Plan</li>\n<li>Team Fitness and Charity Initiatives<br><br>\n</li>\n</ul><div>\n<strong>Cultural benefits<br></strong><br>\n</div><div>In addition to the above benefits, we foster an inclusive working environment that provides:</div><ul>\n<li>Great company environment - check out <a href=\"https://www.glassdoor.com/Reviews/Whitespectre-Reviews-E1575846.htm?countryRedirect=true\"><strong>Glassdoor</strong></a>\n</li>\n<li>Personalized onboardings</li>\n<li>Opportunity to contribute to company-level initiatives</li>\n<li>Work with a broad range of best-in-class technologies</li>\n<li>Cross-company knowledge groups - improve your expertise, share your learnings and work with different technologies and tools</li>\n<li>Regular brown bag learning sessions</li>\n<li>An emphasis on Work-life balance<br><br>\n</li>\n</ul><div><strong>This is the right position for you if want</strong></div><ul>\n<li>The challenge of collaborating with business stakeholders and Product Managers to design and advocate for technology solutions while bearing in mind the tradeoffs for business results</li>\n<li>The responsibility of designing new processes, and being confident to justify your technology decisions. (Plus debating and recognizing when a colleague has an even better idea!)</li>\n<li>The opportunity to go outside your core expertise and strengthen skills with other technologies and learn more</li>\n<li>An environment where excellent communication skills (both verbal and written) are valued and honed.</li>\n<li>A culture where people from different backgrounds interact, collaborate and reach a shared goal<br><br>\n</li>\n</ul><div><strong>The “check the box” Requirements</strong></div><ul>\n<li>5+ years of experience as a Data Engineer, with additional software engineering experience as an advantage</li>\n<li>Expertise working with SQL to extract, transform, and load data</li>\n<li>Demonstrated hands-on experience across Python, AWS Lambda, AWS Glue, DBT, Meltano, Spark, Redshift, PostgreSQL (or similar)</li>\n<li>Experience with JS/Node is an advantage</li>\n<li>Advanced English level, excellent verbal and written communication skills</li>\n<li>Experience contributing to technical decision-making within a team</li>\n<li>Can work full-time with a significant overlap with both CET and PST working hours. </li>\n<li>Live outside of the US. Please, no recruitment agencies.</li>\n</ul><div><br></div><div><strong>Interested in applying?</strong></div><ul><li>Apply by completing the form - and we’ll get back to you. </li></ul><div><br></div><div><br></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/whitespectre-senior-data-engineer\">https://weworkremotely.com/remote-jobs/whitespectre-senior-data-engineer</a></p>\n", "Publication Date": "Fri, 17 Nov 2023 09:52:39 +0000", "Link": "https://weworkremotely.com/remote-jobs/whitespectre-senior-data-engineer", "Expiry Date": "Sun, 17 Dec 2023 09:52:39 +0000"}, {"Region": "Anywhere in the World", "Title": "Tactiq: Senior API Platform Engineer", "Category": "Back-End Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Richmond, VA \n    <br /><strong>URL:</strong> <a href=\"https://www.tactiqtech.com/\">https://www.tactiqtech.com/</a>\n</p>\n\n<div><strong><em>Tactiq has several Python developer openings at mid- and senior levels!</em></strong></div><h1><strong>Senior API Platform Engineer</strong></h1><div>\n<strong>Join Tactiq</strong>, the growing eLogistics leader keeping food on local shelves across the US. Our team is building SaaS solutions to everyday out-of-stock and invoicing problems faced by America's largest retailers. Our developers deliver native mobile apps and web applications backed by cloud APIs that enable you to buy the food you love from over 30,000 of the stores you trust.<br><br><em>About our time zones:  We recruit only within UTC  to UTC -7 because we value collaboration and working sane hours!</em>\n</div><div>\n<strong><br>Responsibilities</strong>:</div><ul>\n<li>Collaborate on product API design  </li>\n<li>Write test-friendly code and test it</li>\n<li>Collaborate with DevOps and QA to create automated builds</li>\n<li>Be agile and awesome </li>\n</ul><div><br></div><div><strong>Qualifications: </strong></div><ul>\n<li>5+ years working with Python</li>\n<li>Relational database and AWS experience </li>\n<li>Strong written and verbal English communications </li>\n<li>Enthusiasm, curiosity and drive! </li>\n</ul><div><br></div><div><em>All qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. EOE</em></div><div>\n<br><strong>Apply online or email: RecruitingEngineering@tactiqtech.com</strong>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/tactiq-senior-api-platform-engineer\">https://weworkremotely.com/remote-jobs/tactiq-senior-api-platform-engineer</a></p>\n", "Publication Date": "Wed, 04 Oct 2023 11:49:41 +0000", "Link": "https://weworkremotely.com/remote-jobs/tactiq-senior-api-platform-engineer", "Expiry Date": "Tue, 02 Jan 2024 11:49:41 +0000"}, {"Region": "Anywhere in the World", "Title": "GoTu (formerly TempMee): Backend Developer", "Category": "Back-End Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0126/5351/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Miami, FL, United States\n    <br /><strong>URL:</strong> <a href=\"https://tempmee.com\">https://tempmee.com</a>\n</p>\n\n<div>Venture-backed Miami based tech startup seeking an experienced Backend Developer.<br><br>TempMee is changing the way the world works - starting with the Dental Industry! We are an ambitious and motivated tech startup that has secured multiple rounds of venture backing to create an Uber-like platform/app to disrupt the dental staffing industry. After launching in late 2019, we have already built the largest community of nationwide hygienists and dental offices, dwarfing our established competition in the dental tech staffing space. It is truly a matter of time until TempMee is the industry standard for dental staffing needs in the Dental Community!<br><br>Working with TempMee means you will be working alongside committed fellow engineers who know their work is critical to the company's success. We are a people-first company that actively seeks your input to make you more successful in your role! We like to have fun with our work and encourage you to get to know the people you work with. We have a motto - Hard work doesn’t have to be serious!<br><br>Qualifications:<br><br>- 3-5 years of experience with software development in one or more programming languages<br>- Must be available on weekdays for meetings 9 AM - 11 AM Eastern American time;<br>- 3 years of experience testing, maintaining, or launching software products, and 1 year of experience with software design and architecture<br>- Solid programming skills in JavaScript<br>- Deep understanding of relational database systems, specifically MySQL and Postgres<br>- Understanding NoSQL Datastores such as ElasticSearch, and MongoDB is a plus<br>- Experience building scalable, performant, and modular solutions<br>- Understanding of modern cloud technologies such as AWS or Google Cloud<br>- Experience with microservices and service-oriented architecture</div><div>\n<br>What you'll do<br><br>- Work in an exciting and high-growth startup<br>- Research novel solutions to nuanced and often unchartered engineering challenges<br>- Work with designers, product managers, and engineers to design impactful products<br>- Perform and uphold code best practices.<br>- Produce high-quality code that raises the bar for all engineering team members<br>- Improve scalable distributed systems on the cloud<br>- Improve web applications for performance and scalability<br>- Perform quality assurance/debugging procedures to provide a secure and functional delivery<br>- Implement testing protocols for managing successful deployments across development, staging, and production environments<br>- Recommend system solutions by comparing the advantages and disadvantages of custom development and purchasing alternatives<br><br>We are excited to meet you!<br><br>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/tempmee-backend-developer\">https://weworkremotely.com/remote-jobs/tempmee-backend-developer</a></p>\n", "Publication Date": "Tue, 03 Oct 2023 21:49:47 +0000", "Link": "https://weworkremotely.com/remote-jobs/tempmee-backend-developer", "Expiry Date": "Mon, 01 Jan 2024 21:49:47 +0000"}, {"Region": "Anywhere in the World", "Title": "XM: Senior PHP Web Developers– Cyprus, Greece or Remote", "Category": "Back-End Programming", "Type": "Full-Time", "Description": "\n\n<p>\n  <strong>Headquarters:</strong> Cyprus, Greece or Remote\n    <br /><strong>URL:</strong> <a href=\"https://xm.com\">https://xm.com</a>\n</p>\n\n<div>\n<strong>Reference Number: SPHPWD1021<br></strong><br>\n</div><div>\n<strong> <br></strong><br>\n</div><div>\n<strong>The role:<br></strong><br>\n</div><div>As our new Senior PHP Developer, you will join an amazing team who is dedicated to taking the next step in software engineering. You will make key decisions on software processes, and use Kubernetes and Terraform on PHP, Go, React &amp; Angular on AWS. The team will keep you up-to-date with the latest technology stacks and processes and help you see challenging projects from beginning to end.<br><br>\n</div><div> <br><br>\n</div><div>\n<strong>The main responsibilities of the role include:<br></strong><br>\n</div><div>●        Design and implement new features/projects</div><div>●        Maintain and refactor existing web applications such as the company's website, registration forms, Members Area and internal web services</div><div>●        Research and integrate new web technologies</div><div>●        Write tests that will run on a continuous integration server 24/7 to ensure code testability, code coverage and quality conforms to the company’s highest standards</div><div>●        Resolve support tickets for IT related issues</div><div>\n<strong> <br></strong><br>\n</div><div>\n<strong>Main requirements:<br></strong><br>\n</div><div>●        BSc/MSc in information technology or any other relevant degree</div><div>●        At least 3 years of experience in a similar position</div><div>●        Very good knowledge of PHP 7+, MySQL, Redis, Git</div><div>●        Very good understanding of object-oriented programming principles</div><div>●        Experience in creating and consuming web services</div><div>●        Experience with modern PHP frameworks</div><div>●        Experience in writing tests with PHPUnit</div><div>●        Ability to research and adapt new web technologies that add value to the team</div><div>●        Strong organisational skills with the ability to multitask and prioritise</div><div>●        Problem solving and analytical skills</div><div>●        Ability to work independently and integrate well within a team</div><div>\n<strong> <br></strong><br>\n</div><div>\n<strong>The following will be considered an advantage:<br></strong><br>\n</div><div>●        Experience in Symfony framework</div><div>●        Experience in the development of REST APIs</div><div>●        Experience in software development practices like design patterns, SOLID principles, DRY</div><div>●        Very good understanding of security practices (OWASP)</div><div>●        Experience with cloud providers (e.g. AWS)</div><div>●        Experience in database query optimization</div><div>●        Experience in creating composer packages</div><div>●        Experience in front-end frameworks or libraries like Angular or React</div><div>\n<strong> <br></strong><br>\n</div><div>\n<strong>Benefit from:<br></strong><br>\n</div><div>●        Attractive remuneration package </div><div>●        Private health insurance</div><div>●        Food allowance</div><div>●        Intellectually stimulating work environment</div><div>●        Continuous personal development and international training opportunities</div><div> </div><div>\n<br>Type of employment: Full time<br><br>\n</div><div>\n<br>Location: Cyprus, Greece or Remote <br><br>\n</div><div>\n<br> <br><br>\n</div><div>Please visit our website <a href=\"http://www.xm.com/careers\">www.xm.com/careers</a> to submit your online application for this position. </div><div> </div><div> </div><div><strong>All applications will be treated with strict confidentiality!</strong></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/xm-senior-php-web-developers-cyprus-greece-or-remote-2\">https://weworkremotely.com/remote-jobs/xm-senior-php-web-developers-cyprus-greece-or-remote-2</a></p>\n", "Publication Date": "Wed, 12 Jul 2023 07:46:28 +0000", "Link": "https://weworkremotely.com/remote-jobs/xm-senior-php-web-developers-cyprus-greece-or-remote-2", "Expiry Date": "Mon, 08 Jan 2024 07:46:28 +0000"}, {"Region": "Anywhere in the World", "Title": "Sticker Mule: Site Reliability Engineer", "Category": "Back-End Programming", "Type": "Full-Time", "Description": "<img src=\"https://we-work-remotely.imgix.net/logos/0082/0772/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> New York, NY\n    <br /><strong>URL:</strong> <a href=\"https://www.stickermule.com\">https://www.stickermule.com</a>\n</p>\n\n<div>\n<strong>About Sticker Mule</strong><br>Sticker Mule is the Internet's most \"kick ass\" brand. We are privately-owned, profitable, and powered by a globally distributed team that enjoys building happy customer experience at the highest technical standards. Our software team operates from 17 countries, and we're always looking for more exceptional engineers.</div><div>\n<br><br>The SRE team is responsible for building, maintaining and securing our services infrastructure, while participating in the weekly on-call schedule.</div><div><a href=\"https://www.stickermule.com/about\"><strong><br>See more about our teams here</strong></a></div><div><strong><br>We offer</strong></div><ol>\n<li>Remote work with flexible schedules</li>\n<li>A privately owned, low-stress culture</li>\n<li>A fun \"no bullshit\" work environment</li>\n</ol><div><strong><br>We like you to know</strong></div><ol>\n<li>Docker</li>\n<li>Kubernetes</li>\n<li>GCP</li>\n<li>AWS</li>\n<li>Go</li>\n<li>Postgres</li>\n<li>Redis</li>\n<li>Familiarity with JavaScript</li>\n<li>Excellent communication skills (English)</li>\n<li>Degree in Computer Science or equivalent practical experience</li>\n</ol><div><strong><br>Challenges</strong></div><ol>\n<li>Build CI and CD pipelines</li>\n<li>Optimize and scale workloads</li>\n<li>Secure containers and web services</li>\n</ol><div><strong><br>Compensation and benefits</strong></div><ol>\n<li>Salary: $135k+ based on experience</li>\n<li>$20,000 signing bonus</li>\n<li>4 weeks vacation + holidays based on your country of residence</li>\n</ol><div><br></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/sticker-mule-site-reliability-engineer-1\">https://weworkremotely.com/remote-jobs/sticker-mule-site-reliability-engineer-1</a></p>\n", "Publication Date": "Fri, 21 Oct 2022 14:03:48 +0000", "Link": "https://weworkremotely.com/remote-jobs/sticker-mule-site-reliability-engineer-1", "Expiry Date": "Fri, 15 Dec 2023 14:03:48 +0000"}]}, "Total Job Count": 57, "Platform": "We Work Remotely"}